TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Nov  2 17:14:27 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\RELEASE")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_clearInterruptStatus")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SPI_clearInterruptStatus")

    6860              $C$DW$297       .dwtag  DW_TAG_enumerator
    6861                      .dwattr $C$DW$297, DW_AT_name("EPWM_TZ_ACTION_LOW")
    6862                      .dwattr $C$DW$297, DW_AT_const_value(0x02)
    6863                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/f
    6864                      .dwattr $C$DW$297, DW_AT_decl_line(0x30e)
    6865                      .dwattr $C$DW$297, DW_AT_decl_column(0x05)
    6866              
    6867              $C$DW$298       .dwtag  DW_TAG_enumerator
    6868                      .dwattr $C$DW$298, DW_AT_name("EPWM_TZ_ACTION_DISABLE")
    6869                      .dwattr $C$DW$298, DW_AT_const_value(0x03)
    6870                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/f
    6871                      .dwattr $C$DW$298, DW_AT_decl_line(0x30f)
    6872                      .dwattr $C$DW$298, DW_AT_decl_column(0x05)
    6873              
    6874                      .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/
    6875                      .dwattr $C$DW$T$59, DW_AT_decl_line(0x30b)
    6876                      .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    6877                      .dwendtag $C$DW$T$59
    6878              
    6879                      .dwendtag $C$DW$TU$59
    6880              
    6881              
    6882              $C$DW$TU$60     .dwtag  DW_TAG_type_unit
    6883                      .dwmtype  $C$DW$T$60
    6884              $C$DW$T$60      .dwtag  DW_TAG_typedef
    6885                      .dwattr $C$DW$T$60, DW_AT_name("EPWM_TripZoneAction")
    6886                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    6887                      .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/
    6888                      .dwattr $C$DW$T$60, DW_AT_decl_line(0x310)
    6889                      .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    6890              
    6891                      .dwendtag $C$DW$TU$60
    6892              
    6893              
    6894              $C$DW$TU$61     .dwtag  DW_TAG_type_unit
    6895                      .dwmtype  $C$DW$T$61
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  147

    6896              
    6897              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    6898                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    6899              $C$DW$299       .dwtag  DW_TAG_enumerator
    6900                      .dwattr $C$DW$299, DW_AT_name("HRPWM_COUNTER_COMPARE_A")
    6901                      .dwattr $C$DW$299, DW_AT_const_value(0x00)
    6902                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/f
    6903                      .dwattr $C$DW$299, DW_AT_decl_line(0xb3)
    6904                      .dwattr $C$DW$299, DW_AT_decl_column(0x05)
    6905              
    6906              $C$DW$300       .dwtag  DW_TAG_enumerator
    6907                      .dwattr $C$DW$300, DW_AT_name("HRPWM_COUNTER_COMPARE_B")
    6908                      .dwattr $C$DW$300, DW_AT_const_value(0x04)
    6909                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/f
    6910                      .dwattr $C$DW$300, DW_AT_decl_line(0xb4)
    6911                      .dwattr $C$DW$300, DW_AT_decl_column(0x05)
    6912              
    6913                      .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/
    6914                      .dwattr $C$DW$T$61, DW_AT_decl_line(0xb2)
    6915                      .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    6916                      .dwendtag $C$DW$T$61
    6917              
    6918                      .dwendtag $C$DW$TU$61
    6919              
    6920              
    6921              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
    6922                      .dwmtype  $C$DW$T$62
    6923              $C$DW$T$62      .dwtag  DW_TAG_typedef
    6924                      .dwattr $C$DW$T$62, DW_AT_name("HRPWM_CounterCompareModule")
    6925                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    6926                      .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_3_00_01_00/c2000ware/driverlib/
    6927                      .dwattr $C$DW$T$62, DW_AT_decl_line(0xb5)
    6928                      .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6929              
    6930                      .dwendtag $C$DW$TU$62
    6931              
    6932              
    6933              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    6934                      .dwmtype  $C$DW$T$25
    6935              
    6936              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6937                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    6938              $C$DW$301       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    6940                      .dwattr $C$DW$301, DW_AT_name("response")
    6941                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6942                      .dwattr $C$DW$301, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6943                      .dwattr $C$DW$301, DW_AT_decl_line(0x34)
    6944                      .dwattr $C$DW$301, DW_AT_decl_column(0x17)
    6945              
    6946              $C$DW$302       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    6948                      .dwattr $C$DW$302, DW_AT_name("crc")
    6949                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6950                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  148

    6951                      .dwattr $C$DW$302, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6952                      .dwattr $C$DW$302, DW_AT_decl_line(0x35)
    6953                      .dwattr $C$DW$302, DW_AT_decl_column(0x17)
    6954              
    6955              $C$DW$303       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$24)
    6957                      .dwattr $C$DW$303, DW_AT_name("channel0")
    6958                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6959                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6960                      .dwattr $C$DW$303, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6961                      .dwattr $C$DW$303, DW_AT_decl_line(0x36)
    6962                      .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    6963              
    6964              $C$DW$304       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$24)
    6966                      .dwattr $C$DW$304, DW_AT_name("channel1")
    6967                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6968                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6969                      .dwattr $C$DW$304, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6970                      .dwattr $C$DW$304, DW_AT_decl_line(0x37)
    6971                      .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    6972              
    6973              $C$DW$305       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$24)
    6975                      .dwattr $C$DW$305, DW_AT_name("channel2")
    6976                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6977                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6978                      .dwattr $C$DW$305, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6979                      .dwattr $C$DW$305, DW_AT_decl_line(0x38)
    6980                      .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    6981              
    6982              $C$DW$306       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$24)
    6984                      .dwattr $C$DW$306, DW_AT_name("channel3")
    6985                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6986                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6987                      .dwattr $C$DW$306, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6988                      .dwattr $C$DW$306, DW_AT_decl_line(0x39)
    6989                      .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    6990              
    6991              $C$DW$307       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$24)
    6993                      .dwattr $C$DW$307, DW_AT_name("channel4")
    6994                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6995                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6996                      .dwattr $C$DW$307, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    6997                      .dwattr $C$DW$307, DW_AT_decl_line(0x3a)
    6998                      .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    6999              
    7000              $C$DW$308       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$24)
    7002                      .dwattr $C$DW$308, DW_AT_name("channel5")
    7003                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7004                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    7005                      .dwattr $C$DW$308, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  149

    7006                      .dwattr $C$DW$308, DW_AT_decl_line(0x3b)
    7007                      .dwattr $C$DW$308, DW_AT_decl_column(0x16)
    7008              
    7009              $C$DW$309       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    7011                      .dwattr $C$DW$309, DW_AT_name("channel6")
    7012                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7013                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    7014                      .dwattr $C$DW$309, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7015                      .dwattr $C$DW$309, DW_AT_decl_line(0x3c)
    7016                      .dwattr $C$DW$309, DW_AT_decl_column(0x16)
    7017              
    7018              $C$DW$310       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$24)
    7020                      .dwattr $C$DW$310, DW_AT_name("channel7")
    7021                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7022                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    7023                      .dwattr $C$DW$310, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7024                      .dwattr $C$DW$310, DW_AT_decl_line(0x3d)
    7025                      .dwattr $C$DW$310, DW_AT_decl_column(0x16)
    7026              
    7027                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7028                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x33)
    7029                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7030                      .dwendtag $C$DW$T$25
    7031              
    7032                      .dwendtag $C$DW$TU$25
    7033              
    7034              
    7035              $C$DW$TU$63     .dwtag  DW_TAG_type_unit
    7036                      .dwmtype  $C$DW$T$63
    7037              $C$DW$T$63      .dwtag  DW_TAG_typedef
    7038                      .dwattr $C$DW$T$63, DW_AT_name("adc_data")
    7039                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$25)
    7040                      .dwattr $C$DW$T$63, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7041                      .dwattr $C$DW$T$63, DW_AT_decl_line(0x3e)
    7042                      .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    7043              
    7044                      .dwendtag $C$DW$TU$63
    7045              
    7046              
    7047              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    7048                      .dwmtype  $C$DW$T$28
    7049              
    7050              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7051                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1e)
    7052              $C$DW$311       .dwtag  DW_TAG_member
    7053                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$27)
    7054                      .dwattr $C$DW$311, DW_AT_name("iref_A")
    7055                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7056                      .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7057                      .dwattr $C$DW$311, DW_AT_decl_line(0x74)
    7058                      .dwattr $C$DW$311, DW_AT_decl_column(0x18)
    7059              
    7060              $C$DW$312       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  150

    7061                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    7062                      .dwattr $C$DW$312, DW_AT_name("vref_charge_V")
    7063                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7064                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    7065                      .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7066                      .dwattr $C$DW$312, DW_AT_decl_line(0x75)
    7067                      .dwattr $C$DW$312, DW_AT_decl_column(0x18)
    7068              
    7069              $C$DW$313       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    7071                      .dwattr $C$DW$313, DW_AT_name("vref_discharge_V")
    7072                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7073                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    7074                      .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7075                      .dwattr $C$DW$313, DW_AT_decl_line(0x76)
    7076                      .dwattr $C$DW$313, DW_AT_decl_column(0x18)
    7077              
    7078              $C$DW$314       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    7080                      .dwattr $C$DW$314, DW_AT_name("direction_logic")
    7081                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7082                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    7083                      .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7084                      .dwattr $C$DW$314, DW_AT_decl_line(0x77)
    7085                      .dwattr $C$DW$314, DW_AT_decl_column(0x17)
    7086              
    7087              $C$DW$315       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    7089                      .dwattr $C$DW$315, DW_AT_name("enable_logic")
    7090                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7091                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    7092                      .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7093                      .dwattr $C$DW$315, DW_AT_decl_line(0x78)
    7094                      .dwattr $C$DW$315, DW_AT_decl_column(0x17)
    7095              
    7096              $C$DW$316       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    7098                      .dwattr $C$DW$316, DW_AT_name("dutyRef_pu")
    7099                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7100                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7101                      .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7102                      .dwattr $C$DW$316, DW_AT_decl_line(0x79)
    7103                      .dwattr $C$DW$316, DW_AT_decl_column(0x18)
    7104              
    7105              $C$DW$317       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$27)
    7107                      .dwattr $C$DW$317, DW_AT_name("ioutCal_pu")
    7108                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7109                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7110                      .dwattr $C$DW$317, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7111                      .dwattr $C$DW$317, DW_AT_decl_line(0x7a)
    7112                      .dwattr $C$DW$317, DW_AT_decl_column(0x18)
    7113              
    7114              $C$DW$318       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  151

    7116                      .dwattr $C$DW$318, DW_AT_name("voutCal_pu")
    7117                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7118                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7119                      .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7120                      .dwattr $C$DW$318, DW_AT_decl_line(0x7b)
    7121                      .dwattr $C$DW$318, DW_AT_decl_column(0x18)
    7122              
    7123              $C$DW$319       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$26)
    7125                      .dwattr $C$DW$319, DW_AT_name("IoutGain_pu")
    7126                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7127                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7128                      .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7129                      .dwattr $C$DW$319, DW_AT_decl_line(0x7d)
    7130                      .dwattr $C$DW$319, DW_AT_decl_column(0x0f)
    7131              
    7132              $C$DW$320       .dwtag  DW_TAG_member
    7133                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$26)
    7134                      .dwattr $C$DW$320, DW_AT_name("IoutOffset_pu")
    7135                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7136                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7137                      .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7138                      .dwattr $C$DW$320, DW_AT_decl_line(0x7e)
    7139                      .dwattr $C$DW$320, DW_AT_decl_column(0x0f)
    7140              
    7141              $C$DW$321       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$26)
    7143                      .dwattr $C$DW$321, DW_AT_name("IoutGain_A")
    7144                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7145                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    7146                      .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7147                      .dwattr $C$DW$321, DW_AT_decl_line(0x7f)
    7148                      .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    7149              
    7150              $C$DW$322       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$26)
    7152                      .dwattr $C$DW$322, DW_AT_name("IoutOffset_A")
    7153                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7154                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    7155                      .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7156                      .dwattr $C$DW$322, DW_AT_decl_line(0x80)
    7157                      .dwattr $C$DW$322, DW_AT_decl_column(0x0f)
    7158              
    7159              $C$DW$323       .dwtag  DW_TAG_member
    7160                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$26)
    7161                      .dwattr $C$DW$323, DW_AT_name("VoutGain_pu")
    7162                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7163                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7164                      .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7165                      .dwattr $C$DW$323, DW_AT_decl_line(0x82)
    7166                      .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    7167              
    7168              $C$DW$324       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$26)
    7170                      .dwattr $C$DW$324, DW_AT_name("VoutOffset_pu")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  152

    7171                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7172                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7173                      .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7174                      .dwattr $C$DW$324, DW_AT_decl_line(0x83)
    7175                      .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    7176              
    7177              $C$DW$325       .dwtag  DW_TAG_member
    7178                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$26)
    7179                      .dwattr $C$DW$325, DW_AT_name("VoutGain_V")
    7180                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7181                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7182                      .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7183                      .dwattr $C$DW$325, DW_AT_decl_line(0x84)
    7184                      .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    7185              
    7186              $C$DW$326       .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$26)
    7188                      .dwattr $C$DW$326, DW_AT_name("VoutOffset_V")
    7189                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7190                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7191                      .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7192                      .dwattr $C$DW$326, DW_AT_decl_line(0x85)
    7193                      .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
    7194              
    7195                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7196                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x73)
    7197                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    7198                      .dwendtag $C$DW$T$28
    7199              
    7200                      .dwendtag $C$DW$TU$28
    7201              
    7202              
    7203              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    7204                      .dwmtype  $C$DW$T$65
    7205              $C$DW$T$65      .dwtag  DW_TAG_typedef
    7206                      .dwattr $C$DW$T$65, DW_AT_name("BTS_userInput")
    7207                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$28)
    7208                      .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7209                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x87)
    7210                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x02)
    7211              
    7212                      .dwendtag $C$DW$TU$65
    7213              
    7214              
    7215              $C$DW$TU$66     .dwtag  DW_TAG_type_unit
    7216                      .dwmtype  $C$DW$T$66
    7217              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    7218                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    7219                      .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    7220              
    7221                      .dwendtag $C$DW$TU$66
    7222              
    7223              
    7224              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    7225                      .dwmtype  $C$DW$T$31
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  153

    7226              
    7227              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7228                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
    7229              $C$DW$327       .dwtag  DW_TAG_member
    7230                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$26)
    7231                      .dwattr $C$DW$327, DW_AT_name("dutySet_pu")
    7232                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7233                      .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7234                      .dwattr $C$DW$327, DW_AT_decl_line(0x90)
    7235                      .dwattr $C$DW$327, DW_AT_decl_column(0x0f)
    7236              
    7237              $C$DW$328       .dwtag  DW_TAG_member
    7238                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$26)
    7239                      .dwattr $C$DW$328, DW_AT_name("dutySetRef_pu")
    7240                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7241                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7242                      .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7243                      .dwattr $C$DW$328, DW_AT_decl_line(0x91)
    7244                      .dwattr $C$DW$328, DW_AT_decl_column(0x0f)
    7245              
    7246              $C$DW$329       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$26)
    7248                      .dwattr $C$DW$329, DW_AT_name("ioutRef_pu")
    7249                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7250                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7251                      .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7252                      .dwattr $C$DW$329, DW_AT_decl_line(0x93)
    7253                      .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    7254              
    7255              $C$DW$330       .dwtag  DW_TAG_member
    7256                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$26)
    7257                      .dwattr $C$DW$330, DW_AT_name("ioutSet_pu")
    7258                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7259                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7260                      .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7261                      .dwattr $C$DW$330, DW_AT_decl_line(0x94)
    7262                      .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    7263              
    7264              $C$DW$331       .dwtag  DW_TAG_member
    7265                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$26)
    7266                      .dwattr $C$DW$331, DW_AT_name("ioutSense_pu")
    7267                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7268                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7269                      .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7270                      .dwattr $C$DW$331, DW_AT_decl_line(0x95)
    7271                      .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    7272              
    7273              $C$DW$332       .dwtag  DW_TAG_member
    7274                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$26)
    7275                      .dwattr $C$DW$332, DW_AT_name("voutRef_pu")
    7276                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7277                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7278                      .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7279                      .dwattr $C$DW$332, DW_AT_decl_line(0x97)
    7280                      .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  154

    7281              
    7282              $C$DW$333       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$26)
    7284                      .dwattr $C$DW$333, DW_AT_name("voutSet_pu")
    7285                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7286                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7287                      .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7288                      .dwattr $C$DW$333, DW_AT_decl_line(0x98)
    7289                      .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
    7290              
    7291              $C$DW$334       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$26)
    7293                      .dwattr $C$DW$334, DW_AT_name("voutSense_pu")
    7294                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7295                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7296                      .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7297                      .dwattr $C$DW$334, DW_AT_decl_line(0x99)
    7298                      .dwattr $C$DW$334, DW_AT_decl_column(0x0f)
    7299              
    7300              $C$DW$335       .dwtag  DW_TAG_member
    7301                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$26)
    7302                      .dwattr $C$DW$335, DW_AT_name("uk_cc_pu")
    7303                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7304                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7305                      .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7306                      .dwattr $C$DW$335, DW_AT_decl_line(0x9b)
    7307                      .dwattr $C$DW$335, DW_AT_decl_column(0x0f)
    7308              
    7309              $C$DW$336       .dwtag  DW_TAG_member
    7310                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$26)
    7311                      .dwattr $C$DW$336, DW_AT_name("ek_cc_pu")
    7312                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7313                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7314                      .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7315                      .dwattr $C$DW$336, DW_AT_decl_line(0x9c)
    7316                      .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    7317              
    7318              $C$DW$337       .dwtag  DW_TAG_member
    7319                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$26)
    7320                      .dwattr $C$DW$337, DW_AT_name("uk_cv_pu")
    7321                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7322                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7323                      .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7324                      .dwattr $C$DW$337, DW_AT_decl_line(0x9d)
    7325                      .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    7326              
    7327              $C$DW$338       .dwtag  DW_TAG_member
    7328                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$26)
    7329                      .dwattr $C$DW$338, DW_AT_name("ek_cv_pu")
    7330                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7331                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7332                      .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7333                      .dwattr $C$DW$338, DW_AT_decl_line(0x9e)
    7334                      .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    7335              
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  155

    7336              $C$DW$339       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$26)
    7338                      .dwattr $C$DW$339, DW_AT_name("direction_coeff")
    7339                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7340                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7341                      .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7342                      .dwattr $C$DW$339, DW_AT_decl_line(0x9f)
    7343                      .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    7344              
    7345              $C$DW$340       .dwtag  DW_TAG_member
    7346                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$26)
    7347                      .dwattr $C$DW$340, DW_AT_name("dutyH_pu")
    7348                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7349                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7350                      .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7351                      .dwattr $C$DW$340, DW_AT_decl_line(0xa1)
    7352                      .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    7353              
    7354              $C$DW$341       .dwtag  DW_TAG_member
    7355                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$26)
    7356                      .dwattr $C$DW$341, DW_AT_name("dutyL_pu")
    7357                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7358                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7359                      .dwattr $C$DW$341, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7360                      .dwattr $C$DW$341, DW_AT_decl_line(0xa2)
    7361                      .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    7362              
    7363              $C$DW$342       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    7365                      .dwattr $C$DW$342, DW_AT_name("ctrlMode_logic")
    7366                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7367                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7368                      .dwattr $C$DW$342, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7369                      .dwattr $C$DW$342, DW_AT_decl_line(0xa4)
    7370                      .dwattr $C$DW$342, DW_AT_decl_column(0x0e)
    7371              
    7372              $C$DW$343       .dwtag  DW_TAG_member
    7373                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    7374                      .dwattr $C$DW$343, DW_AT_name("direction_logic")
    7375                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7376                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7377                      .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7378                      .dwattr $C$DW$343, DW_AT_decl_line(0xa5)
    7379                      .dwattr $C$DW$343, DW_AT_decl_column(0x0e)
    7380              
    7381              $C$DW$344       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$30)
    7383                      .dwattr $C$DW$344, DW_AT_name("ioutTrip_16b")
    7384                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7385                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7386                      .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7387                      .dwattr $C$DW$344, DW_AT_decl_line(0xa7)
    7388                      .dwattr $C$DW$344, DW_AT_decl_column(0x0d)
    7389              
    7390              $C$DW$345       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  156

    7391                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$30)
    7392                      .dwattr $C$DW$345, DW_AT_name("ioutTrip_n_16b")
    7393                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7394                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7395                      .dwattr $C$DW$345, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7396                      .dwattr $C$DW$345, DW_AT_decl_line(0xa8)
    7397                      .dwattr $C$DW$345, DW_AT_decl_column(0x0d)
    7398              
    7399              $C$DW$346       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    7401                      .dwattr $C$DW$346, DW_AT_name("tripFlag")
    7402                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7403                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7404                      .dwattr $C$DW$346, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7405                      .dwattr $C$DW$346, DW_AT_decl_line(0xa9)
    7406                      .dwattr $C$DW$346, DW_AT_decl_column(0x0e)
    7407              
    7408                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7409                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x8f)
    7410                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    7411                      .dwendtag $C$DW$T$31
    7412              
    7413                      .dwendtag $C$DW$TU$31
    7414              
    7415              
    7416              $C$DW$TU$68     .dwtag  DW_TAG_type_unit
    7417                      .dwmtype  $C$DW$T$68
    7418              $C$DW$T$68      .dwtag  DW_TAG_typedef
    7419                      .dwattr $C$DW$T$68, DW_AT_name("BTS_ctrlLoopVariable")
    7420                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$31)
    7421                      .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7422                      .dwattr $C$DW$T$68, DW_AT_decl_line(0xab)
    7423                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x02)
    7424              
    7425                      .dwendtag $C$DW$TU$68
    7426              
    7427              
    7428              $C$DW$TU$69     .dwtag  DW_TAG_type_unit
    7429                      .dwmtype  $C$DW$T$69
    7430              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    7431                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    7432                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    7433              
    7434                      .dwendtag $C$DW$TU$69
    7435              
    7436              
    7437              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    7438                      .dwmtype  $C$DW$T$33
    7439              
    7440              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7441                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x52)
    7442              $C$DW$347       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$26)
    7444                      .dwattr $C$DW$347, DW_AT_name("Isense_A")
    7445                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  157

    7446                      .dwattr $C$DW$347, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7447                      .dwattr $C$DW$347, DW_AT_decl_line(0x5f)
    7448                      .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    7449              
    7450              $C$DW$348       .dwtag  DW_TAG_member
    7451                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$26)
    7452                      .dwattr $C$DW$348, DW_AT_name("Vsense_V")
    7453                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7454                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7455                      .dwattr $C$DW$348, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7456                      .dwattr $C$DW$348, DW_AT_decl_line(0x60)
    7457                      .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    7458              
    7459              $C$DW$349       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$32)
    7461                      .dwattr $C$DW$349, DW_AT_name("Isense_16b")
    7462                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7463                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7464                      .dwattr $C$DW$349, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7465                      .dwattr $C$DW$349, DW_AT_decl_line(0x61)
    7466                      .dwattr $C$DW$349, DW_AT_decl_column(0x0d)
    7467              
    7468              $C$DW$350       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$32)
    7470                      .dwattr $C$DW$350, DW_AT_name("Vsense_16b")
    7471                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7472                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7473                      .dwattr $C$DW$350, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7474                      .dwattr $C$DW$350, DW_AT_decl_line(0x62)
    7475                      .dwattr $C$DW$350, DW_AT_decl_column(0x0d)
    7476              
    7477              $C$DW$351       .dwtag  DW_TAG_member
    7478                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    7479                      .dwattr $C$DW$351, DW_AT_name("Sum_I")
    7480                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7481                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7482                      .dwattr $C$DW$351, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7483                      .dwattr $C$DW$351, DW_AT_decl_line(0x63)
    7484                      .dwattr $C$DW$351, DW_AT_decl_column(0x0d)
    7485              
    7486              $C$DW$352       .dwtag  DW_TAG_member
    7487                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    7488                      .dwattr $C$DW$352, DW_AT_name("Sum_V")
    7489                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7490                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7491                      .dwattr $C$DW$352, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7492                      .dwattr $C$DW$352, DW_AT_decl_line(0x64)
    7493                      .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    7494              
    7495              $C$DW$353       .dwtag  DW_TAG_member
    7496                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    7497                      .dwattr $C$DW$353, DW_AT_name("Index")
    7498                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7499                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7500                      .dwattr $C$DW$353, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  158

    7501                      .dwattr $C$DW$353, DW_AT_decl_line(0x65)
    7502                      .dwattr $C$DW$353, DW_AT_decl_column(0x0e)
    7503              
    7504              $C$DW$354       .dwtag  DW_TAG_member
    7505                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$26)
    7506                      .dwattr $C$DW$354, DW_AT_name("IoutGain_A")
    7507                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7508                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7509                      .dwattr $C$DW$354, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7510                      .dwattr $C$DW$354, DW_AT_decl_line(0x66)
    7511                      .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    7512              
    7513              $C$DW$355       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$26)
    7515                      .dwattr $C$DW$355, DW_AT_name("IoutOffset_A")
    7516                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7517                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7518                      .dwattr $C$DW$355, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7519                      .dwattr $C$DW$355, DW_AT_decl_line(0x67)
    7520                      .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    7521              
    7522              $C$DW$356       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$26)
    7524                      .dwattr $C$DW$356, DW_AT_name("VoutGain_V")
    7525                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7526                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7527                      .dwattr $C$DW$356, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7528                      .dwattr $C$DW$356, DW_AT_decl_line(0x68)
    7529                      .dwattr $C$DW$356, DW_AT_decl_column(0x0f)
    7530              
    7531              $C$DW$357       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$26)
    7533                      .dwattr $C$DW$357, DW_AT_name("VoutOffset_V")
    7534                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7535                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7536                      .dwattr $C$DW$357, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7537                      .dwattr $C$DW$357, DW_AT_decl_line(0x69)
    7538                      .dwattr $C$DW$357, DW_AT_decl_column(0x0f)
    7539              
    7540                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7541                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x5e)
    7542                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7543                      .dwendtag $C$DW$T$33
    7544              
    7545                      .dwendtag $C$DW$TU$33
    7546              
    7547              
    7548              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    7549                      .dwmtype  $C$DW$T$71
    7550              $C$DW$T$71      .dwtag  DW_TAG_typedef
    7551                      .dwattr $C$DW$T$71, DW_AT_name("BTS_measValues")
    7552                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$33)
    7553                      .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/bts.h")
    7554                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x6b)
    7555                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x02)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  159

    7556              
    7557                      .dwendtag $C$DW$TU$71
    7558              
    7559              
    7560              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    7561                      .dwmtype  $C$DW$T$72
    7562              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    7563                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    7564                      .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    7565              
    7566                      .dwendtag $C$DW$TU$72
    7567              
    7568              
    7569              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    7570                      .dwmtype  $C$DW$T$35
    7571              
    7572              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7573                      .dwattr $C$DW$T$35, DW_AT_name("_Complex_double")
    7574                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    7575              $C$DW$358       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$34)
    7577                      .dwattr $C$DW$358, DW_AT_name("_Vals")
    7578                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7579                      .dwattr $C$DW$358, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7580                      .dwattr $C$DW$358, DW_AT_decl_line(0xbd)
    7581                      .dwattr $C$DW$358, DW_AT_decl_column(0x14)
    7582              
    7583                      .dwendtag $C$DW$T$35
    7584              
    7585                      .dwendtag $C$DW$TU$35
    7586              
    7587              
    7588              $C$DW$TU$74     .dwtag  DW_TAG_type_unit
    7589                      .dwmtype  $C$DW$T$74
    7590              $C$DW$T$74      .dwtag  DW_TAG_typedef
    7591                      .dwattr $C$DW$T$74, DW_AT_name("_Complex_double")
    7592                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    7593                      .dwattr $C$DW$T$74, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7594                      .dwattr $C$DW$T$74, DW_AT_decl_line(0xbd)
    7595                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x14)
    7596              
    7597                      .dwendtag $C$DW$TU$74
    7598              
    7599              
    7600              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    7601                      .dwmtype  $C$DW$T$37
    7602              
    7603              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7604                      .dwattr $C$DW$T$37, DW_AT_name("_Complex_float")
    7605                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    7606              $C$DW$359       .dwtag  DW_TAG_member
    7607                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$36)
    7608                      .dwattr $C$DW$359, DW_AT_name("_Vals")
    7609                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7610                      .dwattr $C$DW$359, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  160

    7611                      .dwattr $C$DW$359, DW_AT_decl_line(0xbd)
    7612                      .dwattr $C$DW$359, DW_AT_decl_column(0x14)
    7613              
    7614                      .dwendtag $C$DW$T$37
    7615              
    7616                      .dwendtag $C$DW$TU$37
    7617              
    7618              
    7619              $C$DW$TU$75     .dwtag  DW_TAG_type_unit
    7620                      .dwmtype  $C$DW$T$75
    7621              $C$DW$T$75      .dwtag  DW_TAG_typedef
    7622                      .dwattr $C$DW$T$75, DW_AT_name("_Complex_float")
    7623                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$37)
    7624                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7625                      .dwattr $C$DW$T$75, DW_AT_decl_line(0xbd)
    7626                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x14)
    7627              
    7628                      .dwendtag $C$DW$TU$75
    7629              
    7630              
    7631              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    7632                      .dwmtype  $C$DW$T$39
    7633              
    7634              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7635                      .dwattr $C$DW$T$39, DW_AT_name("_Complex_long_double")
    7636                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    7637              $C$DW$360       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$38)
    7639                      .dwattr $C$DW$360, DW_AT_name("_Vals")
    7640                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7641                      .dwattr $C$DW$360, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7642                      .dwattr $C$DW$360, DW_AT_decl_line(0xbd)
    7643                      .dwattr $C$DW$360, DW_AT_decl_column(0x14)
    7644              
    7645                      .dwendtag $C$DW$T$39
    7646              
    7647                      .dwendtag $C$DW$TU$39
    7648              
    7649              
    7650              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    7651                      .dwmtype  $C$DW$T$77
    7652              $C$DW$T$77      .dwtag  DW_TAG_typedef
    7653                      .dwattr $C$DW$T$77, DW_AT_name("_Complex_long_double")
    7654                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$39)
    7655                      .dwattr $C$DW$T$77, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\bts_hal.h")
    7656                      .dwattr $C$DW$T$77, DW_AT_decl_line(0xbd)
    7657                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x14)
    7658              
    7659                      .dwendtag $C$DW$TU$77
    7660              
    7661              
    7662              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    7663                      .dwmtype  $C$DW$T$2
    7664              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7665                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  161

    7666              
    7667                      .dwendtag $C$DW$TU$2
    7668              
    7669              
    7670              $C$DW$TU$78     .dwtag  DW_TAG_type_unit
    7671                      .dwmtype  $C$DW$T$78
    7672              
    7673              $C$DW$T$78      .dwtag  DW_TAG_subroutine_type
    7674                      .dwendtag $C$DW$T$78
    7675              
    7676                      .dwendtag $C$DW$TU$78
    7677              
    7678              
    7679              $C$DW$TU$79     .dwtag  DW_TAG_type_unit
    7680                      .dwmtype  $C$DW$T$79
    7681              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    7682                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    7683                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    7684              
    7685                      .dwendtag $C$DW$TU$79
    7686              
    7687              
    7688              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    7689                      .dwmtype  $C$DW$T$4
    7690              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7691                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7692                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7693                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7694              
    7695                      .dwendtag $C$DW$TU$4
    7696              
    7697              
    7698              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    7699                      .dwmtype  $C$DW$T$5
    7700              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7701                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7702                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7703                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7704              
    7705                      .dwendtag $C$DW$TU$5
    7706              
    7707              
    7708              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    7709                      .dwmtype  $C$DW$T$6
    7710              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7711                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7712                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7713                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7714              
    7715                      .dwendtag $C$DW$TU$6
    7716              
    7717              
    7718              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    7719                      .dwmtype  $C$DW$T$7
    7720              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  162

    7721                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7722                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7723                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    7724              
    7725                      .dwendtag $C$DW$TU$7
    7726              
    7727              
    7728              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    7729                      .dwmtype  $C$DW$T$8
    7730              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7731                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7732                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7733                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7734              
    7735                      .dwendtag $C$DW$TU$8
    7736              
    7737              
    7738              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    7739                      .dwmtype  $C$DW$T$9
    7740              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7741                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7742                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7743                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7744              
    7745                      .dwendtag $C$DW$TU$9
    7746              
    7747              
    7748              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    7749                      .dwmtype  $C$DW$T$10
    7750              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7751                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7752                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7753                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7754              
    7755                      .dwendtag $C$DW$TU$10
    7756              
    7757              
    7758              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    7759                      .dwmtype  $C$DW$T$29
    7760              $C$DW$T$29      .dwtag  DW_TAG_typedef
    7761                      .dwattr $C$DW$T$29, DW_AT_name("__int16_t")
    7762                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$10)
    7763                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7764                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x40)
    7765                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1d)
    7766              
    7767                      .dwendtag $C$DW$TU$29
    7768              
    7769              
    7770              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    7771                      .dwmtype  $C$DW$T$30
    7772              $C$DW$T$30      .dwtag  DW_TAG_typedef
    7773                      .dwattr $C$DW$T$30, DW_AT_name("int16_t")
    7774                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    7775                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  163

    7776                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2b)
    7777                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x14)
    7778              
    7779                      .dwendtag $C$DW$TU$30
    7780              
    7781              
    7782              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    7783                      .dwmtype  $C$DW$T$32
    7784              
    7785              $C$DW$T$32      .dwtag  DW_TAG_array_type
    7786                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$30)
    7787                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
    7788              $C$DW$361       .dwtag  DW_TAG_subrange_type
    7789                      .dwattr $C$DW$361, DW_AT_upper_bound(0x1f)
    7790              
    7791                      .dwendtag $C$DW$T$32
    7792              
    7793                      .dwendtag $C$DW$TU$32
    7794              
    7795              
    7796              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
    7797                      .dwmtype  $C$DW$T$11
    7798              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7799                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7800                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7801                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7802              
    7803                      .dwendtag $C$DW$TU$11
    7804              
    7805              
    7806              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    7807                      .dwmtype  $C$DW$T$19
    7808              $C$DW$T$19      .dwtag  DW_TAG_typedef
    7809                      .dwattr $C$DW$T$19, DW_AT_name("__uint16_t")
    7810                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    7811                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7812                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x41)
    7813                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    7814              
    7815                      .dwendtag $C$DW$TU$19
    7816              
    7817              
    7818              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    7819                      .dwmtype  $C$DW$T$20
    7820              $C$DW$T$20      .dwtag  DW_TAG_typedef
    7821                      .dwattr $C$DW$T$20, DW_AT_name("uint16_t")
    7822                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    7823                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7824                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
    7825                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x15)
    7826              
    7827                      .dwendtag $C$DW$TU$20
    7828              
    7829              
    7830              $C$DW$TU$117    .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  164

    7831                      .dwmtype  $C$DW$T$117
    7832              
    7833              $C$DW$T$117     .dwtag  DW_TAG_array_type
    7834                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$20)
    7835                      .dwattr $C$DW$T$117, DW_AT_byte_size(0x04)
    7836              $C$DW$362       .dwtag  DW_TAG_subrange_type
    7837                      .dwattr $C$DW$362, DW_AT_upper_bound(0x03)
    7838              
    7839                      .dwendtag $C$DW$T$117
    7840              
    7841                      .dwendtag $C$DW$TU$117
    7842              
    7843              
    7844              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    7845                      .dwmtype  $C$DW$T$21
    7846              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    7847                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    7848              
    7849              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    7850                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$363)
    7851              
    7852                      .dwendtag $C$DW$TU$21
    7853              
    7854              
    7855              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    7856                      .dwmtype  $C$DW$T$12
    7857              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7858                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7859                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7860                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7861              
    7862                      .dwendtag $C$DW$TU$12
    7863              
    7864              
    7865              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    7866                      .dwmtype  $C$DW$T$22
    7867              $C$DW$T$22      .dwtag  DW_TAG_typedef
    7868                      .dwattr $C$DW$T$22, DW_AT_name("__int32_t")
    7869                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$12)
    7870                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7871                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x42)
    7872                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x1d)
    7873              
    7874                      .dwendtag $C$DW$TU$22
    7875              
    7876              
    7877              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    7878                      .dwmtype  $C$DW$T$23
    7879              $C$DW$T$23      .dwtag  DW_TAG_typedef
    7880                      .dwattr $C$DW$T$23, DW_AT_name("int32_t")
    7881                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    7882                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7883                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x30)
    7884                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x14)
    7885              
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  165

    7886                      .dwendtag $C$DW$TU$23
    7887              
    7888              
    7889              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    7890                      .dwmtype  $C$DW$T$24
    7891              $C$DW$364       .dwtag  DW_TAG_TI_far_type
    7892                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    7893              
    7894              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    7895                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$364)
    7896              
    7897                      .dwendtag $C$DW$TU$24
    7898              
    7899              
    7900              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    7901                      .dwmtype  $C$DW$T$13
    7902              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7903                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7904                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7905                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7906              
    7907                      .dwendtag $C$DW$TU$13
    7908              
    7909              
    7910              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    7911                      .dwmtype  $C$DW$T$40
    7912              $C$DW$T$40      .dwtag  DW_TAG_typedef
    7913                      .dwattr $C$DW$T$40, DW_AT_name("__uint32_t")
    7914                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$13)
    7915                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7916                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x43)
    7917                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x1c)
    7918              
    7919                      .dwendtag $C$DW$TU$40
    7920              
    7921              
    7922              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    7923                      .dwmtype  $C$DW$T$41
    7924              $C$DW$T$41      .dwtag  DW_TAG_typedef
    7925                      .dwattr $C$DW$T$41, DW_AT_name("uint32_t")
    7926                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7927                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1010/ccs/tools/compiler/ti-cgt-c2000_20.2.1.LTS/include
    7928                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    7929                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x15)
    7930              
    7931                      .dwendtag $C$DW$TU$41
    7932              
    7933              
    7934              $C$DW$TU$14     .dwtag  DW_TAG_type_unit
    7935                      .dwmtype  $C$DW$T$14
    7936              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7937                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7938                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7939                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7940              
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  166

    7941                      .dwendtag $C$DW$TU$14
    7942              
    7943              
    7944              $C$DW$TU$15     .dwtag  DW_TAG_type_unit
    7945                      .dwmtype  $C$DW$T$15
    7946              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7947                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7948                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7949                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7950              
    7951                      .dwendtag $C$DW$TU$15
    7952              
    7953              
    7954              $C$DW$TU$16     .dwtag  DW_TAG_type_unit
    7955                      .dwmtype  $C$DW$T$16
    7956              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7957                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7958                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7959                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7960              
    7961                      .dwendtag $C$DW$TU$16
    7962              
    7963              
    7964              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    7965                      .dwmtype  $C$DW$T$36
    7966              
    7967              $C$DW$T$36      .dwtag  DW_TAG_array_type
    7968                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$16)
    7969                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    7970              $C$DW$365       .dwtag  DW_TAG_subrange_type
    7971                      .dwattr $C$DW$365, DW_AT_upper_bound(0x01)
    7972              
    7973                      .dwendtag $C$DW$T$36
    7974              
    7975                      .dwendtag $C$DW$TU$36
    7976              
    7977              
    7978              $C$DW$TU$125    .dwtag  DW_TAG_type_unit
    7979                      .dwmtype  $C$DW$T$125
    7980              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    7981                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$16)
    7982              
    7983              $C$DW$T$125     .dwtag  DW_TAG_const_type
    7984                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$366)
    7985              
    7986                      .dwendtag $C$DW$TU$125
    7987              
    7988              
    7989              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    7990                      .dwmtype  $C$DW$T$26
    7991              $C$DW$T$26      .dwtag  DW_TAG_typedef
    7992                      .dwattr $C$DW$T$26, DW_AT_name("float32_t")
    7993                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$16)
    7994                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\C2000Ware_DigitalPower_SDK_3_00_01_00\c2000ware\driverlib\
    7995                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x4c)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  167

    7996                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x17)
    7997              
    7998                      .dwendtag $C$DW$TU$26
    7999              
    8000              
    8001              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    8002                      .dwmtype  $C$DW$T$27
    8003              $C$DW$367       .dwtag  DW_TAG_TI_far_type
    8004                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$26)
    8005              
    8006              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    8007                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$367)
    8008              
    8009                      .dwendtag $C$DW$TU$27
    8010              
    8011              
    8012              $C$DW$TU$17     .dwtag  DW_TAG_type_unit
    8013                      .dwmtype  $C$DW$T$17
    8014              $C$DW$T$17      .dwtag  DW_TAG_base_type
    8015                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    8016                      .dwattr $C$DW$T$17, DW_AT_name("double")
    8017                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    8018              
    8019                      .dwendtag $C$DW$TU$17
    8020              
    8021              
    8022              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    8023                      .dwmtype  $C$DW$T$34
    8024              
    8025              $C$DW$T$34      .dwtag  DW_TAG_array_type
    8026                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$17)
    8027                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
    8028              $C$DW$368       .dwtag  DW_TAG_subrange_type
    8029                      .dwattr $C$DW$368, DW_AT_upper_bound(0x01)
    8030              
    8031                      .dwendtag $C$DW$T$34
    8032              
    8033                      .dwendtag $C$DW$TU$34
    8034              
    8035              
    8036              $C$DW$TU$128    .dwtag  DW_TAG_type_unit
    8037                      .dwmtype  $C$DW$T$128
    8038              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8039                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$17)
    8040                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8041              
    8042                      .dwendtag $C$DW$TU$128
    8043              
    8044              
    8045              $C$DW$TU$129    .dwtag  DW_TAG_type_unit
    8046                      .dwmtype  $C$DW$T$129
    8047              $C$DW$369       .dwtag  DW_TAG_TI_far_type
    8048                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$128)
    8049              
    8050              $C$DW$T$129     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  168

    8051                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$369)
    8052              
    8053                      .dwendtag $C$DW$TU$129
    8054              
    8055              
    8056              $C$DW$TU$18     .dwtag  DW_TAG_type_unit
    8057                      .dwmtype  $C$DW$T$18
    8058              $C$DW$T$18      .dwtag  DW_TAG_base_type
    8059                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    8060                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    8061                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    8062              
    8063                      .dwendtag $C$DW$TU$18
    8064              
    8065              
    8066              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    8067                      .dwmtype  $C$DW$T$38
    8068              
    8069              $C$DW$T$38      .dwtag  DW_TAG_array_type
    8070                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$18)
    8071                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    8072              $C$DW$370       .dwtag  DW_TAG_subrange_type
    8073                      .dwattr $C$DW$370, DW_AT_upper_bound(0x01)
    8074              
    8075                      .dwendtag $C$DW$T$38
    8076              
    8077                      .dwendtag $C$DW$TU$38
    8078              
    8079              
    8080              $C$DW$TU$131    .dwtag  DW_TAG_type_unit
    8081                      .dwmtype  $C$DW$T$131
    8082              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    8083                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$18)
    8084                      .dwattr $C$DW$T$131, DW_AT_address_class(0x20)
    8085              
    8086                      .dwendtag $C$DW$TU$131
    8087              
    8088              
    8089              $C$DW$TU$132    .dwtag  DW_TAG_type_unit
    8090                      .dwmtype  $C$DW$T$132
    8091              $C$DW$371       .dwtag  DW_TAG_TI_far_type
    8092                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$131)
    8093              
    8094              $C$DW$T$132     .dwtag  DW_TAG_const_type
    8095                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$371)
    8096              
    8097                      .dwendtag $C$DW$TU$132
    8098              
    8099              
    8100              $C$DW$TU$134    .dwtag  DW_TAG_type_unit
    8101                      .dwmtype  $C$DW$T$134
    8102              $C$DW$T$134     .dwtag  DW_TAG_base_type
    8103                      .dwattr $C$DW$T$134, DW_AT_encoding(DW_ATE_unsigned_char)
    8104                      .dwattr $C$DW$T$134, DW_AT_name("unsigned char")
    8105                      .dwattr $C$DW$T$134, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  169

    8106              
    8107                      .dwendtag $C$DW$TU$134
    8108              
    8109              
    8110              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    8111                      .dwmtype  $C$DW$T$42
    8112              
    8113              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8114                      .dwattr $C$DW$T$42, DW_AT_name("dcl_css")
    8115                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x0a)
    8116              $C$DW$372       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    8118                      .dwattr $C$DW$372, DW_AT_name("tpt")
    8119                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    8120                      .dwattr $C$DW$372, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\D
    8121                      .dwattr $C$DW$372, DW_AT_decl_line(0x91)
    8122                      .dwattr $C$DW$372, DW_AT_decl_column(0x0f)
    8123              
    8124              $C$DW$373       .dwtag  DW_TAG_member
    8125                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$26)
    8126                      .dwattr $C$DW$373, DW_AT_name("T")
    8127                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8128                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    8129                      .dwattr $C$DW$373, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\D
    8130                      .dwattr $C$DW$373, DW_AT_decl_line(0x92)
    8131                      .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    8132              
    8133              $C$DW$374       .dwtag  DW_TAG_member
    8134                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$41)
    8135                      .dwattr $C$DW$374, DW_AT_name("sts")
    8136                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8137                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    8138                      .dwattr $C$DW$374, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\D
    8139                      .dwattr $C$DW$374, DW_AT_decl_line(0x93)
    8140                      .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    8141              
    8142              $C$DW$375       .dwtag  DW_TAG_member
    8143                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$41)
    8144                      .dwattr $C$DW$375, DW_AT_name("err")
    8145                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8146                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    8147                      .dwattr $C$DW$375, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\D
    8148                      .dwattr $C$DW$375, DW_AT_decl_line(0x94)
    8149                      .dwattr $C$DW$375, DW_AT_decl_column(0x0e)
    8150              
    8151              $C$DW$376       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$41)
    8153                      .dwattr $C$DW$376, DW_AT_name("loc")
    8154                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8155                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    8156                      .dwattr $C$DW$376, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\D
    8157                      .dwattr $C$DW$376, DW_AT_decl_line(0x95)
    8158                      .dwattr $C$DW$376, DW_AT_decl_column(0x0e)
    8159              
    8160                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  170

    8161                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x90)
    8162                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x19)
    8163                      .dwendtag $C$DW$T$42
    8164              
    8165                      .dwendtag $C$DW$TU$42
    8166              
    8167              
    8168              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    8169                      .dwmtype  $C$DW$T$46
    8170              $C$DW$377       .dwtag  DW_TAG_TI_far_type
    8171                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$42)
    8172              
    8173              $C$DW$T$46      .dwtag  DW_TAG_volatile_type
    8174                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$377)
    8175              
    8176                      .dwendtag $C$DW$TU$46
    8177              
    8178              
    8179              $C$DW$TU$47     .dwtag  DW_TAG_type_unit
    8180                      .dwmtype  $C$DW$T$47
    8181              $C$DW$T$47      .dwtag  DW_TAG_typedef
    8182                      .dwattr $C$DW$T$47, DW_AT_name("DCL_CSS")
    8183                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8184                      .dwattr $C$DW$T$47, DW_AT_decl_file("C:\Users\a0230328\workspace_v10\bts_F2800x_4ch_v2\libraries\DCL\
    8185                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x96)
    8186                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    8187              
    8188                      .dwendtag $C$DW$TU$47
    8189              
    8190              
    8191              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    8192                      .dwmtype  $C$DW$T$48
    8193              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    8194                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8195                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    8196              
    8197                      .dwendtag $C$DW$TU$48
    8198              
    8199              
    8200              $C$DW$TU$49     .dwtag  DW_TAG_type_unit
    8201                      .dwmtype  $C$DW$T$49
    8202              
    8203              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    8204                      .dwattr $C$DW$T$49, DW_AT_name("dcl_df22")
    8205                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x12)
    8206              $C$DW$378       .dwtag  DW_TAG_member
    8207                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$26)
    8208                      .dwattr $C$DW$378, DW_AT_name("b0")
    8209                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    8210                      .dwattr $C$DW$378, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8211                      .dwattr $C$DW$378, DW_AT_decl_line(0x4ab)
    8212                      .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
    8213              
    8214              $C$DW$379       .dwtag  DW_TAG_member
    8215                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  171

    8216                      .dwattr $C$DW$379, DW_AT_name("b1")
    8217                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8218                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    8219                      .dwattr $C$DW$379, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8220                      .dwattr $C$DW$379, DW_AT_decl_line(0x4ac)
    8221                      .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    8222              
    8223              $C$DW$380       .dwtag  DW_TAG_member
    8224                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$26)
    8225                      .dwattr $C$DW$380, DW_AT_name("b2")
    8226                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8227                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    8228                      .dwattr $C$DW$380, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8229                      .dwattr $C$DW$380, DW_AT_decl_line(0x4ad)
    8230                      .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    8231              
    8232              $C$DW$381       .dwtag  DW_TAG_member
    8233                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$26)
    8234                      .dwattr $C$DW$381, DW_AT_name("a1")
    8235                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8236                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    8237                      .dwattr $C$DW$381, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8238                      .dwattr $C$DW$381, DW_AT_decl_line(0x4ae)
    8239                      .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    8240              
    8241              $C$DW$382       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$26)
    8243                      .dwattr $C$DW$382, DW_AT_name("a2")
    8244                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8245                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    8246                      .dwattr $C$DW$382, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8247                      .dwattr $C$DW$382, DW_AT_decl_line(0x4af)
    8248                      .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    8249              
    8250              $C$DW$383       .dwtag  DW_TAG_member
    8251                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$26)
    8252                      .dwattr $C$DW$383, DW_AT_name("x1")
    8253                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8254                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    8255                      .dwattr $C$DW$383, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8256                      .dwattr $C$DW$383, DW_AT_decl_line(0x4b0)
    8257                      .dwattr $C$DW$383, DW_AT_decl_column(0x0f)
    8258              
    8259              $C$DW$384       .dwtag  DW_TAG_member
    8260                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
    8261                      .dwattr $C$DW$384, DW_AT_name("x2")
    8262                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8263                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    8264                      .dwattr $C$DW$384, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8265                      .dwattr $C$DW$384, DW_AT_decl_line(0x4b1)
    8266                      .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    8267              
    8268              $C$DW$385       .dwtag  DW_TAG_member
    8269                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$45)
    8270                      .dwattr $C$DW$385, DW_AT_name("sps")
TMS320C2000 Assembler PC v20.2.1 Mon Nov  2 17:14:28 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  172

    8271                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8272                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    8273                      .dwattr $C$DW$385, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8274                      .dwattr $C$DW$385, DW_AT_decl_line(0x4b2)
    8275                      .dwattr $C$DW$385, DW_AT_decl_column(0x13)
    8276              
    8277              $C$DW$386       .dwtag  DW_TAG_member
    8278                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$48)
    8279                      .dwattr $C$DW$386, DW_AT_name("css")
    8280                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8281                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    8282                      .dwattr $C$DW$386, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/D
    8283                      .dwattr $C$DW$386, DW_AT_decl_line(0x4b3)
    8284                      .dwattr $C$DW$386, DW_AT_decl_column(0x0e)
    8285              
    8286                      .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/
    8287                      .dwattr $C$DW$T$49, DW_AT_decl_line(0x4aa)
    8288                      .dwattr $C$DW$T$49, DW_AT_decl_column(0x19)
    8289                      .dwendtag $C$DW$T$49
    8290              
    8291                      .dwendtag $C$DW$TU$49
    8292              
    8293              
    8294              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    8295                      .dwmtype  $C$DW$T$93
    8296              $C$DW$387       .dwtag  DW_TAG_TI_far_type
    8297                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$49)
    8298              
    8299              $C$DW$T$93      .dwtag  DW_TAG_volatile_type
    8300                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$387)
    8301              
    8302                      .dwendtag $C$DW$TU$93
    8303              
    8304              
    8305              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    8306                      .dwmtype  $C$DW$T$94
    8307              $C$DW$T$94      .dwtag  DW_TAG_typedef
    8308                      .dwattr $C$DW$T$94, DW_AT_name("DCL_DF22")
    8309                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8310                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/Users/a0230328/workspace_v10/bts_F2800x_4ch_v2/libraries/DCL/
    8311                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x4b4)
