TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Tue Aug 13 19:46:07 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")

    6484                      .gmember  ".text:__isnanf"
    6485                      .endgroup
    6486                      .group    "__isnanl", 1
    6487                      .gmember  ".text:__isnanl"
    6488                      .endgroup
    6489                      .group    "__isnormal", 1
    6490                      .gmember  ".text:__isnormal"
    6491                      .endgroup
    6492                      .group    "__isnormalf", 1
    6493                      .gmember  ".text:__isnormalf"
    6494                      .endgroup
    6495                      .group    "__isnormall", 1
    6496                      .gmember  ".text:__isnormall"
    6497                      .endgroup
    6498                      .group    "__relaxed_atan2f", 1
    6499                      .gmember  ".text:__relaxed_atan2f"
    6500                      .endgroup
    6501                      .group    "__relaxed_atanf", 1
    6502                      .gmember  ".text:__relaxed_atanf"
    6503                      .endgroup
    6504                      .group    "__relaxed_cosf", 1
    6505                      .gmember  ".text:__relaxed_cosf"
    6506                      .endgroup
    6507                      .group    "__relaxed_fmaxf", 1
    6508                      .gmember  ".text:__relaxed_fmaxf"
    6509                      .endgroup
    6510                      .group    "__relaxed_fminf", 1
    6511                      .gmember  ".text:__relaxed_fminf"
    6512                      .endgroup
    6513                      .group    "__relaxed_fmodf", 1
    6514                      .gmember  ".text:__relaxed_fmodf"
    6515                      .endgroup
    6516                      .group    "__relaxed_sinf", 1
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  138

    6517                      .gmember  ".text:__relaxed_sinf"
    6518                      .endgroup
    6519                      .group    "__relaxed_sqrtf", 1
    6520                      .gmember  ".text:__relaxed_sqrtf"
    6521                      .endgroup
    6522                      .group    "__signbit", 1
    6523                      .gmember  ".text:__signbit"
    6524                      .endgroup
    6525                      .group    "__signbitf", 1
    6526                      .gmember  ".text:__signbitf"
    6527                      .endgroup
    6528                      .group    "__signbitl", 1
    6529                      .gmember  ".text:__signbitl"
    6530                      .endgroup
    6531              
    6532              
    6533              ;***************************************************************
    6534              ;* BUILD ATTRIBUTES                                            *
    6535              ;***************************************************************
    6536                      .battr "c28xabi", Tag_File, 1, Tag_float_args(1)
    6537                      .battr "c28xabi", Tag_File, 1, Tag_double_args(1)
    6538                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6539              
    6540              ;***************************************************************
    6541              ;* DWARF CIE ENTRIES                                           *
    6542              ;***************************************************************
    6543              
    6544              $C$DW$CIE       .dwcie 26
    6545                      .dwcfi  cfa_register, 20
    6546                      .dwcfi  cfa_offset, 0
    6547                      .dwcfi  same_value, 28
    6548                      .dwcfi  same_value, 6
    6549                      .dwcfi  same_value, 7
    6550                      .dwcfi  same_value, 8
    6551                      .dwcfi  same_value, 9
    6552                      .dwcfi  same_value, 10
    6553                      .dwcfi  same_value, 11
    6554                      .dwcfi  same_value, 59
    6555                      .dwcfi  same_value, 63
    6556                      .dwcfi  same_value, 67
    6557                      .dwcfi  same_value, 71
    6558                      .dwendentry
    6559                      .dwendtag $C$DW$CU
    6560              
    6561              
    6562              ;***************************************************************
    6563              ;* TYPE INFORMATION                                            *
    6564              ;***************************************************************
    6565              
    6566              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    6567                      .dwmtype  $C$DW$T$23
    6568              
    6569              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6570                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    6571              $C$DW$289       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  139

    6572                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    6573                      .dwattr $C$DW$289, DW_AT_name("h_magVect")
    6574                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    6575                      .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6576                      .dwattr $C$DW$289, DW_AT_decl_line(0x40)
    6577                      .dwattr $C$DW$289, DW_AT_decl_column(0x10)
    6578              
    6579              $C$DW$290       .dwtag  DW_TAG_member
    6580                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    6581                      .dwattr $C$DW$290, DW_AT_name("h_phaseVect")
    6582                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6583                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    6584                      .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6585                      .dwattr $C$DW$290, DW_AT_decl_line(0x41)
    6586                      .dwattr $C$DW$290, DW_AT_decl_column(0x10)
    6587              
    6588              $C$DW$291       .dwtag  DW_TAG_member
    6589                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    6590                      .dwattr $C$DW$291, DW_AT_name("gh_magVect")
    6591                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6592                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    6593                      .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6594                      .dwattr $C$DW$291, DW_AT_decl_line(0x42)
    6595                      .dwattr $C$DW$291, DW_AT_decl_column(0x10)
    6596              
    6597              $C$DW$292       .dwtag  DW_TAG_member
    6598                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    6599                      .dwattr $C$DW$292, DW_AT_name("gh_phaseVect")
    6600                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6601                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    6602                      .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6603                      .dwattr $C$DW$292, DW_AT_decl_line(0x43)
    6604                      .dwattr $C$DW$292, DW_AT_decl_column(0x10)
    6605              
    6606              $C$DW$293       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    6608                      .dwattr $C$DW$293, DW_AT_name("cl_magVect")
    6609                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6610                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    6611                      .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6612                      .dwattr $C$DW$293, DW_AT_decl_line(0x44)
    6613                      .dwattr $C$DW$293, DW_AT_decl_column(0x10)
    6614              
    6615              $C$DW$294       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    6617                      .dwattr $C$DW$294, DW_AT_name("cl_phaseVect")
    6618                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6619                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    6620                      .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6621                      .dwattr $C$DW$294, DW_AT_decl_line(0x45)
    6622                      .dwattr $C$DW$294, DW_AT_decl_column(0x10)
    6623              
    6624              $C$DW$295       .dwtag  DW_TAG_member
    6625                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    6626                      .dwattr $C$DW$295, DW_AT_name("freqVect")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  140

    6627                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6628                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    6629                      .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6630                      .dwattr $C$DW$295, DW_AT_decl_line(0x46)
    6631                      .dwattr $C$DW$295, DW_AT_decl_column(0x10)
    6632              
    6633              $C$DW$296       .dwtag  DW_TAG_member
    6634                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    6635                      .dwattr $C$DW$296, DW_AT_name("amplitude")
    6636                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6637                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6638                      .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6639                      .dwattr $C$DW$296, DW_AT_decl_line(0x47)
    6640                      .dwattr $C$DW$296, DW_AT_decl_column(0x0f)
    6641              
    6642              $C$DW$297       .dwtag  DW_TAG_member
    6643                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    6644                      .dwattr $C$DW$297, DW_AT_name("isrFreq")
    6645                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6646                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6647                      .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6648                      .dwattr $C$DW$297, DW_AT_decl_line(0x48)
    6649                      .dwattr $C$DW$297, DW_AT_decl_column(0x0f)
    6650              
    6651              $C$DW$298       .dwtag  DW_TAG_member
    6652                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    6653                      .dwattr $C$DW$298, DW_AT_name("freqStart")
    6654                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6655                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6656                      .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6657                      .dwattr $C$DW$298, DW_AT_decl_line(0x49)
    6658                      .dwattr $C$DW$298, DW_AT_decl_column(0x0f)
    6659              
    6660              $C$DW$299       .dwtag  DW_TAG_member
    6661                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    6662                      .dwattr $C$DW$299, DW_AT_name("freqStep")
    6663                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6664                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6665                      .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6666                      .dwattr $C$DW$299, DW_AT_decl_line(0x4a)
    6667                      .dwattr $C$DW$299, DW_AT_decl_column(0x0f)
    6668              
    6669              $C$DW$300       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    6671                      .dwattr $C$DW$300, DW_AT_name("start")
    6672                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6673                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6674                      .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6675                      .dwattr $C$DW$300, DW_AT_decl_line(0x4b)
    6676                      .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    6677              
    6678              $C$DW$301       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$22)
    6680                      .dwattr $C$DW$301, DW_AT_name("state")
    6681                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  141

    6682                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6683                      .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6684                      .dwattr $C$DW$301, DW_AT_decl_line(0x4c)
    6685                      .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    6686              
    6687              $C$DW$302       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$22)
    6689                      .dwattr $C$DW$302, DW_AT_name("status")
    6690                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6691                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6692                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6693                      .dwattr $C$DW$302, DW_AT_decl_line(0x4d)
    6694                      .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    6695              
    6696              $C$DW$303       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$22)
    6698                      .dwattr $C$DW$303, DW_AT_name("vecLength")
    6699                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6700                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6701                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6702                      .dwattr $C$DW$303, DW_AT_decl_line(0x4e)
    6703                      .dwattr $C$DW$303, DW_AT_decl_column(0x0d)
    6704              
    6705              $C$DW$304       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$22)
    6707                      .dwattr $C$DW$304, DW_AT_name("freqIndex")
    6708                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6709                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6710                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6711                      .dwattr $C$DW$304, DW_AT_decl_line(0x4f)
    6712                      .dwattr $C$DW$304, DW_AT_decl_column(0x0d)
    6713              
    6714              $C$DW$305       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    6716                      .dwattr $C$DW$305, DW_AT_name("storeH")
    6717                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6718                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6719                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6720                      .dwattr $C$DW$305, DW_AT_decl_line(0x50)
    6721                      .dwattr $C$DW$305, DW_AT_decl_column(0x0d)
    6722              
    6723              $C$DW$306       .dwtag  DW_TAG_member
    6724                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$22)
    6725                      .dwattr $C$DW$306, DW_AT_name("storeGH")
    6726                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6727                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6728                      .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6729                      .dwattr $C$DW$306, DW_AT_decl_line(0x51)
    6730                      .dwattr $C$DW$306, DW_AT_decl_column(0x0d)
    6731              
    6732              $C$DW$307       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    6734                      .dwattr $C$DW$307, DW_AT_name("storeCL")
    6735                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6736                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  142

    6737                      .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6738                      .dwattr $C$DW$307, DW_AT_decl_line(0x52)
    6739                      .dwattr $C$DW$307, DW_AT_decl_column(0x0d)
    6740              
    6741              $C$DW$308       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    6743                      .dwattr $C$DW$308, DW_AT_name("speed")
    6744                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6745                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6746                      .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6747                      .dwattr $C$DW$308, DW_AT_decl_line(0x53)
    6748                      .dwattr $C$DW$308, DW_AT_decl_column(0x0d)
    6749              
    6750                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra
    6751                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    6752                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    6753                      .dwendtag $C$DW$T$23
    6754              
    6755                      .dwendtag $C$DW$TU$23
    6756              
    6757              
    6758              $C$DW$TU$58     .dwtag  DW_TAG_type_unit
    6759                      .dwmtype  $C$DW$T$58
    6760              $C$DW$T$58      .dwtag  DW_TAG_typedef
    6761                      .dwattr $C$DW$T$58, DW_AT_name("SFRA_F32")
    6762                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    6763                      .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra
    6764                      .dwattr $C$DW$T$58, DW_AT_decl_line(0x54)
    6765                      .dwattr $C$DW$T$58, DW_AT_decl_column(0x02)
    6766              
    6767                      .dwendtag $C$DW$TU$58
    6768              
    6769              
    6770              $C$DW$TU$59     .dwtag  DW_TAG_type_unit
    6771                      .dwmtype  $C$DW$T$59
    6772              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    6773                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6774                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    6775              
    6776                      .dwendtag $C$DW$TU$59
    6777              
    6778              
    6779              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    6780                      .dwmtype  $C$DW$T$28
    6781              
    6782              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6783                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    6784              $C$DW$309       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    6786                      .dwattr $C$DW$309, DW_AT_name("iref_A")
    6787                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6788                      .dwattr $C$DW$309, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6789                      .dwattr $C$DW$309, DW_AT_decl_line(0x8e)
    6790                      .dwattr $C$DW$309, DW_AT_decl_column(0x18)
    6791              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  143

    6792              $C$DW$310       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$24)
    6794                      .dwattr $C$DW$310, DW_AT_name("vref_charge_V")
    6795                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6796                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6797                      .dwattr $C$DW$310, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6798                      .dwattr $C$DW$310, DW_AT_decl_line(0x8f)
    6799                      .dwattr $C$DW$310, DW_AT_decl_column(0x18)
    6800              
    6801              $C$DW$311       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$24)
    6803                      .dwattr $C$DW$311, DW_AT_name("vref_discharge_V")
    6804                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6805                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6806                      .dwattr $C$DW$311, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6807                      .dwattr $C$DW$311, DW_AT_decl_line(0x90)
    6808                      .dwattr $C$DW$311, DW_AT_decl_column(0x18)
    6809              
    6810              $C$DW$312       .dwtag  DW_TAG_member
    6811                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$27)
    6812                      .dwattr $C$DW$312, DW_AT_name("direction_logic")
    6813                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6814                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6815                      .dwattr $C$DW$312, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6816                      .dwattr $C$DW$312, DW_AT_decl_line(0x91)
    6817                      .dwattr $C$DW$312, DW_AT_decl_column(0x18)
    6818              
    6819              $C$DW$313       .dwtag  DW_TAG_member
    6820                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$27)
    6821                      .dwattr $C$DW$313, DW_AT_name("enable_logic")
    6822                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6823                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6824                      .dwattr $C$DW$313, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6825                      .dwattr $C$DW$313, DW_AT_decl_line(0x92)
    6826                      .dwattr $C$DW$313, DW_AT_decl_column(0x18)
    6827              
    6828              $C$DW$314       .dwtag  DW_TAG_member
    6829                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$24)
    6830                      .dwattr $C$DW$314, DW_AT_name("dutyRef_pu")
    6831                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6832                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6833                      .dwattr $C$DW$314, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6834                      .dwattr $C$DW$314, DW_AT_decl_line(0x93)
    6835                      .dwattr $C$DW$314, DW_AT_decl_column(0x18)
    6836              
    6837              $C$DW$315       .dwtag  DW_TAG_member
    6838                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$24)
    6839                      .dwattr $C$DW$315, DW_AT_name("ioutCal_pu")
    6840                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6841                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6842                      .dwattr $C$DW$315, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6843                      .dwattr $C$DW$315, DW_AT_decl_line(0x94)
    6844                      .dwattr $C$DW$315, DW_AT_decl_column(0x18)
    6845              
    6846              $C$DW$316       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  144

    6847                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$24)
    6848                      .dwattr $C$DW$316, DW_AT_name("voutCal_pu")
    6849                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6850                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6851                      .dwattr $C$DW$316, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6852                      .dwattr $C$DW$316, DW_AT_decl_line(0x95)
    6853                      .dwattr $C$DW$316, DW_AT_decl_column(0x18)
    6854              
    6855              $C$DW$317       .dwtag  DW_TAG_member
    6856                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    6857                      .dwattr $C$DW$317, DW_AT_name("IoutGain_pu")
    6858                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6859                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6860                      .dwattr $C$DW$317, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6861                      .dwattr $C$DW$317, DW_AT_decl_line(0x97)
    6862                      .dwattr $C$DW$317, DW_AT_decl_column(0x0f)
    6863              
    6864              $C$DW$318       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    6866                      .dwattr $C$DW$318, DW_AT_name("IoutOffset_pu")
    6867                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6868                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6869                      .dwattr $C$DW$318, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6870                      .dwattr $C$DW$318, DW_AT_decl_line(0x98)
    6871                      .dwattr $C$DW$318, DW_AT_decl_column(0x0f)
    6872              
    6873              $C$DW$319       .dwtag  DW_TAG_member
    6874                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    6875                      .dwattr $C$DW$319, DW_AT_name("IoutGain_A")
    6876                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6877                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6878                      .dwattr $C$DW$319, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6879                      .dwattr $C$DW$319, DW_AT_decl_line(0x99)
    6880                      .dwattr $C$DW$319, DW_AT_decl_column(0x0f)
    6881              
    6882              $C$DW$320       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    6884                      .dwattr $C$DW$320, DW_AT_name("IoutOffset_A")
    6885                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6886                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6887                      .dwattr $C$DW$320, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6888                      .dwattr $C$DW$320, DW_AT_decl_line(0x9a)
    6889                      .dwattr $C$DW$320, DW_AT_decl_column(0x0f)
    6890              
    6891              $C$DW$321       .dwtag  DW_TAG_member
    6892                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    6893                      .dwattr $C$DW$321, DW_AT_name("VoutGain_pu")
    6894                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6895                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6896                      .dwattr $C$DW$321, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6897                      .dwattr $C$DW$321, DW_AT_decl_line(0x9c)
    6898                      .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    6899              
    6900              $C$DW$322       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  145

    6902                      .dwattr $C$DW$322, DW_AT_name("VoutOffset_pu")
    6903                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6904                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6905                      .dwattr $C$DW$322, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6906                      .dwattr $C$DW$322, DW_AT_decl_line(0x9d)
    6907                      .dwattr $C$DW$322, DW_AT_decl_column(0x0f)
    6908              
    6909              $C$DW$323       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    6911                      .dwattr $C$DW$323, DW_AT_name("VoutGain_V")
    6912                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6913                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6914                      .dwattr $C$DW$323, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6915                      .dwattr $C$DW$323, DW_AT_decl_line(0x9e)
    6916                      .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    6917              
    6918              $C$DW$324       .dwtag  DW_TAG_member
    6919                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    6920                      .dwattr $C$DW$324, DW_AT_name("VoutOffset_V")
    6921                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6922                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6923                      .dwattr $C$DW$324, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6924                      .dwattr $C$DW$324, DW_AT_decl_line(0x9f)
    6925                      .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    6926              
    6927              $C$DW$325       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$26)
    6929                      .dwattr $C$DW$325, DW_AT_name("pendingUpdate")
    6930                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6931                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6932                      .dwattr $C$DW$325, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6933                      .dwattr $C$DW$325, DW_AT_decl_line(0xa1)
    6934                      .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    6935              
    6936                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6937                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x8d)
    6938                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    6939                      .dwendtag $C$DW$T$28
    6940              
    6941                      .dwendtag $C$DW$TU$28
    6942              
    6943              
    6944              $C$DW$TU$61     .dwtag  DW_TAG_type_unit
    6945                      .dwmtype  $C$DW$T$61
    6946              $C$DW$T$61      .dwtag  DW_TAG_typedef
    6947                      .dwattr $C$DW$T$61, DW_AT_name("BTS_userInput")
    6948                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$28)
    6949                      .dwattr $C$DW$T$61, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6950                      .dwattr $C$DW$T$61, DW_AT_decl_line(0xa3)
    6951                      .dwattr $C$DW$T$61, DW_AT_decl_column(0x02)
    6952              
    6953                      .dwendtag $C$DW$TU$61
    6954              
    6955              
    6956              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  146

    6957                      .dwmtype  $C$DW$T$62
    6958              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    6959                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    6960                      .dwattr $C$DW$T$62, DW_AT_address_class(0x20)
    6961              
    6962                      .dwendtag $C$DW$TU$62
    6963              
    6964              
    6965              $C$DW$TU$63     .dwtag  DW_TAG_type_unit
    6966                      .dwmtype  $C$DW$T$63
    6967              $C$DW$326       .dwtag  DW_TAG_TI_far_type
    6968                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$62)
    6969              
    6970              $C$DW$T$63      .dwtag  DW_TAG_const_type
    6971                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$326)
    6972              
    6973                      .dwendtag $C$DW$TU$63
    6974              
    6975              
    6976              $C$DW$TU$64     .dwtag  DW_TAG_type_unit
    6977                      .dwmtype  $C$DW$T$64
    6978              
    6979              $C$DW$T$64      .dwtag  DW_TAG_array_type
    6980                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$61)
    6981                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x100)
    6982              $C$DW$327       .dwtag  DW_TAG_subrange_type
    6983                      .dwattr $C$DW$327, DW_AT_upper_bound(0x07)
    6984              
    6985                      .dwendtag $C$DW$T$64
    6986              
    6987                      .dwendtag $C$DW$TU$64
    6988              
    6989              
    6990              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6991                      .dwmtype  $C$DW$T$29
    6992              
    6993              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6994                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x24)
    6995              $C$DW$328       .dwtag  DW_TAG_member
    6996                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    6997                      .dwattr $C$DW$328, DW_AT_name("dutySet_pu")
    6998                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6999                      .dwattr $C$DW$328, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7000                      .dwattr $C$DW$328, DW_AT_decl_line(0xb1)
    7001                      .dwattr $C$DW$328, DW_AT_decl_column(0x0f)
    7002              
    7003              $C$DW$329       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    7005                      .dwattr $C$DW$329, DW_AT_name("dutySetRef_pu")
    7006                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7007                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7008                      .dwattr $C$DW$329, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7009                      .dwattr $C$DW$329, DW_AT_decl_line(0xb2)
    7010                      .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    7011              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  147

    7012              $C$DW$330       .dwtag  DW_TAG_member
    7013                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    7014                      .dwattr $C$DW$330, DW_AT_name("ioutRef_pu")
    7015                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7016                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7017                      .dwattr $C$DW$330, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7018                      .dwattr $C$DW$330, DW_AT_decl_line(0xb4)
    7019                      .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    7020              
    7021              $C$DW$331       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    7023                      .dwattr $C$DW$331, DW_AT_name("ioutSet_pu")
    7024                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7025                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7026                      .dwattr $C$DW$331, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7027                      .dwattr $C$DW$331, DW_AT_decl_line(0xb5)
    7028                      .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    7029              
    7030              $C$DW$332       .dwtag  DW_TAG_member
    7031                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    7032                      .dwattr $C$DW$332, DW_AT_name("ioutSense_pu")
    7033                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7034                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7035                      .dwattr $C$DW$332, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7036                      .dwattr $C$DW$332, DW_AT_decl_line(0xb6)
    7037                      .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    7038              
    7039              $C$DW$333       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    7041                      .dwattr $C$DW$333, DW_AT_name("voutRef_pu")
    7042                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7043                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7044                      .dwattr $C$DW$333, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7045                      .dwattr $C$DW$333, DW_AT_decl_line(0xb8)
    7046                      .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
    7047              
    7048              $C$DW$334       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    7050                      .dwattr $C$DW$334, DW_AT_name("voutSet_pu")
    7051                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7052                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7053                      .dwattr $C$DW$334, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7054                      .dwattr $C$DW$334, DW_AT_decl_line(0xb9)
    7055                      .dwattr $C$DW$334, DW_AT_decl_column(0x0f)
    7056              
    7057              $C$DW$335       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    7059                      .dwattr $C$DW$335, DW_AT_name("voutSense_pu")
    7060                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7061                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7062                      .dwattr $C$DW$335, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7063                      .dwattr $C$DW$335, DW_AT_decl_line(0xba)
    7064                      .dwattr $C$DW$335, DW_AT_decl_column(0x0f)
    7065              
    7066              $C$DW$336       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  148

    7067                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    7068                      .dwattr $C$DW$336, DW_AT_name("uk_cc_pu")
    7069                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7070                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7071                      .dwattr $C$DW$336, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7072                      .dwattr $C$DW$336, DW_AT_decl_line(0xbc)
    7073                      .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    7074              
    7075              $C$DW$337       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    7077                      .dwattr $C$DW$337, DW_AT_name("ek_cc_pu")
    7078                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7079                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7080                      .dwattr $C$DW$337, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7081                      .dwattr $C$DW$337, DW_AT_decl_line(0xbd)
    7082                      .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    7083              
    7084              $C$DW$338       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    7086                      .dwattr $C$DW$338, DW_AT_name("uk_cv_pu")
    7087                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7088                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7089                      .dwattr $C$DW$338, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7090                      .dwattr $C$DW$338, DW_AT_decl_line(0xbe)
    7091                      .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    7092              
    7093              $C$DW$339       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    7095                      .dwattr $C$DW$339, DW_AT_name("ek_cv_pu")
    7096                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7097                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7098                      .dwattr $C$DW$339, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7099                      .dwattr $C$DW$339, DW_AT_decl_line(0xbf)
    7100                      .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    7101              
    7102              $C$DW$340       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    7104                      .dwattr $C$DW$340, DW_AT_name("direction_coeff")
    7105                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7106                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7107                      .dwattr $C$DW$340, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7108                      .dwattr $C$DW$340, DW_AT_decl_line(0xc0)
    7109                      .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    7110              
    7111              $C$DW$341       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7113                      .dwattr $C$DW$341, DW_AT_name("dutyH_pu")
    7114                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7115                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7116                      .dwattr $C$DW$341, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7117                      .dwattr $C$DW$341, DW_AT_decl_line(0xc2)
    7118                      .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    7119              
    7120              $C$DW$342       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  149

    7122                      .dwattr $C$DW$342, DW_AT_name("dutyL_pu")
    7123                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7124                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7125                      .dwattr $C$DW$342, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7126                      .dwattr $C$DW$342, DW_AT_decl_line(0xc3)
    7127                      .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    7128              
    7129              $C$DW$343       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$26)
    7131                      .dwattr $C$DW$343, DW_AT_name("ctrlMode_logic")
    7132                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7133                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7134                      .dwattr $C$DW$343, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7135                      .dwattr $C$DW$343, DW_AT_decl_line(0xc5)
    7136                      .dwattr $C$DW$343, DW_AT_decl_column(0x0e)
    7137              
    7138              $C$DW$344       .dwtag  DW_TAG_member
    7139                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$26)
    7140                      .dwattr $C$DW$344, DW_AT_name("direction_logic")
    7141                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7142                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7143                      .dwattr $C$DW$344, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7144                      .dwattr $C$DW$344, DW_AT_decl_line(0xc6)
    7145                      .dwattr $C$DW$344, DW_AT_decl_column(0x0e)
    7146              
    7147              $C$DW$345       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    7149                      .dwattr $C$DW$345, DW_AT_name("ioutTrip_16b")
    7150                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7151                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7152                      .dwattr $C$DW$345, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7153                      .dwattr $C$DW$345, DW_AT_decl_line(0xc8)
    7154                      .dwattr $C$DW$345, DW_AT_decl_column(0x0d)
    7155              
    7156              $C$DW$346       .dwtag  DW_TAG_member
    7157                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    7158                      .dwattr $C$DW$346, DW_AT_name("ioutTrip_n_16b")
    7159                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7160                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7161                      .dwattr $C$DW$346, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7162                      .dwattr $C$DW$346, DW_AT_decl_line(0xc9)
    7163                      .dwattr $C$DW$346, DW_AT_decl_column(0x0d)
    7164              
    7165              $C$DW$347       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$26)
    7167                      .dwattr $C$DW$347, DW_AT_name("tripFlag")
    7168                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7169                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7170                      .dwattr $C$DW$347, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7171                      .dwattr $C$DW$347, DW_AT_decl_line(0xca)
    7172                      .dwattr $C$DW$347, DW_AT_decl_column(0x0e)
    7173              
    7174                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7175                      .dwattr $C$DW$T$29, DW_AT_decl_line(0xb0)
    7176                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  150

    7177                      .dwendtag $C$DW$T$29
    7178              
    7179                      .dwendtag $C$DW$TU$29
    7180              
    7181              
    7182              $C$DW$TU$68     .dwtag  DW_TAG_type_unit
    7183                      .dwmtype  $C$DW$T$68
    7184              $C$DW$T$68      .dwtag  DW_TAG_typedef
    7185                      .dwattr $C$DW$T$68, DW_AT_name("BTS_ctrlLoopVariable")
    7186                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
    7187                      .dwattr $C$DW$T$68, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7188                      .dwattr $C$DW$T$68, DW_AT_decl_line(0xcc)
    7189                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x02)
    7190              
    7191                      .dwendtag $C$DW$TU$68
    7192              
    7193              
    7194              $C$DW$TU$69     .dwtag  DW_TAG_type_unit
    7195                      .dwmtype  $C$DW$T$69
    7196              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    7197                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    7198                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    7199              
    7200                      .dwendtag $C$DW$TU$69
    7201              
    7202              
    7203              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    7204                      .dwmtype  $C$DW$T$70
    7205              $C$DW$348       .dwtag  DW_TAG_TI_far_type
    7206                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$69)
    7207              
    7208              $C$DW$T$70      .dwtag  DW_TAG_const_type
    7209                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$348)
    7210              
    7211                      .dwendtag $C$DW$TU$70
    7212              
    7213              
    7214              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    7215                      .dwmtype  $C$DW$T$71
    7216              
    7217              $C$DW$T$71      .dwtag  DW_TAG_array_type
    7218                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$68)
    7219                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x120)
    7220              $C$DW$349       .dwtag  DW_TAG_subrange_type
    7221                      .dwattr $C$DW$349, DW_AT_upper_bound(0x07)
    7222              
    7223                      .dwendtag $C$DW$T$71
    7224              
    7225                      .dwendtag $C$DW$TU$71
    7226              
    7227              
    7228              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    7229                      .dwmtype  $C$DW$T$33
    7230              
    7231              $C$DW$T$33      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  151

    7232                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x52)
    7233              $C$DW$350       .dwtag  DW_TAG_member
    7234                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    7235                      .dwattr $C$DW$350, DW_AT_name("Isense_A")
    7236                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7237                      .dwattr $C$DW$350, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7238                      .dwattr $C$DW$350, DW_AT_decl_line(0x5f)
    7239                      .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    7240              
    7241              $C$DW$351       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    7243                      .dwattr $C$DW$351, DW_AT_name("Vsense_V")
    7244                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7245                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7246                      .dwattr $C$DW$351, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7247                      .dwattr $C$DW$351, DW_AT_decl_line(0x60)
    7248                      .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    7249              
    7250              $C$DW$352       .dwtag  DW_TAG_member
    7251                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$30)
    7252                      .dwattr $C$DW$352, DW_AT_name("Isense_16b")
    7253                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7254                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7255                      .dwattr $C$DW$352, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7256                      .dwattr $C$DW$352, DW_AT_decl_line(0x61)
    7257                      .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    7258              
    7259              $C$DW$353       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$30)
    7261                      .dwattr $C$DW$353, DW_AT_name("Vsense_16b")
    7262                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7263                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7264                      .dwattr $C$DW$353, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7265                      .dwattr $C$DW$353, DW_AT_decl_line(0x62)
    7266                      .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    7267              
    7268              $C$DW$354       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$32)
    7270                      .dwattr $C$DW$354, DW_AT_name("Sum_I")
    7271                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7272                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7273                      .dwattr $C$DW$354, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7274                      .dwattr $C$DW$354, DW_AT_decl_line(0x63)
    7275                      .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    7276              
    7277              $C$DW$355       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$32)
    7279                      .dwattr $C$DW$355, DW_AT_name("Sum_V")
    7280                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7281                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7282                      .dwattr $C$DW$355, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7283                      .dwattr $C$DW$355, DW_AT_decl_line(0x64)
    7284                      .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    7285              
    7286              $C$DW$356       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  152

    7287                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$26)
    7288                      .dwattr $C$DW$356, DW_AT_name("Index")
    7289                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7290                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7291                      .dwattr $C$DW$356, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7292                      .dwattr $C$DW$356, DW_AT_decl_line(0x65)
    7293                      .dwattr $C$DW$356, DW_AT_decl_column(0x0e)
    7294              
    7295              $C$DW$357       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    7297                      .dwattr $C$DW$357, DW_AT_name("IoutGain_A")
    7298                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7299                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7300                      .dwattr $C$DW$357, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7301                      .dwattr $C$DW$357, DW_AT_decl_line(0x66)
    7302                      .dwattr $C$DW$357, DW_AT_decl_column(0x0f)
    7303              
    7304              $C$DW$358       .dwtag  DW_TAG_member
    7305                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    7306                      .dwattr $C$DW$358, DW_AT_name("IoutOffset_A")
    7307                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7308                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7309                      .dwattr $C$DW$358, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7310                      .dwattr $C$DW$358, DW_AT_decl_line(0x67)
    7311                      .dwattr $C$DW$358, DW_AT_decl_column(0x0f)
    7312              
    7313              $C$DW$359       .dwtag  DW_TAG_member
    7314                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    7315                      .dwattr $C$DW$359, DW_AT_name("VoutGain_V")
    7316                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7317                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7318                      .dwattr $C$DW$359, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7319                      .dwattr $C$DW$359, DW_AT_decl_line(0x68)
    7320                      .dwattr $C$DW$359, DW_AT_decl_column(0x0f)
    7321              
    7322              $C$DW$360       .dwtag  DW_TAG_member
    7323                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    7324                      .dwattr $C$DW$360, DW_AT_name("VoutOffset_V")
    7325                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7326                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7327                      .dwattr $C$DW$360, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7328                      .dwattr $C$DW$360, DW_AT_decl_line(0x69)
    7329                      .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    7330              
    7331                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7332                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x5e)
    7333                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7334                      .dwendtag $C$DW$T$33
    7335              
    7336                      .dwendtag $C$DW$TU$33
    7337              
    7338              
    7339              $C$DW$TU$75     .dwtag  DW_TAG_type_unit
    7340                      .dwmtype  $C$DW$T$75
    7341              $C$DW$T$75      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  153

    7342                      .dwattr $C$DW$T$75, DW_AT_name("BTS_measValue")
    7343                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$33)
    7344                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7345                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x6b)
    7346                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
    7347              
    7348                      .dwendtag $C$DW$TU$75
    7349              
    7350              
    7351              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
    7352                      .dwmtype  $C$DW$T$76
    7353              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    7354                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    7355                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    7356              
    7357                      .dwendtag $C$DW$TU$76
    7358              
    7359              
    7360              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    7361                      .dwmtype  $C$DW$T$77
    7362              $C$DW$361       .dwtag  DW_TAG_TI_far_type
    7363                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$76)
    7364              
    7365              $C$DW$T$77      .dwtag  DW_TAG_const_type
    7366                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$361)
    7367              
    7368                      .dwendtag $C$DW$TU$77
    7369              
    7370              
    7371              $C$DW$TU$78     .dwtag  DW_TAG_type_unit
    7372                      .dwmtype  $C$DW$T$78
    7373              
    7374              $C$DW$T$78      .dwtag  DW_TAG_array_type
    7375                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$75)
    7376                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x290)
    7377              $C$DW$362       .dwtag  DW_TAG_subrange_type
    7378                      .dwattr $C$DW$362, DW_AT_upper_bound(0x07)
    7379              
    7380                      .dwendtag $C$DW$T$78
    7381              
    7382                      .dwendtag $C$DW$TU$78
    7383              
    7384              
    7385              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    7386                      .dwmtype  $C$DW$T$35
    7387              
    7388              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7389                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x406)
    7390              $C$DW$363       .dwtag  DW_TAG_member
    7391                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$34)
    7392                      .dwattr $C$DW$363, DW_AT_name("plantMagVect")
    7393                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7394                      .dwattr $C$DW$363, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7395                      .dwattr $C$DW$363, DW_AT_decl_line(0x166)
    7396                      .dwattr $C$DW$363, DW_AT_decl_column(0x14)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  154

    7397              
    7398              $C$DW$364       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$34)
    7400                      .dwattr $C$DW$364, DW_AT_name("plantPhaseVect")
    7401                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7402                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7403                      .dwattr $C$DW$364, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7404                      .dwattr $C$DW$364, DW_AT_decl_line(0x167)
    7405                      .dwattr $C$DW$364, DW_AT_decl_column(0x14)
    7406              
    7407              $C$DW$365       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$34)
    7409                      .dwattr $C$DW$365, DW_AT_name("olMagVect")
    7410                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x19c]
    7411                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7412                      .dwattr $C$DW$365, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7413                      .dwattr $C$DW$365, DW_AT_decl_line(0x168)
    7414                      .dwattr $C$DW$365, DW_AT_decl_column(0x14)
    7415              
    7416              $C$DW$366       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$34)
    7418                      .dwattr $C$DW$366, DW_AT_name("olPhaseVect")
    7419                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x26a]
    7420                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7421                      .dwattr $C$DW$366, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7422                      .dwattr $C$DW$366, DW_AT_decl_line(0x169)
    7423                      .dwattr $C$DW$366, DW_AT_decl_column(0x14)
    7424              
    7425              $C$DW$367       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$34)
    7427                      .dwattr $C$DW$367, DW_AT_name("freqVect")
    7428                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x338]
    7429                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7430                      .dwattr $C$DW$367, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7431                      .dwattr $C$DW$367, DW_AT_decl_line(0x16a)
    7432                      .dwattr $C$DW$367, DW_AT_decl_column(0x14)
    7433              
    7434                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7435                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x165)
    7436                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x14)
    7437                      .dwendtag $C$DW$T$35
    7438              
    7439                      .dwendtag $C$DW$TU$35
    7440              
    7441              
    7442              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    7443                      .dwmtype  $C$DW$T$82
    7444              $C$DW$T$82      .dwtag  DW_TAG_typedef
    7445                      .dwattr $C$DW$T$82, DW_AT_name("BTS_SfraDataType")
    7446                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$35)
    7447                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7448                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x16b)
    7449                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x07)
    7450              
    7451                      .dwendtag $C$DW$TU$82
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  155

    7452              
    7453              
    7454              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    7455                      .dwmtype  $C$DW$T$41
    7456              
    7457              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7458                      .dwattr $C$DW$T$41, DW_AT_name("I2CHandle")
    7459                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    7460              $C$DW$368       .dwtag  DW_TAG_member
    7461                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$37)
    7462                      .dwattr $C$DW$368, DW_AT_name("base")
    7463                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7464                      .dwattr $C$DW$368, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7465                      .dwattr $C$DW$368, DW_AT_decl_line(0x48)
    7466                      .dwattr $C$DW$368, DW_AT_decl_column(0x0e)
    7467              
    7468              $C$DW$369       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$26)
    7470                      .dwattr $C$DW$369, DW_AT_name("SlaveAddr")
    7471                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7472                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7473                      .dwattr $C$DW$369, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7474                      .dwattr $C$DW$369, DW_AT_decl_line(0x49)
    7475                      .dwattr $C$DW$369, DW_AT_decl_column(0x0e)
    7476              
    7477              $C$DW$370       .dwtag  DW_TAG_member
    7478                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$38)
    7479                      .dwattr $C$DW$370, DW_AT_name("pControlAddr")
    7480                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7481                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7482                      .dwattr $C$DW$370, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7483                      .dwattr $C$DW$370, DW_AT_decl_line(0x4a)
    7484                      .dwattr $C$DW$370, DW_AT_decl_column(0x0f)
    7485              
    7486              $C$DW$371       .dwtag  DW_TAG_member
    7487                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
    7488                      .dwattr $C$DW$371, DW_AT_name("NumOfAddrBytes")
    7489                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7490                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7491                      .dwattr $C$DW$371, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7492                      .dwattr $C$DW$371, DW_AT_decl_line(0x4b)
    7493                      .dwattr $C$DW$371, DW_AT_decl_column(0x0e)
    7494              
    7495              $C$DW$372       .dwtag  DW_TAG_member
    7496                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$39)
    7497                      .dwattr $C$DW$372, DW_AT_name("pTX_MsgBuffer")
    7498                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7499                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7500                      .dwattr $C$DW$372, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7501                      .dwattr $C$DW$372, DW_AT_decl_line(0x4c)
    7502                      .dwattr $C$DW$372, DW_AT_decl_column(0x0f)
    7503              
    7504              $C$DW$373       .dwtag  DW_TAG_member
    7505                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$39)
    7506                      .dwattr $C$DW$373, DW_AT_name("pRX_MsgBuffer")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  156

    7507                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7508                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7509                      .dwattr $C$DW$373, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7510                      .dwattr $C$DW$373, DW_AT_decl_line(0x4d)
    7511                      .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    7512              
    7513              $C$DW$374       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    7515                      .dwattr $C$DW$374, DW_AT_name("NumOfDataBytes")
    7516                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7517                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7518                      .dwattr $C$DW$374, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7519                      .dwattr $C$DW$374, DW_AT_decl_line(0x4e)
    7520                      .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    7521              
    7522              $C$DW$375       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$40)
    7524                      .dwattr $C$DW$375, DW_AT_name("currentHandlePtr")
    7525                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7526                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7527                      .dwattr $C$DW$375, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7528                      .dwattr $C$DW$375, DW_AT_decl_line(0x4f)
    7529                      .dwattr $C$DW$375, DW_AT_decl_column(0x17)
    7530              
    7531              $C$DW$376       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    7533                      .dwattr $C$DW$376, DW_AT_name("numofSixteenByte")
    7534                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7535                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7536                      .dwattr $C$DW$376, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7537                      .dwattr $C$DW$376, DW_AT_decl_line(0x51)
    7538                      .dwattr $C$DW$376, DW_AT_decl_column(0x0e)
    7539              
    7540              $C$DW$377       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$26)
    7542                      .dwattr $C$DW$377, DW_AT_name("remainingBytes")
    7543                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7544                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7545                      .dwattr $C$DW$377, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7546                      .dwattr $C$DW$377, DW_AT_decl_line(0x52)
    7547                      .dwattr $C$DW$377, DW_AT_decl_column(0x0e)
    7548              
    7549              $C$DW$378       .dwtag  DW_TAG_member
    7550                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$26)
    7551                      .dwattr $C$DW$378, DW_AT_name("WriteCycleTime_in_us")
    7552                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7553                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7554                      .dwattr $C$DW$378, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7555                      .dwattr $C$DW$378, DW_AT_decl_line(0x54)
    7556                      .dwattr $C$DW$378, DW_AT_decl_column(0x0e)
    7557              
    7558              $C$DW$379       .dwtag  DW_TAG_member
    7559                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    7560                      .dwattr $C$DW$379, DW_AT_name("status")
    7561                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  157

    7562                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7563                      .dwattr $C$DW$379, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7564                      .dwattr $C$DW$379, DW_AT_decl_line(0x56)
    7565                      .dwattr $C$DW$379, DW_AT_decl_column(0x0e)
    7566              
    7567                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7568                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    7569                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
    7570                      .dwendtag $C$DW$T$41
    7571              
    7572                      .dwendtag $C$DW$TU$41
    7573              
    7574              
    7575              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    7576                      .dwmtype  $C$DW$T$40
    7577              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7578                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$41)
    7579                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    7580              
    7581                      .dwendtag $C$DW$TU$40
    7582              
    7583              
    7584              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    7585                      .dwmtype  $C$DW$T$42
    7586              
    7587              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7588                      .dwattr $C$DW$T$42, DW_AT_name("_BTS_channelCalibration")
    7589                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    7590              $C$DW$380       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$37)
    7592                      .dwattr $C$DW$380, DW_AT_name("header")
    7593                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7594                      .dwattr $C$DW$380, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7595                      .dwattr $C$DW$380, DW_AT_decl_line(0x7d)
    7596                      .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    7597              
    7598              $C$DW$381       .dwtag  DW_TAG_member
    7599                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$37)
    7600                      .dwattr $C$DW$381, DW_AT_name("dateTime")
    7601                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7602                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7603                      .dwattr $C$DW$381, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7604                      .dwattr $C$DW$381, DW_AT_decl_line(0x7e)
    7605                      .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    7606              
    7607              $C$DW$382       .dwtag  DW_TAG_member
    7608                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    7609                      .dwattr $C$DW$382, DW_AT_name("IoutGain_pu")
    7610                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7611                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7612                      .dwattr $C$DW$382, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7613                      .dwattr $C$DW$382, DW_AT_decl_line(0x80)
    7614                      .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    7615              
    7616              $C$DW$383       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  158

    7617                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    7618                      .dwattr $C$DW$383, DW_AT_name("IoutOffset_pu")
    7619                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7620                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7621                      .dwattr $C$DW$383, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7622                      .dwattr $C$DW$383, DW_AT_decl_line(0x81)
    7623                      .dwattr $C$DW$383, DW_AT_decl_column(0x0f)
    7624              
    7625              $C$DW$384       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    7627                      .dwattr $C$DW$384, DW_AT_name("IoutGain_A")
    7628                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7629                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7630                      .dwattr $C$DW$384, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7631                      .dwattr $C$DW$384, DW_AT_decl_line(0x82)
    7632                      .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    7633              
    7634              $C$DW$385       .dwtag  DW_TAG_member
    7635                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    7636                      .dwattr $C$DW$385, DW_AT_name("IoutOffset_A")
    7637                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7638                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7639                      .dwattr $C$DW$385, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7640                      .dwattr $C$DW$385, DW_AT_decl_line(0x83)
    7641                      .dwattr $C$DW$385, DW_AT_decl_column(0x0f)
    7642              
    7643              $C$DW$386       .dwtag  DW_TAG_member
    7644                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    7645                      .dwattr $C$DW$386, DW_AT_name("VoutGain_pu")
    7646                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7647                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7648                      .dwattr $C$DW$386, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7649                      .dwattr $C$DW$386, DW_AT_decl_line(0x85)
    7650                      .dwattr $C$DW$386, DW_AT_decl_column(0x0f)
    7651              
    7652              $C$DW$387       .dwtag  DW_TAG_member
    7653                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    7654                      .dwattr $C$DW$387, DW_AT_name("VoutOffset_pu")
    7655                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7656                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7657                      .dwattr $C$DW$387, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7658                      .dwattr $C$DW$387, DW_AT_decl_line(0x86)
    7659                      .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    7660              
    7661              $C$DW$388       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    7663                      .dwattr $C$DW$388, DW_AT_name("VoutGain_V")
    7664                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7665                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7666                      .dwattr $C$DW$388, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7667                      .dwattr $C$DW$388, DW_AT_decl_line(0x87)
    7668                      .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    7669              
    7670              $C$DW$389       .dwtag  DW_TAG_member
    7671                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  159

    7672                      .dwattr $C$DW$389, DW_AT_name("VoutOffset_V")
    7673                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7674                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7675                      .dwattr $C$DW$389, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7676                      .dwattr $C$DW$389, DW_AT_decl_line(0x88)
    7677                      .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    7678              
    7679                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7680                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x78)
    7681                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    7682                      .dwendtag $C$DW$T$42
    7683              
    7684                      .dwendtag $C$DW$TU$42
    7685              
    7686              
    7687              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    7688                      .dwmtype  $C$DW$T$84
    7689              $C$DW$T$84      .dwtag  DW_TAG_typedef
    7690                      .dwattr $C$DW$T$84, DW_AT_name("BTS_channelCalibration")
    7691                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$42)
    7692                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7693                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x8a)
    7694                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    7695              
    7696                      .dwendtag $C$DW$TU$84
    7697              
    7698              
    7699              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    7700                      .dwmtype  $C$DW$T$44
    7701              
    7702              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7703                      .dwattr $C$DW$T$44, DW_AT_name("_Complex_double")
    7704                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    7705              $C$DW$390       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$43)
    7707                      .dwattr $C$DW$390, DW_AT_name("_Vals")
    7708                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7709                      .dwattr $C$DW$390, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7710                      .dwattr $C$DW$390, DW_AT_decl_line(0xe9)
    7711                      .dwattr $C$DW$390, DW_AT_decl_column(0x18)
    7712              
    7713                      .dwendtag $C$DW$T$44
    7714              
    7715                      .dwendtag $C$DW$TU$44
    7716              
    7717              
    7718              $C$DW$TU$86     .dwtag  DW_TAG_type_unit
    7719                      .dwmtype  $C$DW$T$86
    7720              $C$DW$T$86      .dwtag  DW_TAG_typedef
    7721                      .dwattr $C$DW$T$86, DW_AT_name("_Complex_double")
    7722                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$44)
    7723                      .dwattr $C$DW$T$86, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7724                      .dwattr $C$DW$T$86, DW_AT_decl_line(0xe9)
    7725                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x18)
    7726              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  160

    7727                      .dwendtag $C$DW$TU$86
    7728              
    7729              
    7730              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    7731                      .dwmtype  $C$DW$T$46
    7732              
    7733              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7734                      .dwattr $C$DW$T$46, DW_AT_name("_Complex_float")
    7735                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    7736              $C$DW$391       .dwtag  DW_TAG_member
    7737                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$45)
    7738                      .dwattr $C$DW$391, DW_AT_name("_Vals")
    7739                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7740                      .dwattr $C$DW$391, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7741                      .dwattr $C$DW$391, DW_AT_decl_line(0xe9)
    7742                      .dwattr $C$DW$391, DW_AT_decl_column(0x18)
    7743              
    7744                      .dwendtag $C$DW$T$46
    7745              
    7746                      .dwendtag $C$DW$TU$46
    7747              
    7748              
    7749              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    7750                      .dwmtype  $C$DW$T$87
    7751              $C$DW$T$87      .dwtag  DW_TAG_typedef
    7752                      .dwattr $C$DW$T$87, DW_AT_name("_Complex_float")
    7753                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$46)
    7754                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7755                      .dwattr $C$DW$T$87, DW_AT_decl_line(0xe9)
    7756                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x18)
    7757              
    7758                      .dwendtag $C$DW$TU$87
    7759              
    7760              
    7761              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    7762                      .dwmtype  $C$DW$T$48
    7763              
    7764              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    7765                      .dwattr $C$DW$T$48, DW_AT_name("_Complex_long_double")
    7766                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    7767              $C$DW$392       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    7769                      .dwattr $C$DW$392, DW_AT_name("_Vals")
    7770                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7771                      .dwattr $C$DW$392, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7772                      .dwattr $C$DW$392, DW_AT_decl_line(0xe9)
    7773                      .dwattr $C$DW$392, DW_AT_decl_column(0x18)
    7774              
    7775                      .dwendtag $C$DW$T$48
    7776              
    7777                      .dwendtag $C$DW$TU$48
    7778              
    7779              
    7780              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    7781                      .dwmtype  $C$DW$T$89
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  161

    7782              $C$DW$T$89      .dwtag  DW_TAG_typedef
    7783                      .dwattr $C$DW$T$89, DW_AT_name("_Complex_long_double")
    7784                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    7785                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7786                      .dwattr $C$DW$T$89, DW_AT_decl_line(0xe9)
    7787                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x18)
    7788              
    7789                      .dwendtag $C$DW$TU$89
    7790              
    7791              
    7792              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    7793                      .dwmtype  $C$DW$T$2
    7794              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7795                      .dwattr $C$DW$T$2, DW_AT_name("void")
    7796              
    7797                      .dwendtag $C$DW$TU$2
    7798              
    7799              
    7800              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    7801                      .dwmtype  $C$DW$T$4
    7802              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7803                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7804                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7805                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7806              
    7807                      .dwendtag $C$DW$TU$4
    7808              
    7809              
    7810              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    7811                      .dwmtype  $C$DW$T$5
    7812              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7813                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7814                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7815                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7816              
    7817                      .dwendtag $C$DW$TU$5
    7818              
    7819              
    7820              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    7821                      .dwmtype  $C$DW$T$6
    7822              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7823                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7824                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7825                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7826              
    7827                      .dwendtag $C$DW$TU$6
    7828              
    7829              
    7830              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    7831                      .dwmtype  $C$DW$T$7
    7832              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7833                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7834                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7835                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    7836              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  162

    7837                      .dwendtag $C$DW$TU$7
    7838              
    7839              
    7840              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    7841                      .dwmtype  $C$DW$T$8
    7842              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7843                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7844                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7845                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7846              
    7847                      .dwendtag $C$DW$TU$8
