TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Tue Mar  2 07:24:44 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")

    6806                      .group    "__isinff", 1
    6807                      .gmember  ".text:__isinff"
    6808                      .endgroup
    6809                      .group    "__isinfl", 1
    6810                      .gmember  ".text:__isinfl"
    6811                      .endgroup
    6812                      .group    "__isnan", 1
    6813                      .gmember  ".text:__isnan"
    6814                      .endgroup
    6815                      .group    "__isnanf", 1
    6816                      .gmember  ".text:__isnanf"
    6817                      .endgroup
    6818                      .group    "__isnanl", 1
    6819                      .gmember  ".text:__isnanl"
    6820                      .endgroup
    6821                      .group    "__isnormal", 1
    6822                      .gmember  ".text:__isnormal"
    6823                      .endgroup
    6824                      .group    "__isnormalf", 1
    6825                      .gmember  ".text:__isnormalf"
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  152

    6826                      .endgroup
    6827                      .group    "__isnormall", 1
    6828                      .gmember  ".text:__isnormall"
    6829                      .endgroup
    6830                      .group    "__relaxed_atan2f", 1
    6831                      .gmember  ".text:__relaxed_atan2f"
    6832                      .endgroup
    6833                      .group    "__relaxed_atanf", 1
    6834                      .gmember  ".text:__relaxed_atanf"
    6835                      .endgroup
    6836                      .group    "__relaxed_cosf", 1
    6837                      .gmember  ".text:__relaxed_cosf"
    6838                      .endgroup
    6839                      .group    "__relaxed_sinf", 1
    6840                      .gmember  ".text:__relaxed_sinf"
    6841                      .endgroup
    6842                      .group    "__relaxed_sqrtf", 1
    6843                      .gmember  ".text:__relaxed_sqrtf"
    6844                      .endgroup
    6845                      .group    "__signbit", 1
    6846                      .gmember  ".text:__signbit"
    6847                      .endgroup
    6848                      .group    "__signbitf", 1
    6849                      .gmember  ".text:__signbitf"
    6850                      .endgroup
    6851                      .group    "__signbitl", 1
    6852                      .gmember  ".text:__signbitl"
    6853                      .endgroup
    6854              
    6855              
    6856              ;***************************************************************
    6857              ;* BUILD ATTRIBUTES                                            *
    6858              ;***************************************************************
    6859                      .battr "c28xabi", Tag_File, 1, Tag_float_args(1)
    6860                      .battr "c28xabi", Tag_File, 1, Tag_double_args(1)
    6861                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6862              
    6863              ;***************************************************************
    6864              ;* DWARF CIE ENTRIES                                           *
    6865              ;***************************************************************
    6866              
    6867              $C$DW$CIE       .dwcie 26
    6868                      .dwcfi  cfa_register, 20
    6869                      .dwcfi  cfa_offset, 0
    6870                      .dwcfi  same_value, 28
    6871                      .dwcfi  same_value, 6
    6872                      .dwcfi  same_value, 7
    6873                      .dwcfi  same_value, 8
    6874                      .dwcfi  same_value, 9
    6875                      .dwcfi  same_value, 10
    6876                      .dwcfi  same_value, 11
    6877                      .dwcfi  same_value, 59
    6878                      .dwcfi  same_value, 63
    6879                      .dwcfi  same_value, 67
    6880                      .dwcfi  same_value, 71
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  153

    6881                      .dwendentry
    6882                      .dwendtag $C$DW$CU
    6883              
    6884              
    6885              ;***************************************************************
    6886              ;* TYPE INFORMATION                                            *
    6887              ;***************************************************************
    6888              
    6889              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    6890                      .dwmtype  $C$DW$T$23
    6891              
    6892              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6893                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    6894              $C$DW$296       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    6896                      .dwattr $C$DW$296, DW_AT_name("h_magVect")
    6897                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6898                      .dwattr $C$DW$296, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6899                      .dwattr $C$DW$296, DW_AT_decl_line(0x40)
    6900                      .dwattr $C$DW$296, DW_AT_decl_column(0x10)
    6901              
    6902              $C$DW$297       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    6904                      .dwattr $C$DW$297, DW_AT_name("h_phaseVect")
    6905                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6906                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6907                      .dwattr $C$DW$297, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6908                      .dwattr $C$DW$297, DW_AT_decl_line(0x41)
    6909                      .dwattr $C$DW$297, DW_AT_decl_column(0x10)
    6910              
    6911              $C$DW$298       .dwtag  DW_TAG_member
    6912                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    6913                      .dwattr $C$DW$298, DW_AT_name("gh_magVect")
    6914                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6915                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6916                      .dwattr $C$DW$298, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6917                      .dwattr $C$DW$298, DW_AT_decl_line(0x42)
    6918                      .dwattr $C$DW$298, DW_AT_decl_column(0x10)
    6919              
    6920              $C$DW$299       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    6922                      .dwattr $C$DW$299, DW_AT_name("gh_phaseVect")
    6923                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6924                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6925                      .dwattr $C$DW$299, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6926                      .dwattr $C$DW$299, DW_AT_decl_line(0x43)
    6927                      .dwattr $C$DW$299, DW_AT_decl_column(0x10)
    6928              
    6929              $C$DW$300       .dwtag  DW_TAG_member
    6930                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    6931                      .dwattr $C$DW$300, DW_AT_name("cl_magVect")
    6932                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6933                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6934                      .dwattr $C$DW$300, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6935                      .dwattr $C$DW$300, DW_AT_decl_line(0x44)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  154

    6936                      .dwattr $C$DW$300, DW_AT_decl_column(0x10)
    6937              
    6938              $C$DW$301       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    6940                      .dwattr $C$DW$301, DW_AT_name("cl_phaseVect")
    6941                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6942                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6943                      .dwattr $C$DW$301, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6944                      .dwattr $C$DW$301, DW_AT_decl_line(0x45)
    6945                      .dwattr $C$DW$301, DW_AT_decl_column(0x10)
    6946              
    6947              $C$DW$302       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
    6949                      .dwattr $C$DW$302, DW_AT_name("freqVect")
    6950                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6951                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6952                      .dwattr $C$DW$302, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6953                      .dwattr $C$DW$302, DW_AT_decl_line(0x46)
    6954                      .dwattr $C$DW$302, DW_AT_decl_column(0x10)
    6955              
    6956              $C$DW$303       .dwtag  DW_TAG_member
    6957                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    6958                      .dwattr $C$DW$303, DW_AT_name("amplitude")
    6959                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6960                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6961                      .dwattr $C$DW$303, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6962                      .dwattr $C$DW$303, DW_AT_decl_line(0x47)
    6963                      .dwattr $C$DW$303, DW_AT_decl_column(0x0f)
    6964              
    6965              $C$DW$304       .dwtag  DW_TAG_member
    6966                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    6967                      .dwattr $C$DW$304, DW_AT_name("isrFreq")
    6968                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6969                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6970                      .dwattr $C$DW$304, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6971                      .dwattr $C$DW$304, DW_AT_decl_line(0x48)
    6972                      .dwattr $C$DW$304, DW_AT_decl_column(0x0f)
    6973              
    6974              $C$DW$305       .dwtag  DW_TAG_member
    6975                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    6976                      .dwattr $C$DW$305, DW_AT_name("freqStart")
    6977                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6978                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6979                      .dwattr $C$DW$305, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6980                      .dwattr $C$DW$305, DW_AT_decl_line(0x49)
    6981                      .dwattr $C$DW$305, DW_AT_decl_column(0x0f)
    6982              
    6983              $C$DW$306       .dwtag  DW_TAG_member
    6984                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    6985                      .dwattr $C$DW$306, DW_AT_name("freqStep")
    6986                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6987                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6988                      .dwattr $C$DW$306, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6989                      .dwattr $C$DW$306, DW_AT_decl_line(0x4a)
    6990                      .dwattr $C$DW$306, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  155

    6991              
    6992              $C$DW$307       .dwtag  DW_TAG_member
    6993                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    6994                      .dwattr $C$DW$307, DW_AT_name("start")
    6995                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6996                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6997                      .dwattr $C$DW$307, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6998                      .dwattr $C$DW$307, DW_AT_decl_line(0x4b)
    6999                      .dwattr $C$DW$307, DW_AT_decl_column(0x0d)
    7000              
    7001              $C$DW$308       .dwtag  DW_TAG_member
    7002                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
    7003                      .dwattr $C$DW$308, DW_AT_name("state")
    7004                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7005                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    7006                      .dwattr $C$DW$308, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7007                      .dwattr $C$DW$308, DW_AT_decl_line(0x4c)
    7008                      .dwattr $C$DW$308, DW_AT_decl_column(0x0d)
    7009              
    7010              $C$DW$309       .dwtag  DW_TAG_member
    7011                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$22)
    7012                      .dwattr $C$DW$309, DW_AT_name("status")
    7013                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7014                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    7015                      .dwattr $C$DW$309, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7016                      .dwattr $C$DW$309, DW_AT_decl_line(0x4d)
    7017                      .dwattr $C$DW$309, DW_AT_decl_column(0x0d)
    7018              
    7019              $C$DW$310       .dwtag  DW_TAG_member
    7020                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$22)
    7021                      .dwattr $C$DW$310, DW_AT_name("vecLength")
    7022                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7023                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    7024                      .dwattr $C$DW$310, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7025                      .dwattr $C$DW$310, DW_AT_decl_line(0x4e)
    7026                      .dwattr $C$DW$310, DW_AT_decl_column(0x0d)
    7027              
    7028              $C$DW$311       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    7030                      .dwattr $C$DW$311, DW_AT_name("freqIndex")
    7031                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7032                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7033                      .dwattr $C$DW$311, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7034                      .dwattr $C$DW$311, DW_AT_decl_line(0x4f)
    7035                      .dwattr $C$DW$311, DW_AT_decl_column(0x0d)
    7036              
    7037              $C$DW$312       .dwtag  DW_TAG_member
    7038                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    7039                      .dwattr $C$DW$312, DW_AT_name("storeH")
    7040                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7041                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    7042                      .dwattr $C$DW$312, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7043                      .dwattr $C$DW$312, DW_AT_decl_line(0x50)
    7044                      .dwattr $C$DW$312, DW_AT_decl_column(0x0d)
    7045              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  156

    7046              $C$DW$313       .dwtag  DW_TAG_member
    7047                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$22)
    7048                      .dwattr $C$DW$313, DW_AT_name("storeGH")
    7049                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7050                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    7051                      .dwattr $C$DW$313, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7052                      .dwattr $C$DW$313, DW_AT_decl_line(0x51)
    7053                      .dwattr $C$DW$313, DW_AT_decl_column(0x0d)
    7054              
    7055              $C$DW$314       .dwtag  DW_TAG_member
    7056                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$22)
    7057                      .dwattr $C$DW$314, DW_AT_name("storeCL")
    7058                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7059                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    7060                      .dwattr $C$DW$314, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7061                      .dwattr $C$DW$314, DW_AT_decl_line(0x52)
    7062                      .dwattr $C$DW$314, DW_AT_decl_column(0x0d)
    7063              
    7064              $C$DW$315       .dwtag  DW_TAG_member
    7065                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
    7066                      .dwattr $C$DW$315, DW_AT_name("speed")
    7067                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7068                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    7069                      .dwattr $C$DW$315, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7070                      .dwattr $C$DW$315, DW_AT_decl_line(0x53)
    7071                      .dwattr $C$DW$315, DW_AT_decl_column(0x0d)
    7072              
    7073                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7074                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    7075                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    7076                      .dwendtag $C$DW$T$23
    7077              
    7078                      .dwendtag $C$DW$TU$23
    7079              
    7080              
    7081              $C$DW$TU$57     .dwtag  DW_TAG_type_unit
    7082                      .dwmtype  $C$DW$T$57
    7083              $C$DW$T$57      .dwtag  DW_TAG_typedef
    7084                      .dwattr $C$DW$T$57, DW_AT_name("SFRA_F32")
    7085                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    7086                      .dwattr $C$DW$T$57, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7087                      .dwattr $C$DW$T$57, DW_AT_decl_line(0x54)
    7088                      .dwattr $C$DW$T$57, DW_AT_decl_column(0x02)
    7089              
    7090                      .dwendtag $C$DW$TU$57
    7091              
    7092              
    7093              $C$DW$TU$58     .dwtag  DW_TAG_type_unit
    7094                      .dwmtype  $C$DW$T$58
    7095              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    7096                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    7097                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    7098              
    7099                      .dwendtag $C$DW$TU$58
    7100              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  157

    7101              
    7102              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    7103                      .dwmtype  $C$DW$T$28
    7104              
    7105              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7106                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1e)
    7107              $C$DW$316       .dwtag  DW_TAG_member
    7108                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$24)
    7109                      .dwattr $C$DW$316, DW_AT_name("iref_A")
    7110                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7111                      .dwattr $C$DW$316, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7112                      .dwattr $C$DW$316, DW_AT_decl_line(0x78)
    7113                      .dwattr $C$DW$316, DW_AT_decl_column(0x18)
    7114              
    7115              $C$DW$317       .dwtag  DW_TAG_member
    7116                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$24)
    7117                      .dwattr $C$DW$317, DW_AT_name("vref_charge_V")
    7118                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7119                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7120                      .dwattr $C$DW$317, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7121                      .dwattr $C$DW$317, DW_AT_decl_line(0x79)
    7122                      .dwattr $C$DW$317, DW_AT_decl_column(0x18)
    7123              
    7124              $C$DW$318       .dwtag  DW_TAG_member
    7125                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$24)
    7126                      .dwattr $C$DW$318, DW_AT_name("vref_discharge_V")
    7127                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7128                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7129                      .dwattr $C$DW$318, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7130                      .dwattr $C$DW$318, DW_AT_decl_line(0x7a)
    7131                      .dwattr $C$DW$318, DW_AT_decl_column(0x18)
    7132              
    7133              $C$DW$319       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$27)
    7135                      .dwattr $C$DW$319, DW_AT_name("direction_logic")
    7136                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7137                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7138                      .dwattr $C$DW$319, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7139                      .dwattr $C$DW$319, DW_AT_decl_line(0x7b)
    7140                      .dwattr $C$DW$319, DW_AT_decl_column(0x17)
    7141              
    7142              $C$DW$320       .dwtag  DW_TAG_member
    7143                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    7144                      .dwattr $C$DW$320, DW_AT_name("enable_logic")
    7145                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7146                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7147                      .dwattr $C$DW$320, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7148                      .dwattr $C$DW$320, DW_AT_decl_line(0x7c)
    7149                      .dwattr $C$DW$320, DW_AT_decl_column(0x17)
    7150              
    7151              $C$DW$321       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$24)
    7153                      .dwattr $C$DW$321, DW_AT_name("dutyRef_pu")
    7154                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7155                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  158

    7156                      .dwattr $C$DW$321, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7157                      .dwattr $C$DW$321, DW_AT_decl_line(0x7d)
    7158                      .dwattr $C$DW$321, DW_AT_decl_column(0x18)
    7159              
    7160              $C$DW$322       .dwtag  DW_TAG_member
    7161                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$24)
    7162                      .dwattr $C$DW$322, DW_AT_name("ioutCal_pu")
    7163                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7164                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    7165                      .dwattr $C$DW$322, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7166                      .dwattr $C$DW$322, DW_AT_decl_line(0x7e)
    7167                      .dwattr $C$DW$322, DW_AT_decl_column(0x18)
    7168              
    7169              $C$DW$323       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$24)
    7171                      .dwattr $C$DW$323, DW_AT_name("voutCal_pu")
    7172                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7173                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7174                      .dwattr $C$DW$323, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7175                      .dwattr $C$DW$323, DW_AT_decl_line(0x7f)
    7176                      .dwattr $C$DW$323, DW_AT_decl_column(0x18)
    7177              
    7178              $C$DW$324       .dwtag  DW_TAG_member
    7179                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    7180                      .dwattr $C$DW$324, DW_AT_name("IoutGain_pu")
    7181                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7182                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7183                      .dwattr $C$DW$324, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7184                      .dwattr $C$DW$324, DW_AT_decl_line(0x81)
    7185                      .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    7186              
    7187              $C$DW$325       .dwtag  DW_TAG_member
    7188                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    7189                      .dwattr $C$DW$325, DW_AT_name("IoutOffset_pu")
    7190                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7191                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7192                      .dwattr $C$DW$325, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7193                      .dwattr $C$DW$325, DW_AT_decl_line(0x82)
    7194                      .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    7195              
    7196              $C$DW$326       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    7198                      .dwattr $C$DW$326, DW_AT_name("IoutGain_A")
    7199                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7200                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7201                      .dwattr $C$DW$326, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7202                      .dwattr $C$DW$326, DW_AT_decl_line(0x83)
    7203                      .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
    7204              
    7205              $C$DW$327       .dwtag  DW_TAG_member
    7206                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    7207                      .dwattr $C$DW$327, DW_AT_name("IoutOffset_A")
    7208                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7209                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7210                      .dwattr $C$DW$327, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  159

    7211                      .dwattr $C$DW$327, DW_AT_decl_line(0x84)
    7212                      .dwattr $C$DW$327, DW_AT_decl_column(0x0f)
    7213              
    7214              $C$DW$328       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    7216                      .dwattr $C$DW$328, DW_AT_name("VoutGain_pu")
    7217                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7218                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7219                      .dwattr $C$DW$328, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7220                      .dwattr $C$DW$328, DW_AT_decl_line(0x86)
    7221                      .dwattr $C$DW$328, DW_AT_decl_column(0x0f)
    7222              
    7223              $C$DW$329       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    7225                      .dwattr $C$DW$329, DW_AT_name("VoutOffset_pu")
    7226                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7227                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7228                      .dwattr $C$DW$329, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7229                      .dwattr $C$DW$329, DW_AT_decl_line(0x87)
    7230                      .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    7231              
    7232              $C$DW$330       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    7234                      .dwattr $C$DW$330, DW_AT_name("VoutGain_V")
    7235                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7236                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7237                      .dwattr $C$DW$330, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7238                      .dwattr $C$DW$330, DW_AT_decl_line(0x88)
    7239                      .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    7240              
    7241              $C$DW$331       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    7243                      .dwattr $C$DW$331, DW_AT_name("VoutOffset_V")
    7244                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7245                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7246                      .dwattr $C$DW$331, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7247                      .dwattr $C$DW$331, DW_AT_decl_line(0x89)
    7248                      .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    7249              
    7250                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7251                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x77)
    7252                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    7253                      .dwendtag $C$DW$T$28
    7254              
    7255                      .dwendtag $C$DW$TU$28
    7256              
    7257              
    7258              $C$DW$TU$60     .dwtag  DW_TAG_type_unit
    7259                      .dwmtype  $C$DW$T$60
    7260              $C$DW$T$60      .dwtag  DW_TAG_typedef
    7261                      .dwattr $C$DW$T$60, DW_AT_name("BTS_userInput")
    7262                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$28)
    7263                      .dwattr $C$DW$T$60, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7264                      .dwattr $C$DW$T$60, DW_AT_decl_line(0x8b)
    7265                      .dwattr $C$DW$T$60, DW_AT_decl_column(0x02)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  160

    7266              
    7267                      .dwendtag $C$DW$TU$60
    7268              
    7269              
    7270              $C$DW$TU$61     .dwtag  DW_TAG_type_unit
    7271                      .dwmtype  $C$DW$T$61
    7272              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    7273                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    7274                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    7275              
    7276                      .dwendtag $C$DW$TU$61
    7277              
    7278              
    7279              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
    7280                      .dwmtype  $C$DW$T$62
    7281              $C$DW$332       .dwtag  DW_TAG_TI_far_type
    7282                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$61)
    7283              
    7284              $C$DW$T$62      .dwtag  DW_TAG_const_type
    7285                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$332)
    7286              
    7287                      .dwendtag $C$DW$TU$62
    7288              
    7289              
    7290              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    7291                      .dwmtype  $C$DW$T$29
    7292              
    7293              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7294                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x24)
    7295              $C$DW$333       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    7297                      .dwattr $C$DW$333, DW_AT_name("dutySet_pu")
    7298                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7299                      .dwattr $C$DW$333, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7300                      .dwattr $C$DW$333, DW_AT_decl_line(0x97)
    7301                      .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
    7302              
    7303              $C$DW$334       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    7305                      .dwattr $C$DW$334, DW_AT_name("dutySetRef_pu")
    7306                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7307                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7308                      .dwattr $C$DW$334, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7309                      .dwattr $C$DW$334, DW_AT_decl_line(0x98)
    7310                      .dwattr $C$DW$334, DW_AT_decl_column(0x0f)
    7311              
    7312              $C$DW$335       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    7314                      .dwattr $C$DW$335, DW_AT_name("ioutRef_pu")
    7315                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7316                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7317                      .dwattr $C$DW$335, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7318                      .dwattr $C$DW$335, DW_AT_decl_line(0x9a)
    7319                      .dwattr $C$DW$335, DW_AT_decl_column(0x0f)
    7320              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  161

    7321              $C$DW$336       .dwtag  DW_TAG_member
    7322                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    7323                      .dwattr $C$DW$336, DW_AT_name("ioutSet_pu")
    7324                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7325                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7326                      .dwattr $C$DW$336, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7327                      .dwattr $C$DW$336, DW_AT_decl_line(0x9b)
    7328                      .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    7329              
    7330              $C$DW$337       .dwtag  DW_TAG_member
    7331                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    7332                      .dwattr $C$DW$337, DW_AT_name("ioutSense_pu")
    7333                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7334                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7335                      .dwattr $C$DW$337, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7336                      .dwattr $C$DW$337, DW_AT_decl_line(0x9c)
    7337                      .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    7338              
    7339              $C$DW$338       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    7341                      .dwattr $C$DW$338, DW_AT_name("voutRef_pu")
    7342                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7343                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7344                      .dwattr $C$DW$338, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7345                      .dwattr $C$DW$338, DW_AT_decl_line(0x9e)
    7346                      .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    7347              
    7348              $C$DW$339       .dwtag  DW_TAG_member
    7349                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    7350                      .dwattr $C$DW$339, DW_AT_name("voutSet_pu")
    7351                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7352                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7353                      .dwattr $C$DW$339, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7354                      .dwattr $C$DW$339, DW_AT_decl_line(0x9f)
    7355                      .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    7356              
    7357              $C$DW$340       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    7359                      .dwattr $C$DW$340, DW_AT_name("voutSense_pu")
    7360                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7361                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7362                      .dwattr $C$DW$340, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7363                      .dwattr $C$DW$340, DW_AT_decl_line(0xa0)
    7364                      .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    7365              
    7366              $C$DW$341       .dwtag  DW_TAG_member
    7367                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7368                      .dwattr $C$DW$341, DW_AT_name("uk_cc_pu")
    7369                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7370                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7371                      .dwattr $C$DW$341, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7372                      .dwattr $C$DW$341, DW_AT_decl_line(0xa2)
    7373                      .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    7374              
    7375              $C$DW$342       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  162

    7376                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    7377                      .dwattr $C$DW$342, DW_AT_name("ek_cc_pu")
    7378                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7379                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7380                      .dwattr $C$DW$342, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7381                      .dwattr $C$DW$342, DW_AT_decl_line(0xa3)
    7382                      .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    7383              
    7384              $C$DW$343       .dwtag  DW_TAG_member
    7385                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    7386                      .dwattr $C$DW$343, DW_AT_name("uk_cv_pu")
    7387                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7388                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7389                      .dwattr $C$DW$343, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7390                      .dwattr $C$DW$343, DW_AT_decl_line(0xa4)
    7391                      .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    7392              
    7393              $C$DW$344       .dwtag  DW_TAG_member
    7394                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    7395                      .dwattr $C$DW$344, DW_AT_name("ek_cv_pu")
    7396                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7397                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7398                      .dwattr $C$DW$344, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7399                      .dwattr $C$DW$344, DW_AT_decl_line(0xa5)
    7400                      .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    7401              
    7402              $C$DW$345       .dwtag  DW_TAG_member
    7403                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    7404                      .dwattr $C$DW$345, DW_AT_name("direction_coeff")
    7405                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7406                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7407                      .dwattr $C$DW$345, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7408                      .dwattr $C$DW$345, DW_AT_decl_line(0xa6)
    7409                      .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    7410              
    7411              $C$DW$346       .dwtag  DW_TAG_member
    7412                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    7413                      .dwattr $C$DW$346, DW_AT_name("dutyH_pu")
    7414                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7415                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7416                      .dwattr $C$DW$346, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7417                      .dwattr $C$DW$346, DW_AT_decl_line(0xa8)
    7418                      .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    7419              
    7420              $C$DW$347       .dwtag  DW_TAG_member
    7421                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    7422                      .dwattr $C$DW$347, DW_AT_name("dutyL_pu")
    7423                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7424                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7425                      .dwattr $C$DW$347, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7426                      .dwattr $C$DW$347, DW_AT_decl_line(0xa9)
    7427                      .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    7428              
    7429              $C$DW$348       .dwtag  DW_TAG_member
    7430                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  163

    7431                      .dwattr $C$DW$348, DW_AT_name("ctrlMode_logic")
    7432                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7433                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7434                      .dwattr $C$DW$348, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7435                      .dwattr $C$DW$348, DW_AT_decl_line(0xab)
    7436                      .dwattr $C$DW$348, DW_AT_decl_column(0x0e)
    7437              
    7438              $C$DW$349       .dwtag  DW_TAG_member
    7439                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$26)
    7440                      .dwattr $C$DW$349, DW_AT_name("direction_logic")
    7441                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7442                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7443                      .dwattr $C$DW$349, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7444                      .dwattr $C$DW$349, DW_AT_decl_line(0xac)
    7445                      .dwattr $C$DW$349, DW_AT_decl_column(0x0e)
    7446              
    7447              $C$DW$350       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    7449                      .dwattr $C$DW$350, DW_AT_name("ioutTrip_16b")
    7450                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7451                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7452                      .dwattr $C$DW$350, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7453                      .dwattr $C$DW$350, DW_AT_decl_line(0xae)
    7454                      .dwattr $C$DW$350, DW_AT_decl_column(0x0d)
    7455              
    7456              $C$DW$351       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$22)
    7458                      .dwattr $C$DW$351, DW_AT_name("ioutTrip_n_16b")
    7459                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7460                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7461                      .dwattr $C$DW$351, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7462                      .dwattr $C$DW$351, DW_AT_decl_line(0xaf)
    7463                      .dwattr $C$DW$351, DW_AT_decl_column(0x0d)
    7464              
    7465              $C$DW$352       .dwtag  DW_TAG_member
    7466                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    7467                      .dwattr $C$DW$352, DW_AT_name("tripFlag")
    7468                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7469                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7470                      .dwattr $C$DW$352, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7471                      .dwattr $C$DW$352, DW_AT_decl_line(0xb0)
    7472                      .dwattr $C$DW$352, DW_AT_decl_column(0x0e)
    7473              
    7474                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7475                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x96)
    7476                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7477                      .dwendtag $C$DW$T$29
    7478              
    7479                      .dwendtag $C$DW$TU$29
    7480              
    7481              
    7482              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    7483                      .dwmtype  $C$DW$T$65
    7484              $C$DW$T$65      .dwtag  DW_TAG_typedef
    7485                      .dwattr $C$DW$T$65, DW_AT_name("BTS_ctrlLoopVariable")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  164

    7486                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$29)
    7487                      .dwattr $C$DW$T$65, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7488                      .dwattr $C$DW$T$65, DW_AT_decl_line(0xb2)
    7489                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x02)
    7490              
    7491                      .dwendtag $C$DW$TU$65
    7492              
    7493              
    7494              $C$DW$TU$66     .dwtag  DW_TAG_type_unit
    7495                      .dwmtype  $C$DW$T$66
    7496              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    7497                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    7498                      .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    7499              
    7500                      .dwendtag $C$DW$TU$66
    7501              
    7502              
    7503              $C$DW$TU$67     .dwtag  DW_TAG_type_unit
    7504                      .dwmtype  $C$DW$T$67
    7505              $C$DW$353       .dwtag  DW_TAG_TI_far_type
    7506                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$66)
    7507              
    7508              $C$DW$T$67      .dwtag  DW_TAG_const_type
    7509                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$353)
    7510              
    7511                      .dwendtag $C$DW$TU$67
    7512              
    7513              
    7514              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    7515                      .dwmtype  $C$DW$T$33
    7516              
    7517              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7518                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x52)
    7519              $C$DW$354       .dwtag  DW_TAG_member
    7520                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    7521                      .dwattr $C$DW$354, DW_AT_name("Isense_A")
    7522                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7523                      .dwattr $C$DW$354, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7524                      .dwattr $C$DW$354, DW_AT_decl_line(0x5f)
    7525                      .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    7526              
    7527              $C$DW$355       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    7529                      .dwattr $C$DW$355, DW_AT_name("Vsense_V")
    7530                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7531                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7532                      .dwattr $C$DW$355, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7533                      .dwattr $C$DW$355, DW_AT_decl_line(0x60)
    7534                      .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    7535              
    7536              $C$DW$356       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$30)
    7538                      .dwattr $C$DW$356, DW_AT_name("Isense_16b")
    7539                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7540                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  165

    7541                      .dwattr $C$DW$356, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7542                      .dwattr $C$DW$356, DW_AT_decl_line(0x61)
    7543                      .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    7544              
    7545              $C$DW$357       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    7547                      .dwattr $C$DW$357, DW_AT_name("Vsense_16b")
    7548                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7549                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7550                      .dwattr $C$DW$357, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7551                      .dwattr $C$DW$357, DW_AT_decl_line(0x62)
    7552                      .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    7553              
    7554              $C$DW$358       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$32)
    7556                      .dwattr $C$DW$358, DW_AT_name("Sum_I")
    7557                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7558                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7559                      .dwattr $C$DW$358, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7560                      .dwattr $C$DW$358, DW_AT_decl_line(0x63)
    7561                      .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    7562              
    7563              $C$DW$359       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$32)
    7565                      .dwattr $C$DW$359, DW_AT_name("Sum_V")
    7566                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7567                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7568                      .dwattr $C$DW$359, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7569                      .dwattr $C$DW$359, DW_AT_decl_line(0x64)
    7570                      .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    7571              
    7572              $C$DW$360       .dwtag  DW_TAG_member
    7573                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$26)
    7574                      .dwattr $C$DW$360, DW_AT_name("Index")
    7575                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7576                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7577                      .dwattr $C$DW$360, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7578                      .dwattr $C$DW$360, DW_AT_decl_line(0x65)
    7579                      .dwattr $C$DW$360, DW_AT_decl_column(0x0e)
    7580              
    7581              $C$DW$361       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    7583                      .dwattr $C$DW$361, DW_AT_name("IoutGain_A")
    7584                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7585                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7586                      .dwattr $C$DW$361, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7587                      .dwattr $C$DW$361, DW_AT_decl_line(0x66)
    7588                      .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    7589              
    7590              $C$DW$362       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    7592                      .dwattr $C$DW$362, DW_AT_name("IoutOffset_A")
    7593                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7594                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7595                      .dwattr $C$DW$362, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  166

    7596                      .dwattr $C$DW$362, DW_AT_decl_line(0x67)
    7597                      .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
    7598              
    7599              $C$DW$363       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    7601                      .dwattr $C$DW$363, DW_AT_name("VoutGain_V")
    7602                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7603                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7604                      .dwattr $C$DW$363, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7605                      .dwattr $C$DW$363, DW_AT_decl_line(0x68)
    7606                      .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    7607              
    7608              $C$DW$364       .dwtag  DW_TAG_member
    7609                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    7610                      .dwattr $C$DW$364, DW_AT_name("VoutOffset_V")
    7611                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7612                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7613                      .dwattr $C$DW$364, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7614                      .dwattr $C$DW$364, DW_AT_decl_line(0x69)
    7615                      .dwattr $C$DW$364, DW_AT_decl_column(0x0f)
    7616              
    7617                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7618                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x5e)
    7619                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7620                      .dwendtag $C$DW$T$33
    7621              
    7622                      .dwendtag $C$DW$TU$33
    7623              
    7624              
    7625              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    7626                      .dwmtype  $C$DW$T$70
    7627              $C$DW$T$70      .dwtag  DW_TAG_typedef
    7628                      .dwattr $C$DW$T$70, DW_AT_name("BTS_measValues")
    7629                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$33)
    7630                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7631                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x6b)
    7632                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    7633              
    7634                      .dwendtag $C$DW$TU$70
    7635              
    7636              
    7637              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    7638                      .dwmtype  $C$DW$T$71
    7639              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7640                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    7641                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    7642              
    7643                      .dwendtag $C$DW$TU$71
    7644              
    7645              
    7646              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    7647                      .dwmtype  $C$DW$T$72
    7648              $C$DW$365       .dwtag  DW_TAG_TI_far_type
    7649                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$71)
    7650              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  167

    7651              $C$DW$T$72      .dwtag  DW_TAG_const_type
    7652                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$365)
    7653              
    7654                      .dwendtag $C$DW$TU$72
    7655              
    7656              
    7657              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    7658                      .dwmtype  $C$DW$T$35
    7659              
    7660              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7661                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x406)
    7662              $C$DW$366       .dwtag  DW_TAG_member
    7663                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$34)
    7664                      .dwattr $C$DW$366, DW_AT_name("plantMagVect")
    7665                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7666                      .dwattr $C$DW$366, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7667                      .dwattr $C$DW$366, DW_AT_decl_line(0x149)
    7668                      .dwattr $C$DW$366, DW_AT_decl_column(0x14)
    7669              
    7670              $C$DW$367       .dwtag  DW_TAG_member
    7671                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$34)
    7672                      .dwattr $C$DW$367, DW_AT_name("plantPhaseVect")
    7673                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7674                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7675                      .dwattr $C$DW$367, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7676                      .dwattr $C$DW$367, DW_AT_decl_line(0x14a)
    7677                      .dwattr $C$DW$367, DW_AT_decl_column(0x14)
    7678              
    7679              $C$DW$368       .dwtag  DW_TAG_member
    7680                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$34)
    7681                      .dwattr $C$DW$368, DW_AT_name("olMagVect")
    7682                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x19c]
    7683                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7684                      .dwattr $C$DW$368, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7685                      .dwattr $C$DW$368, DW_AT_decl_line(0x14b)
    7686                      .dwattr $C$DW$368, DW_AT_decl_column(0x14)
    7687              
    7688              $C$DW$369       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$34)
    7690                      .dwattr $C$DW$369, DW_AT_name("olPhaseVect")
    7691                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x26a]
    7692                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7693                      .dwattr $C$DW$369, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7694                      .dwattr $C$DW$369, DW_AT_decl_line(0x14c)
    7695                      .dwattr $C$DW$369, DW_AT_decl_column(0x14)
    7696              
    7697              $C$DW$370       .dwtag  DW_TAG_member
    7698                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$34)
    7699                      .dwattr $C$DW$370, DW_AT_name("freqVect")
    7700                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x338]
    7701                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7702                      .dwattr $C$DW$370, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7703                      .dwattr $C$DW$370, DW_AT_decl_line(0x14d)
    7704                      .dwattr $C$DW$370, DW_AT_decl_column(0x14)
    7705              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  168

    7706                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7707                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x148)
    7708                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x14)
    7709                      .dwendtag $C$DW$T$35
    7710              
    7711                      .dwendtag $C$DW$TU$35
    7712              
    7713              
    7714              $C$DW$TU$75     .dwtag  DW_TAG_type_unit
    7715                      .dwmtype  $C$DW$T$75
    7716              $C$DW$T$75      .dwtag  DW_TAG_typedef
    7717                      .dwattr $C$DW$T$75, DW_AT_name("BTS_SfraDataType")
    7718                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$35)
    7719                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7720                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x14e)
    7721                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x07)
    7722              
    7723                      .dwendtag $C$DW$TU$75
    7724              
    7725              
    7726              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    7727                      .dwmtype  $C$DW$T$41
    7728              
    7729              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7730                      .dwattr $C$DW$T$41, DW_AT_name("I2CHandle")
    7731                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    7732              $C$DW$371       .dwtag  DW_TAG_member
    7733                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$37)
    7734                      .dwattr $C$DW$371, DW_AT_name("base")
    7735                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7736                      .dwattr $C$DW$371, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7737                      .dwattr $C$DW$371, DW_AT_decl_line(0x48)
    7738                      .dwattr $C$DW$371, DW_AT_decl_column(0x0e)
    7739              
    7740              $C$DW$372       .dwtag  DW_TAG_member
    7741                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    7742                      .dwattr $C$DW$372, DW_AT_name("SlaveAddr")
    7743                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7744                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7745                      .dwattr $C$DW$372, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7746                      .dwattr $C$DW$372, DW_AT_decl_line(0x49)
    7747                      .dwattr $C$DW$372, DW_AT_decl_column(0x0e)
    7748              
    7749              $C$DW$373       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$38)
    7751                      .dwattr $C$DW$373, DW_AT_name("pControlAddr")
    7752                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7753                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7754                      .dwattr $C$DW$373, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7755                      .dwattr $C$DW$373, DW_AT_decl_line(0x4a)
    7756                      .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    7757              
    7758              $C$DW$374       .dwtag  DW_TAG_member
    7759                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    7760                      .dwattr $C$DW$374, DW_AT_name("NumOfAddrBytes")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  169

    7761                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7762                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7763                      .dwattr $C$DW$374, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7764                      .dwattr $C$DW$374, DW_AT_decl_line(0x4b)
    7765                      .dwattr $C$DW$374, DW_AT_decl_column(0x0e)
    7766              
    7767              $C$DW$375       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$39)
    7769                      .dwattr $C$DW$375, DW_AT_name("pTX_MsgBuffer")
    7770                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7771                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7772                      .dwattr $C$DW$375, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7773                      .dwattr $C$DW$375, DW_AT_decl_line(0x4c)
    7774                      .dwattr $C$DW$375, DW_AT_decl_column(0x0f)
    7775              
    7776              $C$DW$376       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$39)
    7778                      .dwattr $C$DW$376, DW_AT_name("pRX_MsgBuffer")
    7779                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7780                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7781                      .dwattr $C$DW$376, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7782                      .dwattr $C$DW$376, DW_AT_decl_line(0x4d)
    7783                      .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    7784              
    7785              $C$DW$377       .dwtag  DW_TAG_member
    7786                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$26)
    7787                      .dwattr $C$DW$377, DW_AT_name("NumOfDataBytes")
    7788                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7789                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7790                      .dwattr $C$DW$377, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7791                      .dwattr $C$DW$377, DW_AT_decl_line(0x4e)
    7792                      .dwattr $C$DW$377, DW_AT_decl_column(0x0e)
    7793              
    7794              $C$DW$378       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$40)
    7796                      .dwattr $C$DW$378, DW_AT_name("currentHandlePtr")
    7797                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7798                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7799                      .dwattr $C$DW$378, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7800                      .dwattr $C$DW$378, DW_AT_decl_line(0x4f)
    7801                      .dwattr $C$DW$378, DW_AT_decl_column(0x17)
    7802              
    7803              $C$DW$379       .dwtag  DW_TAG_member
    7804                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    7805                      .dwattr $C$DW$379, DW_AT_name("numofSixteenByte")
    7806                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7807                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7808                      .dwattr $C$DW$379, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7809                      .dwattr $C$DW$379, DW_AT_decl_line(0x51)
    7810                      .dwattr $C$DW$379, DW_AT_decl_column(0x0e)
    7811              
    7812              $C$DW$380       .dwtag  DW_TAG_member
    7813                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$26)
    7814                      .dwattr $C$DW$380, DW_AT_name("remainingBytes")
    7815                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  170

    7816                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7817                      .dwattr $C$DW$380, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7818                      .dwattr $C$DW$380, DW_AT_decl_line(0x52)
    7819                      .dwattr $C$DW$380, DW_AT_decl_column(0x0e)
    7820              
    7821                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7822                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x46)
    7823                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
    7824                      .dwendtag $C$DW$T$41
    7825              
    7826                      .dwendtag $C$DW$TU$41
    7827              
    7828              
    7829              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    7830                      .dwmtype  $C$DW$T$40
    7831              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7832                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$41)
    7833                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    7834              
    7835                      .dwendtag $C$DW$TU$40
    7836              
    7837              
    7838              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    7839                      .dwmtype  $C$DW$T$43
    7840              
    7841              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7842                      .dwattr $C$DW$T$43, DW_AT_name("_Complex_double")
    7843                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    7844              $C$DW$381       .dwtag  DW_TAG_member
    7845                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$42)
    7846                      .dwattr $C$DW$381, DW_AT_name("_Vals")
    7847                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7848                      .dwattr $C$DW$381, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7849                      .dwattr $C$DW$381, DW_AT_decl_line(0xe9)
    7850                      .dwattr $C$DW$381, DW_AT_decl_column(0x18)
    7851              
    7852                      .dwendtag $C$DW$T$43
    7853              
    7854                      .dwendtag $C$DW$TU$43
    7855              
    7856              
    7857              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    7858                      .dwmtype  $C$DW$T$77
    7859              $C$DW$T$77      .dwtag  DW_TAG_typedef
    7860                      .dwattr $C$DW$T$77, DW_AT_name("_Complex_double")
    7861                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$43)
    7862                      .dwattr $C$DW$T$77, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7863                      .dwattr $C$DW$T$77, DW_AT_decl_line(0xe9)
    7864                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
    7865              
    7866                      .dwendtag $C$DW$TU$77
    7867              
    7868              
    7869              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    7870                      .dwmtype  $C$DW$T$45
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  171

    7871              
    7872              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7873                      .dwattr $C$DW$T$45, DW_AT_name("_Complex_float")
    7874                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    7875              $C$DW$382       .dwtag  DW_TAG_member
    7876                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$44)
    7877                      .dwattr $C$DW$382, DW_AT_name("_Vals")
    7878                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7879                      .dwattr $C$DW$382, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7880                      .dwattr $C$DW$382, DW_AT_decl_line(0xe9)
    7881                      .dwattr $C$DW$382, DW_AT_decl_column(0x18)
    7882              
    7883                      .dwendtag $C$DW$T$45
    7884              
    7885                      .dwendtag $C$DW$TU$45
    7886              
    7887              
    7888              $C$DW$TU$78     .dwtag  DW_TAG_type_unit
    7889                      .dwmtype  $C$DW$T$78
    7890              $C$DW$T$78      .dwtag  DW_TAG_typedef
    7891                      .dwattr $C$DW$T$78, DW_AT_name("_Complex_float")
    7892                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$45)
    7893                      .dwattr $C$DW$T$78, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7894                      .dwattr $C$DW$T$78, DW_AT_decl_line(0xe9)
    7895                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
    7896              
    7897                      .dwendtag $C$DW$TU$78
    7898              
    7899              
    7900              $C$DW$TU$47     .dwtag  DW_TAG_type_unit
    7901                      .dwmtype  $C$DW$T$47
    7902              
    7903              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7904                      .dwattr $C$DW$T$47, DW_AT_name("_Complex_long_double")
    7905                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    7906              $C$DW$383       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$46)
    7908                      .dwattr $C$DW$383, DW_AT_name("_Vals")
    7909                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7910                      .dwattr $C$DW$383, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    7911                      .dwattr $C$DW$383, DW_AT_decl_line(0xe9)
    7912                      .dwattr $C$DW$383, DW_AT_decl_column(0x18)
    7913              
    7914                      .dwendtag $C$DW$T$47
    7915              
    7916                      .dwendtag $C$DW$TU$47
    7917              
    7918              
    7919              $C$DW$TU$80     .dwtag  DW_TAG_type_unit
    7920                      .dwmtype  $C$DW$T$80
    7921              $C$DW$T$80      .dwtag  DW_TAG_typedef
    7922                      .dwattr $C$DW$T$80, DW_AT_name("_Complex_long_double")
    7923                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$47)
    7924                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    7925                      .dwattr $C$DW$T$80, DW_AT_decl_line(0xe9)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  172

    7926                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x18)
    7927              
    7928                      .dwendtag $C$DW$TU$80
    7929              
    7930              
    7931              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    7932                      .dwmtype  $C$DW$T$2
    7933              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7934                      .dwattr $C$DW$T$2, DW_AT_name("void")
    7935              
    7936                      .dwendtag $C$DW$TU$2
    7937              
    7938              
    7939              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    7940                      .dwmtype  $C$DW$T$4
    7941              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7942                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7943                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7944                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7945              
    7946                      .dwendtag $C$DW$TU$4
    7947              
    7948              
    7949              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    7950                      .dwmtype  $C$DW$T$5
    7951              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7952                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7953                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7954                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7955              
    7956                      .dwendtag $C$DW$TU$5
    7957              
    7958              
    7959              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    7960                      .dwmtype  $C$DW$T$6
    7961              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7962                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7963                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7964                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7965              
    7966                      .dwendtag $C$DW$TU$6
    7967              
    7968              
    7969              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    7970                      .dwmtype  $C$DW$T$7
    7971              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7972                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7973                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7974                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    7975              
    7976                      .dwendtag $C$DW$TU$7
    7977              
    7978              
    7979              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    7980                      .dwmtype  $C$DW$T$8
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  173

    7981              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7982                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7983                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7984                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7985              
    7986                      .dwendtag $C$DW$TU$8
    7987              
    7988              
    7989              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    7990                      .dwmtype  $C$DW$T$9
    7991              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7992                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7993                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7994                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7995              
    7996                      .dwendtag $C$DW$TU$9
    7997              
    7998              
    7999              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    8000                      .dwmtype  $C$DW$T$10
    8001              $C$DW$T$10      .dwtag  DW_TAG_base_type
    8002                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    8003                      .dwattr $C$DW$T$10, DW_AT_name("int")
    8004                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    8005              
    8006                      .dwendtag $C$DW$TU$10
    8007              
    8008              
    8009              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    8010                      .dwmtype  $C$DW$T$21
    8011              $C$DW$T$21      .dwtag  DW_TAG_typedef
    8012                      .dwattr $C$DW$T$21, DW_AT_name("__int16_t")
    8013                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
    8014                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8015                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x40)
    8016                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x1d)
    8017              
    8018                      .dwendtag $C$DW$TU$21
    8019              
    8020              
    8021              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    8022                      .dwmtype  $C$DW$T$22
    8023              $C$DW$T$22      .dwtag  DW_TAG_typedef
    8024                      .dwattr $C$DW$T$22, DW_AT_name("int16_t")
    8025                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    8026                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8027                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
    8028                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x14)
    8029              
    8030                      .dwendtag $C$DW$TU$22
    8031              
    8032              
    8033              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    8034                      .dwmtype  $C$DW$T$30
    8035              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  174

    8036              $C$DW$T$30      .dwtag  DW_TAG_array_type
    8037                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$22)
    8038                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x20)
    8039              $C$DW$384       .dwtag  DW_TAG_subrange_type
    8040                      .dwattr $C$DW$384, DW_AT_upper_bound(0x1f)
    8041              
    8042                      .dwendtag $C$DW$T$30
    8043              
    8044                      .dwendtag $C$DW$TU$30
    8045              
    8046              
    8047              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
    8048                      .dwmtype  $C$DW$T$11
    8049              $C$DW$T$11      .dwtag  DW_TAG_base_type
    8050                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    8051                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    8052                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    8053              
    8054                      .dwendtag $C$DW$TU$11
    8055              
    8056              
    8057              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    8058                      .dwmtype  $C$DW$T$25
    8059              $C$DW$T$25      .dwtag  DW_TAG_typedef
    8060                      .dwattr $C$DW$T$25, DW_AT_name("__uint16_t")
    8061                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
    8062                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8063                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x41)
    8064                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1c)
    8065              
    8066                      .dwendtag $C$DW$TU$25
    8067              
    8068              
    8069              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    8070                      .dwmtype  $C$DW$T$26
    8071              $C$DW$T$26      .dwtag  DW_TAG_typedef
    8072                      .dwattr $C$DW$T$26, DW_AT_name("uint16_t")
    8073                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    8074                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8075                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x41)
    8076                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x15)
    8077              
    8078                      .dwendtag $C$DW$TU$26
    8079              
    8080              
    8081              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    8082                      .dwmtype  $C$DW$T$39
    8083              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    8084                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$26)
    8085                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    8086              
    8087                      .dwendtag $C$DW$TU$39
    8088              
    8089              
    8090              $C$DW$TU$109    .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  175

    8091                      .dwmtype  $C$DW$T$109
    8092              
    8093              $C$DW$T$109     .dwtag  DW_TAG_array_type
    8094                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$26)
    8095                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x14)
    8096              $C$DW$385       .dwtag  DW_TAG_subrange_type
    8097                      .dwattr $C$DW$385, DW_AT_upper_bound(0x13)
    8098              
    8099                      .dwendtag $C$DW$T$109
    8100              
    8101                      .dwendtag $C$DW$TU$109
    8102              
    8103              
    8104              $C$DW$TU$110    .dwtag  DW_TAG_type_unit
    8105                      .dwmtype  $C$DW$T$110
    8106              
    8107              $C$DW$T$110     .dwtag  DW_TAG_array_type
    8108                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$26)
    8109                      .dwattr $C$DW$T$110, DW_AT_byte_size(0x40)
    8110              $C$DW$386       .dwtag  DW_TAG_subrange_type
    8111                      .dwattr $C$DW$386, DW_AT_upper_bound(0x3f)
    8112              
    8113                      .dwendtag $C$DW$T$110
    8114              
    8115                      .dwendtag $C$DW$TU$110
    8116              
    8117              
    8118              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    8119                      .dwmtype  $C$DW$T$27
    8120              $C$DW$387       .dwtag  DW_TAG_TI_far_type
    8121                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$26)
    8122              
    8123              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    8124                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$387)
    8125              
    8126                      .dwendtag $C$DW$TU$27
    8127              
    8128              
    8129              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    8130                      .dwmtype  $C$DW$T$12
    8131              $C$DW$T$12      .dwtag  DW_TAG_base_type
    8132                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    8133                      .dwattr $C$DW$T$12, DW_AT_name("long")
    8134                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    8135              
    8136                      .dwendtag $C$DW$TU$12
    8137              
    8138              
    8139              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    8140                      .dwmtype  $C$DW$T$31
    8141              $C$DW$T$31      .dwtag  DW_TAG_typedef
    8142                      .dwattr $C$DW$T$31, DW_AT_name("__int32_t")
    8143                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$12)
    8144                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8145                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x42)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  176

    8146                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x1d)
    8147              
    8148                      .dwendtag $C$DW$TU$31
    8149              
    8150              
    8151              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    8152                      .dwmtype  $C$DW$T$32
    8153              $C$DW$T$32      .dwtag  DW_TAG_typedef
    8154                      .dwattr $C$DW$T$32, DW_AT_name("int32_t")
    8155                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    8156                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8157                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x30)
    8158                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x14)
    8159              
    8160                      .dwendtag $C$DW$TU$32
    8161              
    8162              
    8163              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    8164                      .dwmtype  $C$DW$T$13
    8165              $C$DW$T$13      .dwtag  DW_TAG_base_type
    8166                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    8167                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    8168                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    8169              
    8170                      .dwendtag $C$DW$TU$13
    8171              
    8172              
    8173              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    8174                      .dwmtype  $C$DW$T$36
    8175              $C$DW$T$36      .dwtag  DW_TAG_typedef
    8176                      .dwattr $C$DW$T$36, DW_AT_name("__uint32_t")
    8177                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$13)
    8178                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8179                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x43)
    8180                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x1c)
    8181              
    8182                      .dwendtag $C$DW$TU$36
    8183              
    8184              
    8185              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    8186                      .dwmtype  $C$DW$T$37
    8187              $C$DW$T$37      .dwtag  DW_TAG_typedef
    8188                      .dwattr $C$DW$T$37, DW_AT_name("uint32_t")
    8189                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    8190                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    8191                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x46)
    8192                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x15)
    8193              
    8194                      .dwendtag $C$DW$TU$37
    8195              
    8196              
    8197              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    8198                      .dwmtype  $C$DW$T$38
    8199              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    8200                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:45 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  177

    8201                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    8202              
    8203                      .dwendtag $C$DW$TU$38
    8204              
    8205              
    8206              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    8207                      .dwmtype  $C$DW$T$92
    8208              $C$DW$388       .dwtag  DW_TAG_TI_far_type
    8209                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$37)
    8210              
    8211              $C$DW$T$92      .dwtag  DW_TAG_volatile_type
