TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Mon Jan 11 05:48:46 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13                      .global ||BUCK_sfoStatus||
      14 00000000               .bss    ||BUCK_sfoStatus||,1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("BUCK_sfoStatus")

    4097                      .group    "__isinff", 1
    4098                      .gmember  ".text:__isinff"
    4099                      .endgroup
    4100                      .group    "__isinfl", 1
    4101                      .gmember  ".text:__isinfl"
    4102                      .endgroup
    4103                      .group    "__isnan", 1
    4104                      .gmember  ".text:__isnan"
    4105                      .endgroup
    4106                      .group    "__isnanf", 1
    4107                      .gmember  ".text:__isnanf"
    4108                      .endgroup
    4109                      .group    "__isnanl", 1
    4110                      .gmember  ".text:__isnanl"
    4111                      .endgroup
    4112                      .group    "__isnormal", 1
    4113                      .gmember  ".text:__isnormal"
    4114                      .endgroup
    4115                      .group    "__isnormalf", 1
    4116                      .gmember  ".text:__isnormalf"
    4117                      .endgroup
    4118                      .group    "__isnormall", 1
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   90

    4119                      .gmember  ".text:__isnormall"
    4120                      .endgroup
    4121                      .group    "__relaxed_atan2f", 1
    4122                      .gmember  ".text:__relaxed_atan2f"
    4123                      .endgroup
    4124                      .group    "__relaxed_atanf", 1
    4125                      .gmember  ".text:__relaxed_atanf"
    4126                      .endgroup
    4127                      .group    "__relaxed_cosf", 1
    4128                      .gmember  ".text:__relaxed_cosf"
    4129                      .endgroup
    4130                      .group    "__relaxed_sinf", 1
    4131                      .gmember  ".text:__relaxed_sinf"
    4132                      .endgroup
    4133                      .group    "__relaxed_sqrtf", 1
    4134                      .gmember  ".text:__relaxed_sqrtf"
    4135                      .endgroup
    4136                      .group    "__signbit", 1
    4137                      .gmember  ".text:__signbit"
    4138                      .endgroup
    4139                      .group    "__signbitf", 1
    4140                      .gmember  ".text:__signbitf"
    4141                      .endgroup
    4142                      .group    "__signbitl", 1
    4143                      .gmember  ".text:__signbitl"
    4144                      .endgroup
    4145              
    4146              
    4147              ;***************************************************************
    4148              ;* BUILD ATTRIBUTES                                            *
    4149              ;***************************************************************
    4150                      .battr "c28xabi", Tag_File, 1, Tag_float_args(1)
    4151                      .battr "c28xabi", Tag_File, 1, Tag_double_args(1)
    4152                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4153              
    4154              ;***************************************************************
    4155              ;* DWARF CIE ENTRIES                                           *
    4156              ;***************************************************************
    4157              
    4158              $C$DW$CIE       .dwcie 26
    4159                      .dwcfi  cfa_register, 20
    4160                      .dwcfi  cfa_offset, 0
    4161                      .dwcfi  same_value, 28
    4162                      .dwcfi  same_value, 6
    4163                      .dwcfi  same_value, 7
    4164                      .dwcfi  same_value, 8
    4165                      .dwcfi  same_value, 9
    4166                      .dwcfi  same_value, 10
    4167                      .dwcfi  same_value, 11
    4168                      .dwcfi  same_value, 59
    4169                      .dwcfi  same_value, 63
    4170                      .dwcfi  same_value, 67
    4171                      .dwcfi  same_value, 71
    4172                      .dwendentry
    4173                      .dwendtag $C$DW$CU
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   91

    4174              
    4175              
    4176              ;***************************************************************
    4177              ;* TYPE INFORMATION                                            *
    4178              ;***************************************************************
    4179              
    4180              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    4181                      .dwmtype  $C$DW$T$24
    4182              
    4183              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4184                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1e)
    4185              $C$DW$166       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    4187                      .dwattr $C$DW$166, DW_AT_name("iref_A")
    4188                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwattr $C$DW$166, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4190                      .dwattr $C$DW$166, DW_AT_decl_line(0x74)
    4191                      .dwattr $C$DW$166, DW_AT_decl_column(0x18)
    4192              
    4193              $C$DW$167       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    4195                      .dwattr $C$DW$167, DW_AT_name("vref_charge_V")
    4196                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4197                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4198                      .dwattr $C$DW$167, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4199                      .dwattr $C$DW$167, DW_AT_decl_line(0x75)
    4200                      .dwattr $C$DW$167, DW_AT_decl_column(0x18)
    4201              
    4202              $C$DW$168       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    4204                      .dwattr $C$DW$168, DW_AT_name("vref_discharge_V")
    4205                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4206                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4207                      .dwattr $C$DW$168, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4208                      .dwattr $C$DW$168, DW_AT_decl_line(0x76)
    4209                      .dwattr $C$DW$168, DW_AT_decl_column(0x18)
    4210              
    4211              $C$DW$169       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    4213                      .dwattr $C$DW$169, DW_AT_name("direction_logic")
    4214                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4215                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4216                      .dwattr $C$DW$169, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4217                      .dwattr $C$DW$169, DW_AT_decl_line(0x77)
    4218                      .dwattr $C$DW$169, DW_AT_decl_column(0x17)
    4219              
    4220              $C$DW$170       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    4222                      .dwattr $C$DW$170, DW_AT_name("enable_logic")
    4223                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4224                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4225                      .dwattr $C$DW$170, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4226                      .dwattr $C$DW$170, DW_AT_decl_line(0x78)
    4227                      .dwattr $C$DW$170, DW_AT_decl_column(0x17)
    4228              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   92

    4229              $C$DW$171       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    4231                      .dwattr $C$DW$171, DW_AT_name("dutyRef_pu")
    4232                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4233                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4234                      .dwattr $C$DW$171, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4235                      .dwattr $C$DW$171, DW_AT_decl_line(0x79)
    4236                      .dwattr $C$DW$171, DW_AT_decl_column(0x18)
    4237              
    4238              $C$DW$172       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    4240                      .dwattr $C$DW$172, DW_AT_name("ioutCal_pu")
    4241                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4242                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4243                      .dwattr $C$DW$172, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4244                      .dwattr $C$DW$172, DW_AT_decl_line(0x7a)
    4245                      .dwattr $C$DW$172, DW_AT_decl_column(0x18)
    4246              
    4247              $C$DW$173       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    4249                      .dwattr $C$DW$173, DW_AT_name("voutCal_pu")
    4250                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4251                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4252                      .dwattr $C$DW$173, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4253                      .dwattr $C$DW$173, DW_AT_decl_line(0x7b)
    4254                      .dwattr $C$DW$173, DW_AT_decl_column(0x18)
    4255              
    4256              $C$DW$174       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    4258                      .dwattr $C$DW$174, DW_AT_name("IoutGain_pu")
    4259                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4260                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4261                      .dwattr $C$DW$174, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4262                      .dwattr $C$DW$174, DW_AT_decl_line(0x7d)
    4263                      .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    4264              
    4265              $C$DW$175       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    4267                      .dwattr $C$DW$175, DW_AT_name("IoutOffset_pu")
    4268                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4269                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4270                      .dwattr $C$DW$175, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4271                      .dwattr $C$DW$175, DW_AT_decl_line(0x7e)
    4272                      .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    4273              
    4274              $C$DW$176       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    4276                      .dwattr $C$DW$176, DW_AT_name("IoutGain_A")
    4277                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4278                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4279                      .dwattr $C$DW$176, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4280                      .dwattr $C$DW$176, DW_AT_decl_line(0x7f)
    4281                      .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    4282              
    4283              $C$DW$177       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   93

    4284                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    4285                      .dwattr $C$DW$177, DW_AT_name("IoutOffset_A")
    4286                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4287                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4288                      .dwattr $C$DW$177, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4289                      .dwattr $C$DW$177, DW_AT_decl_line(0x80)
    4290                      .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    4291              
    4292              $C$DW$178       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    4294                      .dwattr $C$DW$178, DW_AT_name("VoutGain_pu")
    4295                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4296                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    4297                      .dwattr $C$DW$178, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4298                      .dwattr $C$DW$178, DW_AT_decl_line(0x82)
    4299                      .dwattr $C$DW$178, DW_AT_decl_column(0x0f)
    4300              
    4301              $C$DW$179       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    4303                      .dwattr $C$DW$179, DW_AT_name("VoutOffset_pu")
    4304                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4305                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    4306                      .dwattr $C$DW$179, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4307                      .dwattr $C$DW$179, DW_AT_decl_line(0x83)
    4308                      .dwattr $C$DW$179, DW_AT_decl_column(0x0f)
    4309              
    4310              $C$DW$180       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    4312                      .dwattr $C$DW$180, DW_AT_name("VoutGain_V")
    4313                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4314                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4315                      .dwattr $C$DW$180, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4316                      .dwattr $C$DW$180, DW_AT_decl_line(0x84)
    4317                      .dwattr $C$DW$180, DW_AT_decl_column(0x0f)
    4318              
    4319              $C$DW$181       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    4321                      .dwattr $C$DW$181, DW_AT_name("VoutOffset_V")
    4322                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4323                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4324                      .dwattr $C$DW$181, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4325                      .dwattr $C$DW$181, DW_AT_decl_line(0x85)
    4326                      .dwattr $C$DW$181, DW_AT_decl_column(0x0f)
    4327              
    4328                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4329                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x73)
    4330                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    4331                      .dwendtag $C$DW$T$24
    4332              
    4333                      .dwendtag $C$DW$TU$24
    4334              
    4335              
    4336              $C$DW$TU$49     .dwtag  DW_TAG_type_unit
    4337                      .dwmtype  $C$DW$T$49
    4338              $C$DW$T$49      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   94

    4339                      .dwattr $C$DW$T$49, DW_AT_name("BTS_userInput")
    4340                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$24)
    4341                      .dwattr $C$DW$T$49, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4342                      .dwattr $C$DW$T$49, DW_AT_decl_line(0x87)
    4343                      .dwattr $C$DW$T$49, DW_AT_decl_column(0x02)
    4344              
    4345                      .dwendtag $C$DW$TU$49
    4346              
    4347              
    4348              $C$DW$TU$50     .dwtag  DW_TAG_type_unit
    4349                      .dwmtype  $C$DW$T$50
    4350              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    4351                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    4352                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    4353              
    4354                      .dwendtag $C$DW$TU$50
    4355              
    4356              
    4357              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    4358                      .dwmtype  $C$DW$T$51
    4359              $C$DW$182       .dwtag  DW_TAG_TI_far_type
    4360                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$50)
    4361              
    4362              $C$DW$T$51      .dwtag  DW_TAG_const_type
    4363                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$182)
    4364              
    4365                      .dwendtag $C$DW$TU$51
    4366              
    4367              
    4368              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    4369                      .dwmtype  $C$DW$T$27
    4370              
    4371              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4372                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x24)
    4373              $C$DW$183       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    4375                      .dwattr $C$DW$183, DW_AT_name("dutySet_pu")
    4376                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4377                      .dwattr $C$DW$183, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4378                      .dwattr $C$DW$183, DW_AT_decl_line(0x90)
    4379                      .dwattr $C$DW$183, DW_AT_decl_column(0x0f)
    4380              
    4381              $C$DW$184       .dwtag  DW_TAG_member
    4382                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    4383                      .dwattr $C$DW$184, DW_AT_name("dutySetRef_pu")
    4384                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4385                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4386                      .dwattr $C$DW$184, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4387                      .dwattr $C$DW$184, DW_AT_decl_line(0x91)
    4388                      .dwattr $C$DW$184, DW_AT_decl_column(0x0f)
    4389              
    4390              $C$DW$185       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    4392                      .dwattr $C$DW$185, DW_AT_name("ioutRef_pu")
    4393                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   95

    4394                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4395                      .dwattr $C$DW$185, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4396                      .dwattr $C$DW$185, DW_AT_decl_line(0x93)
    4397                      .dwattr $C$DW$185, DW_AT_decl_column(0x0f)
    4398              
    4399              $C$DW$186       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    4401                      .dwattr $C$DW$186, DW_AT_name("ioutSet_pu")
    4402                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4403                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4404                      .dwattr $C$DW$186, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4405                      .dwattr $C$DW$186, DW_AT_decl_line(0x94)
    4406                      .dwattr $C$DW$186, DW_AT_decl_column(0x0f)
    4407              
    4408              $C$DW$187       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    4410                      .dwattr $C$DW$187, DW_AT_name("ioutSense_pu")
    4411                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4412                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4413                      .dwattr $C$DW$187, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4414                      .dwattr $C$DW$187, DW_AT_decl_line(0x95)
    4415                      .dwattr $C$DW$187, DW_AT_decl_column(0x0f)
    4416              
    4417              $C$DW$188       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    4419                      .dwattr $C$DW$188, DW_AT_name("voutRef_pu")
    4420                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4421                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4422                      .dwattr $C$DW$188, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4423                      .dwattr $C$DW$188, DW_AT_decl_line(0x97)
    4424                      .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    4425              
    4426              $C$DW$189       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    4428                      .dwattr $C$DW$189, DW_AT_name("voutSet_pu")
    4429                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4430                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4431                      .dwattr $C$DW$189, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4432                      .dwattr $C$DW$189, DW_AT_decl_line(0x98)
    4433                      .dwattr $C$DW$189, DW_AT_decl_column(0x0f)
    4434              
    4435              $C$DW$190       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    4437                      .dwattr $C$DW$190, DW_AT_name("voutSense_pu")
    4438                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4439                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4440                      .dwattr $C$DW$190, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4441                      .dwattr $C$DW$190, DW_AT_decl_line(0x99)
    4442                      .dwattr $C$DW$190, DW_AT_decl_column(0x0f)
    4443              
    4444              $C$DW$191       .dwtag  DW_TAG_member
    4445                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    4446                      .dwattr $C$DW$191, DW_AT_name("uk_cc_pu")
    4447                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4448                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   96

    4449                      .dwattr $C$DW$191, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4450                      .dwattr $C$DW$191, DW_AT_decl_line(0x9b)
    4451                      .dwattr $C$DW$191, DW_AT_decl_column(0x0f)
    4452              
    4453              $C$DW$192       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    4455                      .dwattr $C$DW$192, DW_AT_name("ek_cc_pu")
    4456                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4457                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4458                      .dwattr $C$DW$192, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4459                      .dwattr $C$DW$192, DW_AT_decl_line(0x9c)
    4460                      .dwattr $C$DW$192, DW_AT_decl_column(0x0f)
    4461              
    4462              $C$DW$193       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    4464                      .dwattr $C$DW$193, DW_AT_name("uk_cv_pu")
    4465                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4466                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4467                      .dwattr $C$DW$193, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4468                      .dwattr $C$DW$193, DW_AT_decl_line(0x9d)
    4469                      .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    4470              
    4471              $C$DW$194       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    4473                      .dwattr $C$DW$194, DW_AT_name("ek_cv_pu")
    4474                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4475                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4476                      .dwattr $C$DW$194, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4477                      .dwattr $C$DW$194, DW_AT_decl_line(0x9e)
    4478                      .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    4479              
    4480              $C$DW$195       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    4482                      .dwattr $C$DW$195, DW_AT_name("direction_coeff")
    4483                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4484                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    4485                      .dwattr $C$DW$195, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4486                      .dwattr $C$DW$195, DW_AT_decl_line(0x9f)
    4487                      .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    4488              
    4489              $C$DW$196       .dwtag  DW_TAG_member
    4490                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    4491                      .dwattr $C$DW$196, DW_AT_name("dutyH_pu")
    4492                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4493                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    4494                      .dwattr $C$DW$196, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4495                      .dwattr $C$DW$196, DW_AT_decl_line(0xa1)
    4496                      .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
    4497              
    4498              $C$DW$197       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    4500                      .dwattr $C$DW$197, DW_AT_name("dutyL_pu")
    4501                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4502                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    4503                      .dwattr $C$DW$197, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   97

    4504                      .dwattr $C$DW$197, DW_AT_decl_line(0xa2)
    4505                      .dwattr $C$DW$197, DW_AT_decl_column(0x0f)
    4506              
    4507              $C$DW$198       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    4509                      .dwattr $C$DW$198, DW_AT_name("ctrlMode_logic")
    4510                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4511                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    4512                      .dwattr $C$DW$198, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4513                      .dwattr $C$DW$198, DW_AT_decl_line(0xa4)
    4514                      .dwattr $C$DW$198, DW_AT_decl_column(0x0e)
    4515              
    4516              $C$DW$199       .dwtag  DW_TAG_member
    4517                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    4518                      .dwattr $C$DW$199, DW_AT_name("direction_logic")
    4519                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4520                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4521                      .dwattr $C$DW$199, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4522                      .dwattr $C$DW$199, DW_AT_decl_line(0xa5)
    4523                      .dwattr $C$DW$199, DW_AT_decl_column(0x0e)
    4524              
    4525              $C$DW$200       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$26)
    4527                      .dwattr $C$DW$200, DW_AT_name("ioutTrip_16b")
    4528                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4529                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4530                      .dwattr $C$DW$200, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4531                      .dwattr $C$DW$200, DW_AT_decl_line(0xa7)
    4532                      .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    4533              
    4534              $C$DW$201       .dwtag  DW_TAG_member
    4535                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$26)
    4536                      .dwattr $C$DW$201, DW_AT_name("ioutTrip_n_16b")
    4537                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4538                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4539                      .dwattr $C$DW$201, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4540                      .dwattr $C$DW$201, DW_AT_decl_line(0xa8)
    4541                      .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    4542              
    4543              $C$DW$202       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    4545                      .dwattr $C$DW$202, DW_AT_name("tripFlag")
    4546                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4547                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4548                      .dwattr $C$DW$202, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4549                      .dwattr $C$DW$202, DW_AT_decl_line(0xa9)
    4550                      .dwattr $C$DW$202, DW_AT_decl_column(0x0e)
    4551              
    4552                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4553                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x8f)
    4554                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    4555                      .dwendtag $C$DW$T$27
    4556              
    4557                      .dwendtag $C$DW$TU$27
    4558              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   98

    4559              
    4560              $C$DW$TU$54     .dwtag  DW_TAG_type_unit
    4561                      .dwmtype  $C$DW$T$54
    4562              $C$DW$T$54      .dwtag  DW_TAG_typedef
    4563                      .dwattr $C$DW$T$54, DW_AT_name("BTS_ctrlLoopVariable")
    4564                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$27)
    4565                      .dwattr $C$DW$T$54, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4566                      .dwattr $C$DW$T$54, DW_AT_decl_line(0xab)
    4567                      .dwattr $C$DW$T$54, DW_AT_decl_column(0x02)
    4568              
    4569                      .dwendtag $C$DW$TU$54
    4570              
    4571              
    4572              $C$DW$TU$55     .dwtag  DW_TAG_type_unit
    4573                      .dwmtype  $C$DW$T$55
    4574              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    4575                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4576                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    4577              
    4578                      .dwendtag $C$DW$TU$55
    4579              
    4580              
    4581              $C$DW$TU$56     .dwtag  DW_TAG_type_unit
    4582                      .dwmtype  $C$DW$T$56
    4583              $C$DW$203       .dwtag  DW_TAG_TI_far_type
    4584                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$55)
    4585              
    4586              $C$DW$T$56      .dwtag  DW_TAG_const_type
    4587                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$203)
    4588              
    4589                      .dwendtag $C$DW$TU$56
    4590              
    4591              
    4592              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    4593                      .dwmtype  $C$DW$T$31
    4594              
    4595              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4596                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x52)
    4597              $C$DW$204       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    4599                      .dwattr $C$DW$204, DW_AT_name("Isense_A")
    4600                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4601                      .dwattr $C$DW$204, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4602                      .dwattr $C$DW$204, DW_AT_decl_line(0x5f)
    4603                      .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    4604              
    4605              $C$DW$205       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    4607                      .dwattr $C$DW$205, DW_AT_name("Vsense_V")
    4608                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4609                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4610                      .dwattr $C$DW$205, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4611                      .dwattr $C$DW$205, DW_AT_decl_line(0x60)
    4612                      .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    4613              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE   99

    4614              $C$DW$206       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$28)
    4616                      .dwattr $C$DW$206, DW_AT_name("Isense_16b")
    4617                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4618                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4619                      .dwattr $C$DW$206, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4620                      .dwattr $C$DW$206, DW_AT_decl_line(0x61)
    4621                      .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    4622              
    4623              $C$DW$207       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$28)
    4625                      .dwattr $C$DW$207, DW_AT_name("Vsense_16b")
    4626                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4627                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4628                      .dwattr $C$DW$207, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4629                      .dwattr $C$DW$207, DW_AT_decl_line(0x62)
    4630                      .dwattr $C$DW$207, DW_AT_decl_column(0x0d)
    4631              
    4632              $C$DW$208       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$30)
    4634                      .dwattr $C$DW$208, DW_AT_name("Sum_I")
    4635                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4636                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4637                      .dwattr $C$DW$208, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4638                      .dwattr $C$DW$208, DW_AT_decl_line(0x63)
    4639                      .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
    4640              
    4641              $C$DW$209       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$30)
    4643                      .dwattr $C$DW$209, DW_AT_name("Sum_V")
    4644                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4645                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4646                      .dwattr $C$DW$209, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4647                      .dwattr $C$DW$209, DW_AT_decl_line(0x64)
    4648                      .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    4649              
    4650              $C$DW$210       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    4652                      .dwattr $C$DW$210, DW_AT_name("Index")
    4653                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4654                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4655                      .dwattr $C$DW$210, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4656                      .dwattr $C$DW$210, DW_AT_decl_line(0x65)
    4657                      .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    4658              
    4659              $C$DW$211       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    4661                      .dwattr $C$DW$211, DW_AT_name("IoutGain_A")
    4662                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4663                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4664                      .dwattr $C$DW$211, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4665                      .dwattr $C$DW$211, DW_AT_decl_line(0x66)
    4666                      .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    4667              
    4668              $C$DW$212       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  100

    4669                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    4670                      .dwattr $C$DW$212, DW_AT_name("IoutOffset_A")
    4671                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4672                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4673                      .dwattr $C$DW$212, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4674                      .dwattr $C$DW$212, DW_AT_decl_line(0x67)
    4675                      .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
    4676              
    4677              $C$DW$213       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    4679                      .dwattr $C$DW$213, DW_AT_name("VoutGain_V")
    4680                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4681                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4682                      .dwattr $C$DW$213, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4683                      .dwattr $C$DW$213, DW_AT_decl_line(0x68)
    4684                      .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    4685              
    4686              $C$DW$214       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    4688                      .dwattr $C$DW$214, DW_AT_name("VoutOffset_V")
    4689                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4690                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4691                      .dwattr $C$DW$214, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4692                      .dwattr $C$DW$214, DW_AT_decl_line(0x69)
    4693                      .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    4694              
    4695                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4696                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x5e)
    4697                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    4698                      .dwendtag $C$DW$T$31
    4699              
    4700                      .dwendtag $C$DW$TU$31
    4701              
    4702              
    4703              $C$DW$TU$59     .dwtag  DW_TAG_type_unit
    4704                      .dwmtype  $C$DW$T$59
    4705              $C$DW$T$59      .dwtag  DW_TAG_typedef
    4706                      .dwattr $C$DW$T$59, DW_AT_name("BTS_measValues")
    4707                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$31)
    4708                      .dwattr $C$DW$T$59, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4709                      .dwattr $C$DW$T$59, DW_AT_decl_line(0x6b)
    4710                      .dwattr $C$DW$T$59, DW_AT_decl_column(0x02)
    4711              
    4712                      .dwendtag $C$DW$TU$59
    4713              
    4714              
    4715              $C$DW$TU$60     .dwtag  DW_TAG_type_unit
    4716                      .dwmtype  $C$DW$T$60
    4717              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    4718                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4719                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    4720              
    4721                      .dwendtag $C$DW$TU$60
    4722              
    4723              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  101

    4724              $C$DW$TU$61     .dwtag  DW_TAG_type_unit
    4725                      .dwmtype  $C$DW$T$61
    4726              $C$DW$215       .dwtag  DW_TAG_TI_far_type
    4727                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$60)
    4728              
    4729              $C$DW$T$61      .dwtag  DW_TAG_const_type
    4730                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$215)
    4731              
    4732                      .dwendtag $C$DW$TU$61
    4733              
    4734              
    4735              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    4736                      .dwmtype  $C$DW$T$33
    4737              
    4738              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4739                      .dwattr $C$DW$T$33, DW_AT_name("_Complex_double")
    4740                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    4741              $C$DW$216       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$32)
    4743                      .dwattr $C$DW$216, DW_AT_name("_Vals")
    4744                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4745                      .dwattr $C$DW$216, DW_AT_decl_file("../bts.c")
    4746                      .dwattr $C$DW$216, DW_AT_decl_line(0x01)
    4747                      .dwattr $C$DW$216, DW_AT_decl_column(0x00)
    4748              
    4749                      .dwendtag $C$DW$T$33
    4750              
    4751                      .dwendtag $C$DW$TU$33
    4752              
    4753              
    4754              $C$DW$TU$64     .dwtag  DW_TAG_type_unit
    4755                      .dwmtype  $C$DW$T$64
    4756              $C$DW$T$64      .dwtag  DW_TAG_typedef
    4757                      .dwattr $C$DW$T$64, DW_AT_name("_Complex_double")
    4758                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$33)
    4759                      .dwattr $C$DW$T$64, DW_AT_decl_file("../bts.c")
    4760                      .dwattr $C$DW$T$64, DW_AT_decl_line(0x01)
    4761                      .dwattr $C$DW$T$64, DW_AT_decl_column(0x00)
    4762              
    4763                      .dwendtag $C$DW$TU$64
    4764              
    4765              
    4766              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    4767                      .dwmtype  $C$DW$T$35
    4768              
    4769              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4770                      .dwattr $C$DW$T$35, DW_AT_name("_Complex_float")
    4771                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    4772              $C$DW$217       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$34)
    4774                      .dwattr $C$DW$217, DW_AT_name("_Vals")
    4775                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4776                      .dwattr $C$DW$217, DW_AT_decl_file("../bts.c")
    4777                      .dwattr $C$DW$217, DW_AT_decl_line(0x01)
    4778                      .dwattr $C$DW$217, DW_AT_decl_column(0x00)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  102

    4779              
    4780                      .dwendtag $C$DW$T$35
    4781              
    4782                      .dwendtag $C$DW$TU$35
    4783              
    4784              
    4785              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    4786                      .dwmtype  $C$DW$T$65
    4787              $C$DW$T$65      .dwtag  DW_TAG_typedef
    4788                      .dwattr $C$DW$T$65, DW_AT_name("_Complex_float")
    4789                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$35)
    4790                      .dwattr $C$DW$T$65, DW_AT_decl_file("../bts.c")
    4791                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x01)
    4792                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x00)
    4793              
    4794                      .dwendtag $C$DW$TU$65
    4795              
    4796              
    4797              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    4798                      .dwmtype  $C$DW$T$37
    4799              
    4800              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4801                      .dwattr $C$DW$T$37, DW_AT_name("_Complex_long_double")
    4802                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    4803              $C$DW$218       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$36)
    4805                      .dwattr $C$DW$218, DW_AT_name("_Vals")
    4806                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4807                      .dwattr $C$DW$218, DW_AT_decl_file("../bts.c")
    4808                      .dwattr $C$DW$218, DW_AT_decl_line(0x01)
    4809                      .dwattr $C$DW$218, DW_AT_decl_column(0x00)
    4810              
    4811                      .dwendtag $C$DW$T$37
    4812              
    4813                      .dwendtag $C$DW$TU$37
    4814              
    4815              
    4816              $C$DW$TU$67     .dwtag  DW_TAG_type_unit
    4817                      .dwmtype  $C$DW$T$67
    4818              $C$DW$T$67      .dwtag  DW_TAG_typedef
    4819                      .dwattr $C$DW$T$67, DW_AT_name("_Complex_long_double")
    4820                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$37)
    4821                      .dwattr $C$DW$T$67, DW_AT_decl_file("../bts.c")
    4822                      .dwattr $C$DW$T$67, DW_AT_decl_line(0x01)
    4823                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x00)
    4824              
    4825                      .dwendtag $C$DW$TU$67
    4826              
    4827              
    4828              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    4829                      .dwmtype  $C$DW$T$2
    4830              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4831                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4832              
    4833                      .dwendtag $C$DW$TU$2
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  103

    4834              
    4835              
    4836              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    4837                      .dwmtype  $C$DW$T$4
    4838              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4839                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4840                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4841                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4842              
    4843                      .dwendtag $C$DW$TU$4
    4844              
    4845              
    4846              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    4847                      .dwmtype  $C$DW$T$5
    4848              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4849                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4850                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4851                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4852              
    4853                      .dwendtag $C$DW$TU$5
    4854              
    4855              
    4856              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    4857                      .dwmtype  $C$DW$T$6
    4858              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4859                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4860                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4861                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4862              
    4863                      .dwendtag $C$DW$TU$6
    4864              
    4865              
    4866              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    4867                      .dwmtype  $C$DW$T$7
    4868              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4869                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4870                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4871                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4872              
    4873                      .dwendtag $C$DW$TU$7
    4874              
    4875              
    4876              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    4877                      .dwmtype  $C$DW$T$8
    4878              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4879                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4880                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4881                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4882              
    4883                      .dwendtag $C$DW$TU$8
    4884              
    4885              
    4886              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    4887                      .dwmtype  $C$DW$T$9
    4888              $C$DW$T$9       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  104

    4889                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4890                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4891                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4892              
    4893                      .dwendtag $C$DW$TU$9
    4894              
    4895              
    4896              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    4897                      .dwmtype  $C$DW$T$10
    4898              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4899                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4900                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4901                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4902              
    4903                      .dwendtag $C$DW$TU$10
    4904              
    4905              
    4906              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4907                      .dwmtype  $C$DW$T$25
    4908              $C$DW$T$25      .dwtag  DW_TAG_typedef
    4909                      .dwattr $C$DW$T$25, DW_AT_name("__int16_t")
    4910                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$10)
    4911                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    4912                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x40)
    4913                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1d)
    4914              
    4915                      .dwendtag $C$DW$TU$25
    4916              
    4917              
    4918              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    4919                      .dwmtype  $C$DW$T$26
    4920              $C$DW$T$26      .dwtag  DW_TAG_typedef
    4921                      .dwattr $C$DW$T$26, DW_AT_name("int16_t")
    4922                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4923                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    4924                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2b)
    4925                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x14)
    4926              
    4927                      .dwendtag $C$DW$TU$26
    4928              
    4929              
    4930              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    4931                      .dwmtype  $C$DW$T$28
    4932              
    4933              $C$DW$T$28      .dwtag  DW_TAG_array_type
    4934                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    4935                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    4936              $C$DW$219       .dwtag  DW_TAG_subrange_type
    4937                      .dwattr $C$DW$219, DW_AT_upper_bound(0x1f)
    4938              
    4939                      .dwendtag $C$DW$T$28
    4940              
    4941                      .dwendtag $C$DW$TU$28
    4942              
    4943              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  105

    4944              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
    4945                      .dwmtype  $C$DW$T$11
    4946              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4947                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4948                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4949                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4950              
    4951                      .dwendtag $C$DW$TU$11
    4952              
    4953              
    4954              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    4955                      .dwmtype  $C$DW$T$21
    4956              $C$DW$T$21      .dwtag  DW_TAG_typedef
    4957                      .dwattr $C$DW$T$21, DW_AT_name("__uint16_t")
    4958                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$11)
    4959                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    4960                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x41)
    4961                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    4962              
    4963                      .dwendtag $C$DW$TU$21
    4964              
    4965              
    4966              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    4967                      .dwmtype  $C$DW$T$22
    4968              $C$DW$T$22      .dwtag  DW_TAG_typedef
    4969                      .dwattr $C$DW$T$22, DW_AT_name("uint16_t")
    4970                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    4971                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    4972                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x41)
    4973                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x15)
    4974              
    4975                      .dwendtag $C$DW$TU$22
    4976              
    4977              
    4978              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    4979                      .dwmtype  $C$DW$T$23
    4980              $C$DW$220       .dwtag  DW_TAG_TI_far_type
    4981                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    4982              
    4983              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    4984                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$220)
    4985              
    4986                      .dwendtag $C$DW$TU$23
    4987              
    4988              
    4989              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    4990                      .dwmtype  $C$DW$T$12
    4991              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4992                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4993                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4994                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4995              
    4996                      .dwendtag $C$DW$TU$12
    4997              
    4998              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  106

    4999              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5000                      .dwmtype  $C$DW$T$29
    5001              $C$DW$T$29      .dwtag  DW_TAG_typedef
    5002                      .dwattr $C$DW$T$29, DW_AT_name("__int32_t")
    5003                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$12)
    5004                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    5005                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x42)
    5006                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1d)
    5007              
    5008                      .dwendtag $C$DW$TU$29
    5009              
    5010              
    5011              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5012                      .dwmtype  $C$DW$T$30
    5013              $C$DW$T$30      .dwtag  DW_TAG_typedef
    5014                      .dwattr $C$DW$T$30, DW_AT_name("int32_t")
    5015                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    5016                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    5017                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x30)
    5018                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x14)
    5019              
    5020                      .dwendtag $C$DW$TU$30
    5021              
    5022              
    5023              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    5024                      .dwmtype  $C$DW$T$13
    5025              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5026                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5027                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5028                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5029              
    5030                      .dwendtag $C$DW$TU$13
    5031              
    5032              
    5033              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5034                      .dwmtype  $C$DW$T$38
    5035              $C$DW$T$38      .dwtag  DW_TAG_typedef
    5036                      .dwattr $C$DW$T$38, DW_AT_name("__uint32_t")
    5037                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$13)
    5038                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    5039                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x43)
    5040                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x1c)
    5041              
    5042                      .dwendtag $C$DW$TU$38
    5043              
    5044              
    5045              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    5046                      .dwmtype  $C$DW$T$39
    5047              $C$DW$T$39      .dwtag  DW_TAG_typedef
    5048                      .dwattr $C$DW$T$39, DW_AT_name("uint32_t")
    5049                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    5050                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    5051                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x46)
    5052                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x15)
    5053              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  107

    5054                      .dwendtag $C$DW$TU$39
    5055              
    5056              
    5057              $C$DW$TU$14     .dwtag  DW_TAG_type_unit
    5058                      .dwmtype  $C$DW$T$14
    5059              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5060                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5061                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    5062                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    5063              
    5064                      .dwendtag $C$DW$TU$14
    5065              
    5066              
    5067              $C$DW$TU$15     .dwtag  DW_TAG_type_unit
    5068                      .dwmtype  $C$DW$T$15
    5069              $C$DW$T$15      .dwtag  DW_TAG_base_type
    5070                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5071                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5072                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    5073              
    5074                      .dwendtag $C$DW$TU$15
    5075              
    5076              
    5077              $C$DW$TU$16     .dwtag  DW_TAG_type_unit
    5078                      .dwmtype  $C$DW$T$16
    5079              $C$DW$T$16      .dwtag  DW_TAG_base_type
    5080                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5081                      .dwattr $C$DW$T$16, DW_AT_name("float")
    5082                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    5083              
    5084                      .dwendtag $C$DW$TU$16
    5085              
    5086              
    5087              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    5088                      .dwmtype  $C$DW$T$34
    5089              
    5090              $C$DW$T$34      .dwtag  DW_TAG_array_type
    5091                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$16)
    5092                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    5093              $C$DW$221       .dwtag  DW_TAG_subrange_type
    5094                      .dwattr $C$DW$221, DW_AT_upper_bound(0x01)
    5095              
    5096                      .dwendtag $C$DW$T$34
    5097              
    5098                      .dwendtag $C$DW$TU$34
    5099              
    5100              
    5101              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    5102                      .dwmtype  $C$DW$T$82
    5103              $C$DW$222       .dwtag  DW_TAG_TI_far_type
    5104                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$16)
    5105              
    5106              $C$DW$T$82      .dwtag  DW_TAG_const_type
    5107                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$222)
    5108              
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  108

    5109                      .dwendtag $C$DW$TU$82
    5110              
    5111              
    5112              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    5113                      .dwmtype  $C$DW$T$19
    5114              $C$DW$T$19      .dwtag  DW_TAG_typedef
    5115                      .dwattr $C$DW$T$19, DW_AT_name("float32_t")
    5116                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$16)
    5117                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:\ti\c2000\C2000Ware_DigitalPower_SDK_3_01_00_00\c2000ware\driv
    5118                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x5e)
    5119                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x17)
    5120              
    5121                      .dwendtag $C$DW$TU$19
    5122              
    5123              
    5124              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    5125                      .dwmtype  $C$DW$T$20
    5126              $C$DW$223       .dwtag  DW_TAG_TI_far_type
    5127                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    5128              
    5129              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    5130                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$223)
    5131              
    5132                      .dwendtag $C$DW$TU$20
    5133              
    5134              
    5135              $C$DW$TU$17     .dwtag  DW_TAG_type_unit
    5136                      .dwmtype  $C$DW$T$17
    5137              $C$DW$T$17      .dwtag  DW_TAG_base_type
    5138                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5139                      .dwattr $C$DW$T$17, DW_AT_name("double")
    5140                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    5141              
    5142                      .dwendtag $C$DW$TU$17
    5143              
    5144              
    5145              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    5146                      .dwmtype  $C$DW$T$32
    5147              
    5148              $C$DW$T$32      .dwtag  DW_TAG_array_type
    5149                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$17)
    5150                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    5151              $C$DW$224       .dwtag  DW_TAG_subrange_type
    5152                      .dwattr $C$DW$224, DW_AT_upper_bound(0x01)
    5153              
    5154                      .dwendtag $C$DW$T$32
    5155              
    5156                      .dwendtag $C$DW$TU$32
    5157              
    5158              
    5159              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    5160                      .dwmtype  $C$DW$T$84
    5161              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    5162                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$17)
    5163                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  109

    5164              
    5165                      .dwendtag $C$DW$TU$84
    5166              
    5167              
    5168              $C$DW$TU$85     .dwtag  DW_TAG_type_unit
    5169                      .dwmtype  $C$DW$T$85
    5170              $C$DW$225       .dwtag  DW_TAG_TI_far_type
    5171                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$84)
    5172              
    5173              $C$DW$T$85      .dwtag  DW_TAG_const_type
    5174                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$225)
    5175              
    5176                      .dwendtag $C$DW$TU$85
    5177              
    5178              
    5179              $C$DW$TU$18     .dwtag  DW_TAG_type_unit
    5180                      .dwmtype  $C$DW$T$18
    5181              $C$DW$T$18      .dwtag  DW_TAG_base_type
    5182                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5183                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    5184                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    5185              
    5186                      .dwendtag $C$DW$TU$18
    5187              
    5188              
    5189              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    5190                      .dwmtype  $C$DW$T$36
    5191              
    5192              $C$DW$T$36      .dwtag  DW_TAG_array_type
    5193                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$18)
    5194                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    5195              $C$DW$226       .dwtag  DW_TAG_subrange_type
    5196                      .dwattr $C$DW$226, DW_AT_upper_bound(0x01)
    5197              
    5198                      .dwendtag $C$DW$T$36
    5199              
    5200                      .dwendtag $C$DW$TU$36
    5201              
    5202              
    5203              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    5204                      .dwmtype  $C$DW$T$87
    5205              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    5206                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$18)
    5207                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    5208              
    5209                      .dwendtag $C$DW$TU$87
    5210              
    5211              
    5212              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    5213                      .dwmtype  $C$DW$T$88
    5214              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    5215                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$87)
    5216              
    5217              $C$DW$T$88      .dwtag  DW_TAG_const_type
    5218                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$227)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  110

    5219              
    5220                      .dwendtag $C$DW$TU$88
    5221              
    5222              
    5223              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    5224                      .dwmtype  $C$DW$T$40
    5225              
    5226              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5227                      .dwattr $C$DW$T$40, DW_AT_name("dcl_css")
    5228                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    5229              $C$DW$228       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    5231                      .dwattr $C$DW$228, DW_AT_name("tpt")
    5232                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    5233                      .dwattr $C$DW$228, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5234                      .dwattr $C$DW$228, DW_AT_decl_line(0x91)
    5235                      .dwattr $C$DW$228, DW_AT_decl_column(0x0f)
    5236              
    5237              $C$DW$229       .dwtag  DW_TAG_member
    5238                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    5239                      .dwattr $C$DW$229, DW_AT_name("T")
    5240                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5241                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    5242                      .dwattr $C$DW$229, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5243                      .dwattr $C$DW$229, DW_AT_decl_line(0x92)
    5244                      .dwattr $C$DW$229, DW_AT_decl_column(0x0f)
    5245              
    5246              $C$DW$230       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$39)
    5248                      .dwattr $C$DW$230, DW_AT_name("sts")
    5249                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5250                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    5251                      .dwattr $C$DW$230, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5252                      .dwattr $C$DW$230, DW_AT_decl_line(0x93)
    5253                      .dwattr $C$DW$230, DW_AT_decl_column(0x0e)
    5254              
    5255              $C$DW$231       .dwtag  DW_TAG_member
    5256                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$39)
    5257                      .dwattr $C$DW$231, DW_AT_name("err")
    5258                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5259                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    5260                      .dwattr $C$DW$231, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5261                      .dwattr $C$DW$231, DW_AT_decl_line(0x94)
    5262                      .dwattr $C$DW$231, DW_AT_decl_column(0x0e)
    5263              
    5264              $C$DW$232       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$39)
    5266                      .dwattr $C$DW$232, DW_AT_name("loc")
    5267                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5268                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5269                      .dwattr $C$DW$232, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5270                      .dwattr $C$DW$232, DW_AT_decl_line(0x95)
    5271                      .dwattr $C$DW$232, DW_AT_decl_column(0x0e)
    5272              
    5273                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  111

    5274                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x90)
    5275                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x19)
    5276                      .dwendtag $C$DW$T$40
    5277              
    5278                      .dwendtag $C$DW$TU$40
    5279              
    5280              
    5281              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    5282                      .dwmtype  $C$DW$T$44
    5283              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    5284                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$40)
    5285              
    5286              $C$DW$T$44      .dwtag  DW_TAG_volatile_type
    5287                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$233)
    5288              
    5289                      .dwendtag $C$DW$TU$44
    5290              
    5291              
    5292              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    5293                      .dwmtype  $C$DW$T$45
    5294              $C$DW$T$45      .dwtag  DW_TAG_typedef
    5295                      .dwattr $C$DW$T$45, DW_AT_name("DCL_CSS")
    5296                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5297                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    5298                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x96)
    5299                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    5300              
    5301                      .dwendtag $C$DW$TU$45
    5302              
    5303              
    5304              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    5305                      .dwmtype  $C$DW$T$46
    5306              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    5307                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5308                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    5309              
    5310                      .dwendtag $C$DW$TU$46
    5311              
    5312              
    5313              $C$DW$TU$47     .dwtag  DW_TAG_type_unit
    5314                      .dwmtype  $C$DW$T$47
    5315              
    5316              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5317                      .dwattr $C$DW$T$47, DW_AT_name("dcl_df22")
    5318                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x12)
    5319              $C$DW$234       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    5321                      .dwattr $C$DW$234, DW_AT_name("b0")
    5322                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5323                      .dwattr $C$DW$234, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5324                      .dwattr $C$DW$234, DW_AT_decl_line(0x4ab)
    5325                      .dwattr $C$DW$234, DW_AT_decl_column(0x0f)
    5326              
    5327              $C$DW$235       .dwtag  DW_TAG_member
    5328                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  112

    5329                      .dwattr $C$DW$235, DW_AT_name("b1")
    5330                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5331                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5332                      .dwattr $C$DW$235, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5333                      .dwattr $C$DW$235, DW_AT_decl_line(0x4ac)
    5334                      .dwattr $C$DW$235, DW_AT_decl_column(0x0f)
    5335              
    5336              $C$DW$236       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    5338                      .dwattr $C$DW$236, DW_AT_name("b2")
    5339                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5340                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5341                      .dwattr $C$DW$236, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5342                      .dwattr $C$DW$236, DW_AT_decl_line(0x4ad)
    5343                      .dwattr $C$DW$236, DW_AT_decl_column(0x0f)
    5344              
    5345              $C$DW$237       .dwtag  DW_TAG_member
    5346                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    5347                      .dwattr $C$DW$237, DW_AT_name("a1")
    5348                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5349                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5350                      .dwattr $C$DW$237, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5351                      .dwattr $C$DW$237, DW_AT_decl_line(0x4ae)
    5352                      .dwattr $C$DW$237, DW_AT_decl_column(0x0f)
    5353              
    5354              $C$DW$238       .dwtag  DW_TAG_member
    5355                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    5356                      .dwattr $C$DW$238, DW_AT_name("a2")
    5357                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5358                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5359                      .dwattr $C$DW$238, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5360                      .dwattr $C$DW$238, DW_AT_decl_line(0x4af)
    5361                      .dwattr $C$DW$238, DW_AT_decl_column(0x0f)
    5362              
    5363              $C$DW$239       .dwtag  DW_TAG_member
    5364                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    5365                      .dwattr $C$DW$239, DW_AT_name("x1")
    5366                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5367                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5368                      .dwattr $C$DW$239, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5369                      .dwattr $C$DW$239, DW_AT_decl_line(0x4b0)
    5370                      .dwattr $C$DW$239, DW_AT_decl_column(0x0f)
    5371              
    5372              $C$DW$240       .dwtag  DW_TAG_member
    5373                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    5374                      .dwattr $C$DW$240, DW_AT_name("x2")
    5375                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5376                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5377                      .dwattr $C$DW$240, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5378                      .dwattr $C$DW$240, DW_AT_decl_line(0x4b1)
    5379                      .dwattr $C$DW$240, DW_AT_decl_column(0x0f)
    5380              
    5381              $C$DW$241       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$43)
    5383                      .dwattr $C$DW$241, DW_AT_name("sps")
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  113

    5384                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5385                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5386                      .dwattr $C$DW$241, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5387                      .dwattr $C$DW$241, DW_AT_decl_line(0x4b2)
    5388                      .dwattr $C$DW$241, DW_AT_decl_column(0x13)
    5389              
    5390              $C$DW$242       .dwtag  DW_TAG_member
    5391                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$46)
    5392                      .dwattr $C$DW$242, DW_AT_name("css")
    5393                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5394                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5395                      .dwattr $C$DW$242, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5396                      .dwattr $C$DW$242, DW_AT_decl_line(0x4b3)
    5397                      .dwattr $C$DW$242, DW_AT_decl_column(0x0e)
    5398              
    5399                      .dwattr $C$DW$T$47, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    5400                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x4aa)
    5401                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x19)
    5402                      .dwendtag $C$DW$T$47
    5403              
    5404                      .dwendtag $C$DW$TU$47
    5405              
    5406              
    5407              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    5408                      .dwmtype  $C$DW$T$90
    5409              $C$DW$243       .dwtag  DW_TAG_TI_far_type
    5410                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$47)
    5411              
    5412              $C$DW$T$90      .dwtag  DW_TAG_volatile_type
    5413                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$243)
    5414              
    5415                      .dwendtag $C$DW$TU$90
    5416              
    5417              
    5418              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    5419                      .dwmtype  $C$DW$T$91
    5420              $C$DW$T$91      .dwtag  DW_TAG_typedef
    5421                      .dwattr $C$DW$T$91, DW_AT_name("DCL_DF22")
    5422                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    5423                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    5424                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x4b4)
    5425                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    5426              
    5427                      .dwendtag $C$DW$TU$91
    5428              
    5429              
    5430              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    5431                      .dwmtype  $C$DW$T$48
    5432              
    5433              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    5434                      .dwattr $C$DW$T$48, DW_AT_name("dcl_df22_sps")
    5435                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x0a)
    5436              $C$DW$244       .dwtag  DW_TAG_member
    5437                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    5438                      .dwattr $C$DW$244, DW_AT_name("b0")
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  114

    5439                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5440                      .dwattr $C$DW$244, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5441                      .dwattr $C$DW$244, DW_AT_decl_line(0x49f)
    5442                      .dwattr $C$DW$244, DW_AT_decl_column(0x0f)
    5443              
    5444              $C$DW$245       .dwtag  DW_TAG_member
    5445                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    5446                      .dwattr $C$DW$245, DW_AT_name("b1")
    5447                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5448                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5449                      .dwattr $C$DW$245, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5450                      .dwattr $C$DW$245, DW_AT_decl_line(0x4a0)
    5451                      .dwattr $C$DW$245, DW_AT_decl_column(0x0f)
    5452              
    5453              $C$DW$246       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    5455                      .dwattr $C$DW$246, DW_AT_name("b2")
    5456                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5457                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5458                      .dwattr $C$DW$246, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5459                      .dwattr $C$DW$246, DW_AT_decl_line(0x4a1)
    5460                      .dwattr $C$DW$246, DW_AT_decl_column(0x0f)
    5461              
    5462              $C$DW$247       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    5464                      .dwattr $C$DW$247, DW_AT_name("a1")
    5465                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5466                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5467                      .dwattr $C$DW$247, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5468                      .dwattr $C$DW$247, DW_AT_decl_line(0x4a2)
    5469                      .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    5470              
    5471              $C$DW$248       .dwtag  DW_TAG_member
    5472                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    5473                      .dwattr $C$DW$248, DW_AT_name("a2")
    5474                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5475                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5476                      .dwattr $C$DW$248, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5477                      .dwattr $C$DW$248, DW_AT_decl_line(0x4a3)
    5478                      .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    5479              
    5480                      .dwattr $C$DW$T$48, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    5481                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x49e)
    5482                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x19)
    5483                      .dwendtag $C$DW$T$48
    5484              
    5485                      .dwendtag $C$DW$TU$48
    5486              
    5487              
    5488              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    5489                      .dwmtype  $C$DW$T$41
    5490              $C$DW$249       .dwtag  DW_TAG_TI_far_type
    5491                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$48)
    5492              
    5493              $C$DW$T$41      .dwtag  DW_TAG_volatile_type
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:47 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts.asm                                                              PAGE  115

    5494                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$249)
    5495              
    5496                      .dwendtag $C$DW$TU$41
    5497              
    5498              
    5499              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5500                      .dwmtype  $C$DW$T$42
    5501              $C$DW$T$42      .dwtag  DW_TAG_typedef
    5502                      .dwattr $C$DW$T$42, DW_AT_name("DCL_DF22_SPS")
    5503                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    5504                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    5505                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x4a4)
    5506                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    5507              
    5508                      .dwendtag $C$DW$TU$42
    5509              
    5510              
    5511              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    5512                      .dwmtype  $C$DW$T$43
    5513              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5514                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5515                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    5516              
    5517                      .dwendtag $C$DW$TU$43
    5518              

No Assembly Errors, No Assembly Warnings
