TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Tue Aug 13 19:46:07 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("BTS_measValues")
      15                      .dwattr $C$DW$1, DW_AT_linkage_name("BTS_measValues")

    5851                      .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    5852                      .dwattr $C$DW$332, DW_AT_decl_line(0x311)
    5853                      .dwattr $C$DW$332, DW_AT_decl_column(0x05)
    5854              
    5855              $C$DW$333       .dwtag  DW_TAG_enumerator
    5856                      .dwattr $C$DW$333, DW_AT_name("EPWM_TZ_ACTION_DISABLE")
    5857                      .dwattr $C$DW$333, DW_AT_const_value(0x03)
    5858                      .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    5859                      .dwattr $C$DW$333, DW_AT_decl_line(0x312)
    5860                      .dwattr $C$DW$333, DW_AT_decl_column(0x05)
    5861              
    5862                      .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/driv
    5863                      .dwattr $C$DW$T$61, DW_AT_decl_line(0x30e)
    5864                      .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    5865                      .dwendtag $C$DW$T$61
    5866              
    5867                      .dwendtag $C$DW$TU$61
    5868              
    5869              
    5870              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
    5871                      .dwmtype  $C$DW$T$62
    5872              $C$DW$T$62      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  118

    5873                      .dwattr $C$DW$T$62, DW_AT_name("EPWM_TripZoneAction")
    5874                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    5875                      .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/driv
    5876                      .dwattr $C$DW$T$62, DW_AT_decl_line(0x313)
    5877                      .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    5878              
    5879                      .dwendtag $C$DW$TU$62
    5880              
    5881              
    5882              $C$DW$TU$63     .dwtag  DW_TAG_type_unit
    5883                      .dwmtype  $C$DW$T$63
    5884              
    5885              $C$DW$T$63      .dwtag  DW_TAG_enumeration_type
    5886                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    5887              $C$DW$334       .dwtag  DW_TAG_enumerator
    5888                      .dwattr $C$DW$334, DW_AT_name("HRPWM_COUNTER_COMPARE_A")
    5889                      .dwattr $C$DW$334, DW_AT_const_value(0x00)
    5890                      .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    5891                      .dwattr $C$DW$334, DW_AT_decl_line(0xb1)
    5892                      .dwattr $C$DW$334, DW_AT_decl_column(0x05)
    5893              
    5894              $C$DW$335       .dwtag  DW_TAG_enumerator
    5895                      .dwattr $C$DW$335, DW_AT_name("HRPWM_COUNTER_COMPARE_B")
    5896                      .dwattr $C$DW$335, DW_AT_const_value(0x04)
    5897                      .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    5898                      .dwattr $C$DW$335, DW_AT_decl_line(0xb2)
    5899                      .dwattr $C$DW$335, DW_AT_decl_column(0x05)
    5900              
    5901                      .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/driv
    5902                      .dwattr $C$DW$T$63, DW_AT_decl_line(0xb0)
    5903                      .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    5904                      .dwendtag $C$DW$T$63
    5905              
    5906                      .dwendtag $C$DW$TU$63
    5907              
    5908              
    5909              $C$DW$TU$64     .dwtag  DW_TAG_type_unit
    5910                      .dwmtype  $C$DW$T$64
    5911              $C$DW$T$64      .dwtag  DW_TAG_typedef
    5912                      .dwattr $C$DW$T$64, DW_AT_name("HRPWM_CounterCompareModule")
    5913                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    5914                      .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/driv
    5915                      .dwattr $C$DW$T$64, DW_AT_decl_line(0xb3)
    5916                      .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5917              
    5918                      .dwendtag $C$DW$TU$64
    5919              
    5920              
    5921              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5922                      .dwmtype  $C$DW$T$25
    5923              
    5924              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5925                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    5926              $C$DW$336       .dwtag  DW_TAG_member
    5927                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  119

    5928                      .dwattr $C$DW$336, DW_AT_name("response")
    5929                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5930                      .dwattr $C$DW$336, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5931                      .dwattr $C$DW$336, DW_AT_decl_line(0x35)
    5932                      .dwattr $C$DW$336, DW_AT_decl_column(0x17)
    5933              
    5934              $C$DW$337       .dwtag  DW_TAG_member
    5935                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    5936                      .dwattr $C$DW$337, DW_AT_name("crc")
    5937                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5938                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5939                      .dwattr $C$DW$337, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5940                      .dwattr $C$DW$337, DW_AT_decl_line(0x36)
    5941                      .dwattr $C$DW$337, DW_AT_decl_column(0x17)
    5942              
    5943              $C$DW$338       .dwtag  DW_TAG_member
    5944                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
    5945                      .dwattr $C$DW$338, DW_AT_name("channel0")
    5946                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5947                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5948                      .dwattr $C$DW$338, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5949                      .dwattr $C$DW$338, DW_AT_decl_line(0x37)
    5950                      .dwattr $C$DW$338, DW_AT_decl_column(0x16)
    5951              
    5952              $C$DW$339       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$24)
    5954                      .dwattr $C$DW$339, DW_AT_name("channel1")
    5955                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5956                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5957                      .dwattr $C$DW$339, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5958                      .dwattr $C$DW$339, DW_AT_decl_line(0x38)
    5959                      .dwattr $C$DW$339, DW_AT_decl_column(0x16)
    5960              
    5961              $C$DW$340       .dwtag  DW_TAG_member
    5962                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$24)
    5963                      .dwattr $C$DW$340, DW_AT_name("channel2")
    5964                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5965                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5966                      .dwattr $C$DW$340, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5967                      .dwattr $C$DW$340, DW_AT_decl_line(0x39)
    5968                      .dwattr $C$DW$340, DW_AT_decl_column(0x16)
    5969              
    5970              $C$DW$341       .dwtag  DW_TAG_member
    5971                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$24)
    5972                      .dwattr $C$DW$341, DW_AT_name("channel3")
    5973                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5974                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5975                      .dwattr $C$DW$341, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5976                      .dwattr $C$DW$341, DW_AT_decl_line(0x3a)
    5977                      .dwattr $C$DW$341, DW_AT_decl_column(0x16)
    5978              
    5979              $C$DW$342       .dwtag  DW_TAG_member
    5980                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$24)
    5981                      .dwattr $C$DW$342, DW_AT_name("channel4")
    5982                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  120

    5983                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5984                      .dwattr $C$DW$342, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5985                      .dwattr $C$DW$342, DW_AT_decl_line(0x3b)
    5986                      .dwattr $C$DW$342, DW_AT_decl_column(0x16)
    5987              
    5988              $C$DW$343       .dwtag  DW_TAG_member
    5989                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$24)
    5990                      .dwattr $C$DW$343, DW_AT_name("channel5")
    5991                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5992                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5993                      .dwattr $C$DW$343, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5994                      .dwattr $C$DW$343, DW_AT_decl_line(0x3c)
    5995                      .dwattr $C$DW$343, DW_AT_decl_column(0x16)
    5996              
    5997              $C$DW$344       .dwtag  DW_TAG_member
    5998                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$24)
    5999                      .dwattr $C$DW$344, DW_AT_name("channel6")
    6000                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6001                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6002                      .dwattr $C$DW$344, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6003                      .dwattr $C$DW$344, DW_AT_decl_line(0x3d)
    6004                      .dwattr $C$DW$344, DW_AT_decl_column(0x16)
    6005              
    6006              $C$DW$345       .dwtag  DW_TAG_member
    6007                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$24)
    6008                      .dwattr $C$DW$345, DW_AT_name("channel7")
    6009                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6010                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6011                      .dwattr $C$DW$345, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6012                      .dwattr $C$DW$345, DW_AT_decl_line(0x3e)
    6013                      .dwattr $C$DW$345, DW_AT_decl_column(0x16)
    6014              
    6015                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6016                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x34)
    6017                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6018                      .dwendtag $C$DW$T$25
    6019              
    6020                      .dwendtag $C$DW$TU$25
    6021              
    6022              
    6023              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    6024                      .dwmtype  $C$DW$T$65
    6025              $C$DW$T$65      .dwtag  DW_TAG_typedef
    6026                      .dwattr $C$DW$T$65, DW_AT_name("adc_data")
    6027                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$25)
    6028                      .dwattr $C$DW$T$65, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6029                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f)
    6030                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    6031              
    6032                      .dwendtag $C$DW$TU$65
    6033              
    6034              
    6035              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    6036                      .dwmtype  $C$DW$T$30
    6037              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  121

    6038              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6039                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x20)
    6040              $C$DW$346       .dwtag  DW_TAG_member
    6041                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$27)
    6042                      .dwattr $C$DW$346, DW_AT_name("h_magVect")
    6043                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6044                      .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6045                      .dwattr $C$DW$346, DW_AT_decl_line(0x40)
    6046                      .dwattr $C$DW$346, DW_AT_decl_column(0x10)
    6047              
    6048              $C$DW$347       .dwtag  DW_TAG_member
    6049                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$27)
    6050                      .dwattr $C$DW$347, DW_AT_name("h_phaseVect")
    6051                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6052                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6053                      .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6054                      .dwattr $C$DW$347, DW_AT_decl_line(0x41)
    6055                      .dwattr $C$DW$347, DW_AT_decl_column(0x10)
    6056              
    6057              $C$DW$348       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    6059                      .dwattr $C$DW$348, DW_AT_name("gh_magVect")
    6060                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6061                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6062                      .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6063                      .dwattr $C$DW$348, DW_AT_decl_line(0x42)
    6064                      .dwattr $C$DW$348, DW_AT_decl_column(0x10)
    6065              
    6066              $C$DW$349       .dwtag  DW_TAG_member
    6067                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
    6068                      .dwattr $C$DW$349, DW_AT_name("gh_phaseVect")
    6069                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6070                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6071                      .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6072                      .dwattr $C$DW$349, DW_AT_decl_line(0x43)
    6073                      .dwattr $C$DW$349, DW_AT_decl_column(0x10)
    6074              
    6075              $C$DW$350       .dwtag  DW_TAG_member
    6076                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$27)
    6077                      .dwattr $C$DW$350, DW_AT_name("cl_magVect")
    6078                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6079                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6080                      .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6081                      .dwattr $C$DW$350, DW_AT_decl_line(0x44)
    6082                      .dwattr $C$DW$350, DW_AT_decl_column(0x10)
    6083              
    6084              $C$DW$351       .dwtag  DW_TAG_member
    6085                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$27)
    6086                      .dwattr $C$DW$351, DW_AT_name("cl_phaseVect")
    6087                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6088                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6089                      .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6090                      .dwattr $C$DW$351, DW_AT_decl_line(0x45)
    6091                      .dwattr $C$DW$351, DW_AT_decl_column(0x10)
    6092              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  122

    6093              $C$DW$352       .dwtag  DW_TAG_member
    6094                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$27)
    6095                      .dwattr $C$DW$352, DW_AT_name("freqVect")
    6096                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6097                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6098                      .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6099                      .dwattr $C$DW$352, DW_AT_decl_line(0x46)
    6100                      .dwattr $C$DW$352, DW_AT_decl_column(0x10)
    6101              
    6102              $C$DW$353       .dwtag  DW_TAG_member
    6103                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
    6104                      .dwattr $C$DW$353, DW_AT_name("amplitude")
    6105                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6106                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6107                      .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6108                      .dwattr $C$DW$353, DW_AT_decl_line(0x47)
    6109                      .dwattr $C$DW$353, DW_AT_decl_column(0x0f)
    6110              
    6111              $C$DW$354       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$26)
    6113                      .dwattr $C$DW$354, DW_AT_name("isrFreq")
    6114                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6115                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6116                      .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6117                      .dwattr $C$DW$354, DW_AT_decl_line(0x48)
    6118                      .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    6119              
    6120              $C$DW$355       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$26)
    6122                      .dwattr $C$DW$355, DW_AT_name("freqStart")
    6123                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6124                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6125                      .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6126                      .dwattr $C$DW$355, DW_AT_decl_line(0x49)
    6127                      .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    6128              
    6129              $C$DW$356       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$26)
    6131                      .dwattr $C$DW$356, DW_AT_name("freqStep")
    6132                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6133                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6134                      .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6135                      .dwattr $C$DW$356, DW_AT_decl_line(0x4a)
    6136                      .dwattr $C$DW$356, DW_AT_decl_column(0x0f)
    6137              
    6138              $C$DW$357       .dwtag  DW_TAG_member
    6139                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    6140                      .dwattr $C$DW$357, DW_AT_name("start")
    6141                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6142                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6143                      .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6144                      .dwattr $C$DW$357, DW_AT_decl_line(0x4b)
    6145                      .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    6146              
    6147              $C$DW$358       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  123

    6148                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    6149                      .dwattr $C$DW$358, DW_AT_name("state")
    6150                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6151                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6152                      .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6153                      .dwattr $C$DW$358, DW_AT_decl_line(0x4c)
    6154                      .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    6155              
    6156              $C$DW$359       .dwtag  DW_TAG_member
    6157                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    6158                      .dwattr $C$DW$359, DW_AT_name("status")
    6159                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6160                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6161                      .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6162                      .dwattr $C$DW$359, DW_AT_decl_line(0x4d)
    6163                      .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    6164              
    6165              $C$DW$360       .dwtag  DW_TAG_member
    6166                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
    6167                      .dwattr $C$DW$360, DW_AT_name("vecLength")
    6168                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6169                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6170                      .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6171                      .dwattr $C$DW$360, DW_AT_decl_line(0x4e)
    6172                      .dwattr $C$DW$360, DW_AT_decl_column(0x0d)
    6173              
    6174              $C$DW$361       .dwtag  DW_TAG_member
    6175                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    6176                      .dwattr $C$DW$361, DW_AT_name("freqIndex")
    6177                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6178                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6179                      .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6180                      .dwattr $C$DW$361, DW_AT_decl_line(0x4f)
    6181                      .dwattr $C$DW$361, DW_AT_decl_column(0x0d)
    6182              
    6183              $C$DW$362       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    6185                      .dwattr $C$DW$362, DW_AT_name("storeH")
    6186                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6187                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6188                      .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6189                      .dwattr $C$DW$362, DW_AT_decl_line(0x50)
    6190                      .dwattr $C$DW$362, DW_AT_decl_column(0x0d)
    6191              
    6192              $C$DW$363       .dwtag  DW_TAG_member
    6193                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    6194                      .dwattr $C$DW$363, DW_AT_name("storeGH")
    6195                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6196                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6197                      .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6198                      .dwattr $C$DW$363, DW_AT_decl_line(0x51)
    6199                      .dwattr $C$DW$363, DW_AT_decl_column(0x0d)
    6200              
    6201              $C$DW$364       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  124

    6203                      .dwattr $C$DW$364, DW_AT_name("storeCL")
    6204                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6205                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6206                      .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6207                      .dwattr $C$DW$364, DW_AT_decl_line(0x52)
    6208                      .dwattr $C$DW$364, DW_AT_decl_column(0x0d)
    6209              
    6210              $C$DW$365       .dwtag  DW_TAG_member
    6211                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    6212                      .dwattr $C$DW$365, DW_AT_name("speed")
    6213                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6214                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6215                      .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra/
    6216                      .dwattr $C$DW$365, DW_AT_decl_line(0x53)
    6217                      .dwattr $C$DW$365, DW_AT_decl_column(0x0d)
    6218              
    6219                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra
    6220                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
    6221                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x0f)
    6222                      .dwendtag $C$DW$T$30
    6223              
    6224                      .dwendtag $C$DW$TU$30
    6225              
    6226              
    6227              $C$DW$TU$67     .dwtag  DW_TAG_type_unit
    6228                      .dwmtype  $C$DW$T$67
    6229              $C$DW$T$67      .dwtag  DW_TAG_typedef
    6230                      .dwattr $C$DW$T$67, DW_AT_name("SFRA_F32")
    6231                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$30)
    6232                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/libraries/sfra
    6233                      .dwattr $C$DW$T$67, DW_AT_decl_line(0x54)
    6234                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    6235              
    6236                      .dwendtag $C$DW$TU$67
    6237              
    6238              
    6239              $C$DW$TU$68     .dwtag  DW_TAG_type_unit
    6240                      .dwmtype  $C$DW$T$68
    6241              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    6242                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    6243                      .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    6244              
    6245                      .dwendtag $C$DW$TU$68
    6246              
    6247              
    6248              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    6249                      .dwmtype  $C$DW$T$32
    6250              
    6251              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6252                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
    6253              $C$DW$366       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$31)
    6255                      .dwattr $C$DW$366, DW_AT_name("iref_A")
    6256                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6257                      .dwattr $C$DW$366, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  125

    6258                      .dwattr $C$DW$366, DW_AT_decl_line(0x8e)
    6259                      .dwattr $C$DW$366, DW_AT_decl_column(0x18)
    6260              
    6261              $C$DW$367       .dwtag  DW_TAG_member
    6262                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$31)
    6263                      .dwattr $C$DW$367, DW_AT_name("vref_charge_V")
    6264                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6265                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6266                      .dwattr $C$DW$367, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6267                      .dwattr $C$DW$367, DW_AT_decl_line(0x8f)
    6268                      .dwattr $C$DW$367, DW_AT_decl_column(0x18)
    6269              
    6270              $C$DW$368       .dwtag  DW_TAG_member
    6271                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$31)
    6272                      .dwattr $C$DW$368, DW_AT_name("vref_discharge_V")
    6273                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6274                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6275                      .dwattr $C$DW$368, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6276                      .dwattr $C$DW$368, DW_AT_decl_line(0x90)
    6277                      .dwattr $C$DW$368, DW_AT_decl_column(0x18)
    6278              
    6279              $C$DW$369       .dwtag  DW_TAG_member
    6280                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    6281                      .dwattr $C$DW$369, DW_AT_name("direction_logic")
    6282                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6283                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6284                      .dwattr $C$DW$369, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6285                      .dwattr $C$DW$369, DW_AT_decl_line(0x91)
    6286                      .dwattr $C$DW$369, DW_AT_decl_column(0x18)
    6287              
    6288              $C$DW$370       .dwtag  DW_TAG_member
    6289                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    6290                      .dwattr $C$DW$370, DW_AT_name("enable_logic")
    6291                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6292                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6293                      .dwattr $C$DW$370, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6294                      .dwattr $C$DW$370, DW_AT_decl_line(0x92)
    6295                      .dwattr $C$DW$370, DW_AT_decl_column(0x18)
    6296              
    6297              $C$DW$371       .dwtag  DW_TAG_member
    6298                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$31)
    6299                      .dwattr $C$DW$371, DW_AT_name("dutyRef_pu")
    6300                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6301                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6302                      .dwattr $C$DW$371, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6303                      .dwattr $C$DW$371, DW_AT_decl_line(0x93)
    6304                      .dwattr $C$DW$371, DW_AT_decl_column(0x18)
    6305              
    6306              $C$DW$372       .dwtag  DW_TAG_member
    6307                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$31)
    6308                      .dwattr $C$DW$372, DW_AT_name("ioutCal_pu")
    6309                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6310                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6311                      .dwattr $C$DW$372, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6312                      .dwattr $C$DW$372, DW_AT_decl_line(0x94)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  126

    6313                      .dwattr $C$DW$372, DW_AT_decl_column(0x18)
    6314              
    6315              $C$DW$373       .dwtag  DW_TAG_member
    6316                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$31)
    6317                      .dwattr $C$DW$373, DW_AT_name("voutCal_pu")
    6318                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6319                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6320                      .dwattr $C$DW$373, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6321                      .dwattr $C$DW$373, DW_AT_decl_line(0x95)
    6322                      .dwattr $C$DW$373, DW_AT_decl_column(0x18)
    6323              
    6324              $C$DW$374       .dwtag  DW_TAG_member
    6325                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    6326                      .dwattr $C$DW$374, DW_AT_name("IoutGain_pu")
    6327                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6328                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6329                      .dwattr $C$DW$374, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6330                      .dwattr $C$DW$374, DW_AT_decl_line(0x97)
    6331                      .dwattr $C$DW$374, DW_AT_decl_column(0x0f)
    6332              
    6333              $C$DW$375       .dwtag  DW_TAG_member
    6334                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$26)
    6335                      .dwattr $C$DW$375, DW_AT_name("IoutOffset_pu")
    6336                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6337                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6338                      .dwattr $C$DW$375, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6339                      .dwattr $C$DW$375, DW_AT_decl_line(0x98)
    6340                      .dwattr $C$DW$375, DW_AT_decl_column(0x0f)
    6341              
    6342              $C$DW$376       .dwtag  DW_TAG_member
    6343                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    6344                      .dwattr $C$DW$376, DW_AT_name("IoutGain_A")
    6345                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6346                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6347                      .dwattr $C$DW$376, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6348                      .dwattr $C$DW$376, DW_AT_decl_line(0x99)
    6349                      .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    6350              
    6351              $C$DW$377       .dwtag  DW_TAG_member
    6352                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$26)
    6353                      .dwattr $C$DW$377, DW_AT_name("IoutOffset_A")
    6354                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6355                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6356                      .dwattr $C$DW$377, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6357                      .dwattr $C$DW$377, DW_AT_decl_line(0x9a)
    6358                      .dwattr $C$DW$377, DW_AT_decl_column(0x0f)
    6359              
    6360              $C$DW$378       .dwtag  DW_TAG_member
    6361                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$26)
    6362                      .dwattr $C$DW$378, DW_AT_name("VoutGain_pu")
    6363                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6364                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6365                      .dwattr $C$DW$378, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6366                      .dwattr $C$DW$378, DW_AT_decl_line(0x9c)
    6367                      .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  127

    6368              
    6369              $C$DW$379       .dwtag  DW_TAG_member
    6370                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    6371                      .dwattr $C$DW$379, DW_AT_name("VoutOffset_pu")
    6372                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6373                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6374                      .dwattr $C$DW$379, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6375                      .dwattr $C$DW$379, DW_AT_decl_line(0x9d)
    6376                      .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    6377              
    6378              $C$DW$380       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$26)
    6380                      .dwattr $C$DW$380, DW_AT_name("VoutGain_V")
    6381                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6382                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6383                      .dwattr $C$DW$380, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6384                      .dwattr $C$DW$380, DW_AT_decl_line(0x9e)
    6385                      .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    6386              
    6387              $C$DW$381       .dwtag  DW_TAG_member
    6388                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$26)
    6389                      .dwattr $C$DW$381, DW_AT_name("VoutOffset_V")
    6390                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6391                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6392                      .dwattr $C$DW$381, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6393                      .dwattr $C$DW$381, DW_AT_decl_line(0x9f)
    6394                      .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    6395              
    6396              $C$DW$382       .dwtag  DW_TAG_member
    6397                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    6398                      .dwattr $C$DW$382, DW_AT_name("pendingUpdate")
    6399                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6400                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6401                      .dwattr $C$DW$382, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6402                      .dwattr $C$DW$382, DW_AT_decl_line(0xa1)
    6403                      .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    6404              
    6405                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6406                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x8d)
    6407                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    6408                      .dwendtag $C$DW$T$32
    6409              
    6410                      .dwendtag $C$DW$TU$32
    6411              
    6412              
    6413              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    6414                      .dwmtype  $C$DW$T$70
    6415              $C$DW$T$70      .dwtag  DW_TAG_typedef
    6416                      .dwattr $C$DW$T$70, DW_AT_name("BTS_userInput")
    6417                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    6418                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6419                      .dwattr $C$DW$T$70, DW_AT_decl_line(0xa3)
    6420                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    6421              
    6422                      .dwendtag $C$DW$TU$70
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  128

    6423              
    6424              
    6425              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    6426                      .dwmtype  $C$DW$T$71
    6427              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6428                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6429                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    6430              
    6431                      .dwendtag $C$DW$TU$71
    6432              
    6433              
    6434              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    6435                      .dwmtype  $C$DW$T$72
    6436              
    6437              $C$DW$T$72      .dwtag  DW_TAG_array_type
    6438                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$70)
    6439              $C$DW$383       .dwtag  DW_TAG_subrange_type
    6440              
    6441                      .dwendtag $C$DW$T$72
    6442              
    6443                      .dwendtag $C$DW$TU$72
    6444              
    6445              
    6446              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    6447                      .dwmtype  $C$DW$T$33
    6448              
    6449              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6450                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    6451              $C$DW$384       .dwtag  DW_TAG_member
    6452                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
    6453                      .dwattr $C$DW$384, DW_AT_name("dutySet_pu")
    6454                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6455                      .dwattr $C$DW$384, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6456                      .dwattr $C$DW$384, DW_AT_decl_line(0xb1)
    6457                      .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    6458              
    6459              $C$DW$385       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$26)
    6461                      .dwattr $C$DW$385, DW_AT_name("dutySetRef_pu")
    6462                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6463                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6464                      .dwattr $C$DW$385, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6465                      .dwattr $C$DW$385, DW_AT_decl_line(0xb2)
    6466                      .dwattr $C$DW$385, DW_AT_decl_column(0x0f)
    6467              
    6468              $C$DW$386       .dwtag  DW_TAG_member
    6469                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$26)
    6470                      .dwattr $C$DW$386, DW_AT_name("ioutRef_pu")
    6471                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6472                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6473                      .dwattr $C$DW$386, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6474                      .dwattr $C$DW$386, DW_AT_decl_line(0xb4)
    6475                      .dwattr $C$DW$386, DW_AT_decl_column(0x0f)
    6476              
    6477              $C$DW$387       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  129

    6478                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$26)
    6479                      .dwattr $C$DW$387, DW_AT_name("ioutSet_pu")
    6480                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6481                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6482                      .dwattr $C$DW$387, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6483                      .dwattr $C$DW$387, DW_AT_decl_line(0xb5)
    6484                      .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    6485              
    6486              $C$DW$388       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$26)
    6488                      .dwattr $C$DW$388, DW_AT_name("ioutSense_pu")
    6489                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6490                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6491                      .dwattr $C$DW$388, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6492                      .dwattr $C$DW$388, DW_AT_decl_line(0xb6)
    6493                      .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    6494              
    6495              $C$DW$389       .dwtag  DW_TAG_member
    6496                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$26)
    6497                      .dwattr $C$DW$389, DW_AT_name("voutRef_pu")
    6498                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6499                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6500                      .dwattr $C$DW$389, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6501                      .dwattr $C$DW$389, DW_AT_decl_line(0xb8)
    6502                      .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    6503              
    6504              $C$DW$390       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$26)
    6506                      .dwattr $C$DW$390, DW_AT_name("voutSet_pu")
    6507                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6508                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6509                      .dwattr $C$DW$390, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6510                      .dwattr $C$DW$390, DW_AT_decl_line(0xb9)
    6511                      .dwattr $C$DW$390, DW_AT_decl_column(0x0f)
    6512              
    6513              $C$DW$391       .dwtag  DW_TAG_member
    6514                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$26)
    6515                      .dwattr $C$DW$391, DW_AT_name("voutSense_pu")
    6516                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6517                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6518                      .dwattr $C$DW$391, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6519                      .dwattr $C$DW$391, DW_AT_decl_line(0xba)
    6520                      .dwattr $C$DW$391, DW_AT_decl_column(0x0f)
    6521              
    6522              $C$DW$392       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$26)
    6524                      .dwattr $C$DW$392, DW_AT_name("uk_cc_pu")
    6525                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6526                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6527                      .dwattr $C$DW$392, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6528                      .dwattr $C$DW$392, DW_AT_decl_line(0xbc)
    6529                      .dwattr $C$DW$392, DW_AT_decl_column(0x0f)
    6530              
    6531              $C$DW$393       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  130

    6533                      .dwattr $C$DW$393, DW_AT_name("ek_cc_pu")
    6534                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6535                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6536                      .dwattr $C$DW$393, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6537                      .dwattr $C$DW$393, DW_AT_decl_line(0xbd)
    6538                      .dwattr $C$DW$393, DW_AT_decl_column(0x0f)
    6539              
    6540              $C$DW$394       .dwtag  DW_TAG_member
    6541                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$26)
    6542                      .dwattr $C$DW$394, DW_AT_name("uk_cv_pu")
    6543                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6544                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6545                      .dwattr $C$DW$394, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6546                      .dwattr $C$DW$394, DW_AT_decl_line(0xbe)
    6547                      .dwattr $C$DW$394, DW_AT_decl_column(0x0f)
    6548              
    6549              $C$DW$395       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$26)
    6551                      .dwattr $C$DW$395, DW_AT_name("ek_cv_pu")
    6552                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6553                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6554                      .dwattr $C$DW$395, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6555                      .dwattr $C$DW$395, DW_AT_decl_line(0xbf)
    6556                      .dwattr $C$DW$395, DW_AT_decl_column(0x0f)
    6557              
    6558              $C$DW$396       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$26)
    6560                      .dwattr $C$DW$396, DW_AT_name("direction_coeff")
    6561                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6562                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6563                      .dwattr $C$DW$396, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6564                      .dwattr $C$DW$396, DW_AT_decl_line(0xc0)
    6565                      .dwattr $C$DW$396, DW_AT_decl_column(0x0f)
    6566              
    6567              $C$DW$397       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$26)
    6569                      .dwattr $C$DW$397, DW_AT_name("dutyH_pu")
    6570                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6571                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6572                      .dwattr $C$DW$397, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6573                      .dwattr $C$DW$397, DW_AT_decl_line(0xc2)
    6574                      .dwattr $C$DW$397, DW_AT_decl_column(0x0f)
    6575              
    6576              $C$DW$398       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$26)
    6578                      .dwattr $C$DW$398, DW_AT_name("dutyL_pu")
    6579                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6580                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6581                      .dwattr $C$DW$398, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6582                      .dwattr $C$DW$398, DW_AT_decl_line(0xc3)
    6583                      .dwattr $C$DW$398, DW_AT_decl_column(0x0f)
    6584              
    6585              $C$DW$399       .dwtag  DW_TAG_member
    6586                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    6587                      .dwattr $C$DW$399, DW_AT_name("ctrlMode_logic")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  131

    6588                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6589                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6590                      .dwattr $C$DW$399, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6591                      .dwattr $C$DW$399, DW_AT_decl_line(0xc5)
    6592                      .dwattr $C$DW$399, DW_AT_decl_column(0x0e)
    6593              
    6594              $C$DW$400       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    6596                      .dwattr $C$DW$400, DW_AT_name("direction_logic")
    6597                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6598                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6599                      .dwattr $C$DW$400, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6600                      .dwattr $C$DW$400, DW_AT_decl_line(0xc6)
    6601                      .dwattr $C$DW$400, DW_AT_decl_column(0x0e)
    6602              
    6603              $C$DW$401       .dwtag  DW_TAG_member
    6604                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    6605                      .dwattr $C$DW$401, DW_AT_name("ioutTrip_16b")
    6606                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6607                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6608                      .dwattr $C$DW$401, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6609                      .dwattr $C$DW$401, DW_AT_decl_line(0xc8)
    6610                      .dwattr $C$DW$401, DW_AT_decl_column(0x0d)
    6611              
    6612              $C$DW$402       .dwtag  DW_TAG_member
    6613                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$29)
    6614                      .dwattr $C$DW$402, DW_AT_name("ioutTrip_n_16b")
    6615                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6616                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6617                      .dwattr $C$DW$402, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6618                      .dwattr $C$DW$402, DW_AT_decl_line(0xc9)
    6619                      .dwattr $C$DW$402, DW_AT_decl_column(0x0d)
    6620              
    6621              $C$DW$403       .dwtag  DW_TAG_member
    6622                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    6623                      .dwattr $C$DW$403, DW_AT_name("tripFlag")
    6624                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6625                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6626                      .dwattr $C$DW$403, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6627                      .dwattr $C$DW$403, DW_AT_decl_line(0xca)
    6628                      .dwattr $C$DW$403, DW_AT_decl_column(0x0e)
    6629              
    6630                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6631                      .dwattr $C$DW$T$33, DW_AT_decl_line(0xb0)
    6632                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6633                      .dwendtag $C$DW$T$33
    6634              
    6635                      .dwendtag $C$DW$TU$33
    6636              
    6637              
    6638              $C$DW$TU$75     .dwtag  DW_TAG_type_unit
    6639                      .dwmtype  $C$DW$T$75
    6640              $C$DW$T$75      .dwtag  DW_TAG_typedef
    6641                      .dwattr $C$DW$T$75, DW_AT_name("BTS_ctrlLoopVariable")
    6642                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  132

    6643                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6644                      .dwattr $C$DW$T$75, DW_AT_decl_line(0xcc)
    6645                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
    6646              
    6647                      .dwendtag $C$DW$TU$75
    6648              
    6649              
    6650              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
    6651                      .dwmtype  $C$DW$T$76
    6652              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    6653                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    6654                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    6655              
    6656                      .dwendtag $C$DW$TU$76
    6657              
    6658              
    6659              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    6660                      .dwmtype  $C$DW$T$77
    6661              
    6662              $C$DW$T$77      .dwtag  DW_TAG_array_type
    6663                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$75)
    6664              $C$DW$404       .dwtag  DW_TAG_subrange_type
    6665              
    6666                      .dwendtag $C$DW$T$77
    6667              
    6668                      .dwendtag $C$DW$TU$77
    6669              
    6670              
    6671              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    6672                      .dwmtype  $C$DW$T$35
    6673              
    6674              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6675                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x52)
    6676              $C$DW$405       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$26)
    6678                      .dwattr $C$DW$405, DW_AT_name("Isense_A")
    6679                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6680                      .dwattr $C$DW$405, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6681                      .dwattr $C$DW$405, DW_AT_decl_line(0x5f)
    6682                      .dwattr $C$DW$405, DW_AT_decl_column(0x0f)
    6683              
    6684              $C$DW$406       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$26)
    6686                      .dwattr $C$DW$406, DW_AT_name("Vsense_V")
    6687                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6688                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6689                      .dwattr $C$DW$406, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6690                      .dwattr $C$DW$406, DW_AT_decl_line(0x60)
    6691                      .dwattr $C$DW$406, DW_AT_decl_column(0x0f)
    6692              
    6693              $C$DW$407       .dwtag  DW_TAG_member
    6694                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$34)
    6695                      .dwattr $C$DW$407, DW_AT_name("Isense_16b")
    6696                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6697                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  133

    6698                      .dwattr $C$DW$407, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6699                      .dwattr $C$DW$407, DW_AT_decl_line(0x61)
    6700                      .dwattr $C$DW$407, DW_AT_decl_column(0x0d)
    6701              
    6702              $C$DW$408       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$34)
    6704                      .dwattr $C$DW$408, DW_AT_name("Vsense_16b")
    6705                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6706                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6707                      .dwattr $C$DW$408, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6708                      .dwattr $C$DW$408, DW_AT_decl_line(0x62)
    6709                      .dwattr $C$DW$408, DW_AT_decl_column(0x0d)
    6710              
    6711              $C$DW$409       .dwtag  DW_TAG_member
    6712                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    6713                      .dwattr $C$DW$409, DW_AT_name("Sum_I")
    6714                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6715                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6716                      .dwattr $C$DW$409, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6717                      .dwattr $C$DW$409, DW_AT_decl_line(0x63)
    6718                      .dwattr $C$DW$409, DW_AT_decl_column(0x0d)
    6719              
    6720              $C$DW$410       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$23)
    6722                      .dwattr $C$DW$410, DW_AT_name("Sum_V")
    6723                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6724                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6725                      .dwattr $C$DW$410, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6726                      .dwattr $C$DW$410, DW_AT_decl_line(0x64)
    6727                      .dwattr $C$DW$410, DW_AT_decl_column(0x0d)
    6728              
    6729              $C$DW$411       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    6731                      .dwattr $C$DW$411, DW_AT_name("Index")
    6732                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6733                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6734                      .dwattr $C$DW$411, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6735                      .dwattr $C$DW$411, DW_AT_decl_line(0x65)
    6736                      .dwattr $C$DW$411, DW_AT_decl_column(0x0e)
    6737              
    6738              $C$DW$412       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$26)
    6740                      .dwattr $C$DW$412, DW_AT_name("IoutGain_A")
    6741                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6742                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6743                      .dwattr $C$DW$412, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6744                      .dwattr $C$DW$412, DW_AT_decl_line(0x66)
    6745                      .dwattr $C$DW$412, DW_AT_decl_column(0x0f)
    6746              
    6747              $C$DW$413       .dwtag  DW_TAG_member
    6748                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$26)
    6749                      .dwattr $C$DW$413, DW_AT_name("IoutOffset_A")
    6750                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6751                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6752                      .dwattr $C$DW$413, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  134

    6753                      .dwattr $C$DW$413, DW_AT_decl_line(0x67)
    6754                      .dwattr $C$DW$413, DW_AT_decl_column(0x0f)
    6755              
    6756              $C$DW$414       .dwtag  DW_TAG_member
    6757                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$26)
    6758                      .dwattr $C$DW$414, DW_AT_name("VoutGain_V")
    6759                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6760                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6761                      .dwattr $C$DW$414, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6762                      .dwattr $C$DW$414, DW_AT_decl_line(0x68)
    6763                      .dwattr $C$DW$414, DW_AT_decl_column(0x0f)
    6764              
    6765              $C$DW$415       .dwtag  DW_TAG_member
    6766                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$26)
    6767                      .dwattr $C$DW$415, DW_AT_name("VoutOffset_V")
    6768                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6769                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6770                      .dwattr $C$DW$415, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6771                      .dwattr $C$DW$415, DW_AT_decl_line(0x69)
    6772                      .dwattr $C$DW$415, DW_AT_decl_column(0x0f)
    6773              
    6774                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6775                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5e)
    6776                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    6777                      .dwendtag $C$DW$T$35
    6778              
    6779                      .dwendtag $C$DW$TU$35
    6780              
    6781              
    6782              $C$DW$TU$81     .dwtag  DW_TAG_type_unit
    6783                      .dwmtype  $C$DW$T$81
    6784              $C$DW$T$81      .dwtag  DW_TAG_typedef
    6785                      .dwattr $C$DW$T$81, DW_AT_name("BTS_measValue")
    6786                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    6787                      .dwattr $C$DW$T$81, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6788                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x6b)
    6789                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    6790              
    6791                      .dwendtag $C$DW$TU$81
    6792              
    6793              
    6794              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    6795                      .dwmtype  $C$DW$T$82
    6796              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    6797                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    6798                      .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    6799              
    6800                      .dwendtag $C$DW$TU$82
    6801              
    6802              
    6803              $C$DW$TU$83     .dwtag  DW_TAG_type_unit
    6804                      .dwmtype  $C$DW$T$83
    6805              
    6806              $C$DW$T$83      .dwtag  DW_TAG_array_type
    6807                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  135

    6808              $C$DW$416       .dwtag  DW_TAG_subrange_type
    6809              
    6810                      .dwendtag $C$DW$T$83
    6811              
    6812                      .dwendtag $C$DW$TU$83
    6813              
    6814              
    6815              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    6816                      .dwmtype  $C$DW$T$37
    6817              
    6818              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6819                      .dwattr $C$DW$T$37, DW_AT_name("_Complex_double")
    6820                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    6821              $C$DW$417       .dwtag  DW_TAG_member
    6822                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$36)
    6823                      .dwattr $C$DW$417, DW_AT_name("_Vals")
    6824                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6825                      .dwattr $C$DW$417, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6826                      .dwattr $C$DW$417, DW_AT_decl_line(0xf4)
    6827                      .dwattr $C$DW$417, DW_AT_decl_column(0x14)
    6828              
    6829                      .dwendtag $C$DW$T$37
    6830              
    6831                      .dwendtag $C$DW$TU$37
    6832              
    6833              
    6834              $C$DW$TU$86     .dwtag  DW_TAG_type_unit
    6835                      .dwmtype  $C$DW$T$86
    6836              $C$DW$T$86      .dwtag  DW_TAG_typedef
    6837                      .dwattr $C$DW$T$86, DW_AT_name("_Complex_double")
    6838                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$37)
    6839                      .dwattr $C$DW$T$86, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6840                      .dwattr $C$DW$T$86, DW_AT_decl_line(0xf4)
    6841                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x14)
    6842              
    6843                      .dwendtag $C$DW$TU$86
    6844              
    6845              
    6846              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    6847                      .dwmtype  $C$DW$T$39
    6848              
    6849              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6850                      .dwattr $C$DW$T$39, DW_AT_name("_Complex_float")
    6851                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    6852              $C$DW$418       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$38)
    6854                      .dwattr $C$DW$418, DW_AT_name("_Vals")
    6855                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6856                      .dwattr $C$DW$418, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6857                      .dwattr $C$DW$418, DW_AT_decl_line(0xf4)
    6858                      .dwattr $C$DW$418, DW_AT_decl_column(0x14)
    6859              
    6860                      .dwendtag $C$DW$T$39
    6861              
    6862                      .dwendtag $C$DW$TU$39
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  136

    6863              
    6864              
    6865              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    6866                      .dwmtype  $C$DW$T$87
    6867              $C$DW$T$87      .dwtag  DW_TAG_typedef
    6868                      .dwattr $C$DW$T$87, DW_AT_name("_Complex_float")
    6869                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$39)
    6870                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6871                      .dwattr $C$DW$T$87, DW_AT_decl_line(0xf4)
    6872                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x14)
    6873              
    6874                      .dwendtag $C$DW$TU$87
    6875              
    6876              
    6877              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6878                      .dwmtype  $C$DW$T$41
    6879              
    6880              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6881                      .dwattr $C$DW$T$41, DW_AT_name("_Complex_long_double")
    6882                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6883              $C$DW$419       .dwtag  DW_TAG_member
    6884                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$40)
    6885                      .dwattr $C$DW$419, DW_AT_name("_Vals")
    6886                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6887                      .dwattr $C$DW$419, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6888                      .dwattr $C$DW$419, DW_AT_decl_line(0xf4)
    6889                      .dwattr $C$DW$419, DW_AT_decl_column(0x14)
    6890              
    6891                      .dwendtag $C$DW$T$41
    6892              
    6893                      .dwendtag $C$DW$TU$41
    6894              
    6895              
    6896              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    6897                      .dwmtype  $C$DW$T$89
    6898              $C$DW$T$89      .dwtag  DW_TAG_typedef
    6899                      .dwattr $C$DW$T$89, DW_AT_name("_Complex_long_double")
    6900                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$41)
    6901                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6902                      .dwattr $C$DW$T$89, DW_AT_decl_line(0xf4)
    6903                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x14)
    6904              
    6905                      .dwendtag $C$DW$TU$89
    6906              
    6907              
    6908              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    6909                      .dwmtype  $C$DW$T$2
    6910              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6911                      .dwattr $C$DW$T$2, DW_AT_name("void")
    6912              
    6913                      .dwendtag $C$DW$TU$2
    6914              
    6915              
    6916              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    6917                      .dwmtype  $C$DW$T$90
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  137

    6918              
    6919              $C$DW$T$90      .dwtag  DW_TAG_subroutine_type
    6920                      .dwendtag $C$DW$T$90
    6921              
    6922                      .dwendtag $C$DW$TU$90
    6923              
    6924              
    6925              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    6926                      .dwmtype  $C$DW$T$91
    6927              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    6928                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    6929                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    6930              
    6931                      .dwendtag $C$DW$TU$91
    6932              
    6933              
    6934              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    6935                      .dwmtype  $C$DW$T$4
    6936              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6937                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6938                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6939                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6940              
    6941                      .dwendtag $C$DW$TU$4
    6942              
    6943              
    6944              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    6945                      .dwmtype  $C$DW$T$5
    6946              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6947                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6948                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6949                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6950              
    6951                      .dwendtag $C$DW$TU$5
    6952              
    6953              
    6954              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    6955                      .dwmtype  $C$DW$T$6
    6956              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6957                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6958                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6959                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6960              
    6961                      .dwendtag $C$DW$TU$6
    6962              
    6963              
    6964              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    6965                      .dwmtype  $C$DW$T$7
    6966              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6967                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6968                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6969                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    6970              
    6971                      .dwendtag $C$DW$TU$7
    6972              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  138

    6973              
    6974              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    6975                      .dwmtype  $C$DW$T$8
    6976              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6977                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6978                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6979                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6980              
    6981                      .dwendtag $C$DW$TU$8
    6982              
    6983              
    6984              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    6985                      .dwmtype  $C$DW$T$9
    6986              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6987                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6988                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6989                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6990              
    6991                      .dwendtag $C$DW$TU$9
    6992              
    6993              
    6994              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    6995                      .dwmtype  $C$DW$T$10
    6996              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6997                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6998                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6999                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7000              
    7001                      .dwendtag $C$DW$TU$10
    7002              
    7003              
    7004              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    7005                      .dwmtype  $C$DW$T$28
    7006              $C$DW$T$28      .dwtag  DW_TAG_typedef
    7007                      .dwattr $C$DW$T$28, DW_AT_name("__int16_t")
    7008                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$10)
    7009                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7010                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x40)
    7011                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x1d)
    7012              
    7013                      .dwendtag $C$DW$TU$28
    7014              
    7015              
    7016              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    7017                      .dwmtype  $C$DW$T$29
    7018              $C$DW$T$29      .dwtag  DW_TAG_typedef
    7019                      .dwattr $C$DW$T$29, DW_AT_name("int16_t")
    7020                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    7021                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7022                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x2b)
    7023                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x14)
    7024              
    7025                      .dwendtag $C$DW$TU$29
    7026              
    7027              
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  139

    7028              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    7029                      .dwmtype  $C$DW$T$34
    7030              
    7031              $C$DW$T$34      .dwtag  DW_TAG_array_type
    7032                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    7033                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
    7034              $C$DW$420       .dwtag  DW_TAG_subrange_type
    7035                      .dwattr $C$DW$420, DW_AT_upper_bound(0x1f)
    7036              
    7037                      .dwendtag $C$DW$T$34
    7038              
    7039                      .dwendtag $C$DW$TU$34
    7040              
    7041              
    7042              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
    7043                      .dwmtype  $C$DW$T$11
    7044              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7045                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7046                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7047                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7048              
    7049                      .dwendtag $C$DW$TU$11
    7050              
    7051              
    7052              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    7053                      .dwmtype  $C$DW$T$19
    7054              $C$DW$T$19      .dwtag  DW_TAG_typedef
    7055                      .dwattr $C$DW$T$19, DW_AT_name("__uint16_t")
    7056                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    7057                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7058                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x41)
    7059                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    7060              
    7061                      .dwendtag $C$DW$TU$19
    7062              
    7063              
    7064              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    7065                      .dwmtype  $C$DW$T$20
    7066              $C$DW$T$20      .dwtag  DW_TAG_typedef
    7067                      .dwattr $C$DW$T$20, DW_AT_name("uint16_t")
    7068                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    7069                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7070                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
    7071                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x15)
    7072              
    7073                      .dwendtag $C$DW$TU$20
    7074              
    7075              
    7076              $C$DW$TU$136    .dwtag  DW_TAG_type_unit
    7077                      .dwmtype  $C$DW$T$136
    7078              
    7079              $C$DW$T$136     .dwtag  DW_TAG_array_type
    7080                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$20)
    7081                      .dwattr $C$DW$T$136, DW_AT_byte_size(0x04)
    7082              $C$DW$421       .dwtag  DW_TAG_subrange_type
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  140

    7083                      .dwattr $C$DW$421, DW_AT_upper_bound(0x03)
    7084              
    7085                      .dwendtag $C$DW$T$136
    7086              
    7087                      .dwendtag $C$DW$TU$136
    7088              
    7089              
    7090              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    7091                      .dwmtype  $C$DW$T$21
    7092              $C$DW$422       .dwtag  DW_TAG_TI_far_type
    7093                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    7094              
    7095              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    7096                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$422)
    7097              
    7098                      .dwendtag $C$DW$TU$21
    7099              
    7100              
    7101              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    7102                      .dwmtype  $C$DW$T$12
    7103              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7104                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7105                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7106                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7107              
    7108                      .dwendtag $C$DW$TU$12
    7109              
    7110              
    7111              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    7112                      .dwmtype  $C$DW$T$22
    7113              $C$DW$T$22      .dwtag  DW_TAG_typedef
    7114                      .dwattr $C$DW$T$22, DW_AT_name("__int32_t")
    7115                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$12)
    7116                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7117                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x42)
    7118                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x1d)
    7119              
    7120                      .dwendtag $C$DW$TU$22
    7121              
    7122              
    7123              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    7124                      .dwmtype  $C$DW$T$23
    7125              $C$DW$T$23      .dwtag  DW_TAG_typedef
    7126                      .dwattr $C$DW$T$23, DW_AT_name("int32_t")
    7127                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    7128                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7129                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x30)
    7130                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x14)
    7131              
    7132                      .dwendtag $C$DW$TU$23
    7133              
    7134              
    7135              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    7136                      .dwmtype  $C$DW$T$24
    7137              $C$DW$423       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  141

    7138                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$23)
    7139              
    7140              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    7141                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$423)
    7142              
    7143                      .dwendtag $C$DW$TU$24
    7144              
    7145              
    7146              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    7147                      .dwmtype  $C$DW$T$13
    7148              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7149                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7150                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7151                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7152              
    7153                      .dwendtag $C$DW$TU$13
    7154              
    7155              
    7156              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    7157                      .dwmtype  $C$DW$T$42
    7158              $C$DW$T$42      .dwtag  DW_TAG_typedef
    7159                      .dwattr $C$DW$T$42, DW_AT_name("__uint32_t")
    7160                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$13)
    7161                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7162                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x43)
    7163                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x1c)
    7164              
    7165                      .dwendtag $C$DW$TU$42
    7166              
    7167              
    7168              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    7169                      .dwmtype  $C$DW$T$43
    7170              $C$DW$T$43      .dwtag  DW_TAG_typedef
    7171                      .dwattr $C$DW$T$43, DW_AT_name("uint32_t")
    7172                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    7173                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccs1271/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include
    7174                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x46)
    7175                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x15)
    7176              
    7177                      .dwendtag $C$DW$TU$43
    7178              
    7179              
    7180              $C$DW$TU$14     .dwtag  DW_TAG_type_unit
    7181                      .dwmtype  $C$DW$T$14
    7182              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7183                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7184                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7185                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7186              
    7187                      .dwendtag $C$DW$TU$14
    7188              
    7189              
    7190              $C$DW$TU$15     .dwtag  DW_TAG_type_unit
    7191                      .dwmtype  $C$DW$T$15
    7192              $C$DW$T$15      .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  142

    7193                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7194                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7195                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7196              
    7197                      .dwendtag $C$DW$TU$15
    7198              
    7199              
    7200              $C$DW$TU$16     .dwtag  DW_TAG_type_unit
    7201                      .dwmtype  $C$DW$T$16
    7202              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7203                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7204                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7205                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7206              
    7207                      .dwendtag $C$DW$TU$16
    7208              
    7209              
    7210              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    7211                      .dwmtype  $C$DW$T$38
    7212              
    7213              $C$DW$T$38      .dwtag  DW_TAG_array_type
    7214                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$16)
    7215                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    7216              $C$DW$424       .dwtag  DW_TAG_subrange_type
    7217                      .dwattr $C$DW$424, DW_AT_upper_bound(0x01)
    7218              
    7219                      .dwendtag $C$DW$T$38
    7220              
    7221                      .dwendtag $C$DW$TU$38
    7222              
    7223              
    7224              $C$DW$TU$110    .dwtag  DW_TAG_type_unit
    7225                      .dwmtype  $C$DW$T$110
    7226              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    7227                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$16)
    7228                      .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    7229              
    7230                      .dwendtag $C$DW$TU$110
    7231              
    7232              
    7233              $C$DW$TU$146    .dwtag  DW_TAG_type_unit
    7234                      .dwmtype  $C$DW$T$146
    7235              $C$DW$425       .dwtag  DW_TAG_TI_far_type
    7236                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$16)
    7237              
    7238              $C$DW$T$146     .dwtag  DW_TAG_const_type
    7239                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$425)
    7240              
    7241                      .dwendtag $C$DW$TU$146
    7242              
    7243              
    7244              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    7245                      .dwmtype  $C$DW$T$26
    7246              $C$DW$T$26      .dwtag  DW_TAG_typedef
    7247                      .dwattr $C$DW$T$26, DW_AT_name("float32_t")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  143

    7248                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$16)
    7249                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\c2000\C2000Ware_DigitalPower_SDK_5_03_00_00\c2000ware\driv
    7250                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x64)
    7251                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x17)
    7252              
    7253                      .dwendtag $C$DW$TU$26
    7254              
    7255              
    7256              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    7257                      .dwmtype  $C$DW$T$27
    7258              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    7259                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    7260                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    7261              
    7262                      .dwendtag $C$DW$TU$27
    7263              
    7264              
    7265              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    7266                      .dwmtype  $C$DW$T$31
    7267              $C$DW$426       .dwtag  DW_TAG_TI_far_type
