TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Tue Mar  2 07:24:44 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    7572                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/dri
    7573                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x5d)
    7574                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    7575                      .dwendtag $C$DW$T$102
    7576              
    7577                      .dwendtag $C$DW$TU$102
    7578              
    7579              
    7580              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    7581                      .dwmtype  $C$DW$T$103
    7582              $C$DW$T$103     .dwtag  DW_TAG_typedef
    7583                      .dwattr $C$DW$T$103, DW_AT_name("SPI_TransferProtocol")
    7584                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    7585                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/dri
    7586                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x66)
    7587                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    7588              
    7589                      .dwendtag $C$DW$TU$103
    7590              
    7591              
    7592              $C$DW$TU$104    .dwtag  DW_TAG_type_unit
    7593                      .dwmtype  $C$DW$T$104
    7594              
    7595              $C$DW$T$104     .dwtag  DW_TAG_enumeration_type
    7596                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    7597              $C$DW$566       .dwtag  DW_TAG_enumerator
    7598                      .dwattr $C$DW$566, DW_AT_name("SPI_MODE_SLAVE")
    7599                      .dwattr $C$DW$566, DW_AT_const_value(0x02)
    7600                      .dwattr $C$DW$566, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    7601                      .dwattr $C$DW$566, DW_AT_decl_line(0x6f)
    7602                      .dwattr $C$DW$566, DW_AT_decl_column(0x05)
    7603              
    7604              $C$DW$567       .dwtag  DW_TAG_enumerator
    7605                      .dwattr $C$DW$567, DW_AT_name("SPI_MODE_MASTER")
    7606                      .dwattr $C$DW$567, DW_AT_const_value(0x06)
    7607                      .dwattr $C$DW$567, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    7608                      .dwattr $C$DW$567, DW_AT_decl_line(0x70)
    7609                      .dwattr $C$DW$567, DW_AT_decl_column(0x05)
    7610              
    7611              $C$DW$568       .dwtag  DW_TAG_enumerator
    7612                      .dwattr $C$DW$568, DW_AT_name("SPI_MODE_SLAVE_OD")
    7613                      .dwattr $C$DW$568, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  152

    7614                      .dwattr $C$DW$568, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    7615                      .dwattr $C$DW$568, DW_AT_decl_line(0x71)
    7616                      .dwattr $C$DW$568, DW_AT_decl_column(0x05)
    7617              
    7618              $C$DW$569       .dwtag  DW_TAG_enumerator
    7619                      .dwattr $C$DW$569, DW_AT_name("SPI_MODE_MASTER_OD")
    7620                      .dwattr $C$DW$569, DW_AT_const_value(0x04)
    7621                      .dwattr $C$DW$569, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    7622                      .dwattr $C$DW$569, DW_AT_decl_line(0x72)
    7623                      .dwattr $C$DW$569, DW_AT_decl_column(0x05)
    7624              
    7625                      .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/dri
    7626                      .dwattr $C$DW$T$104, DW_AT_decl_line(0x6e)
    7627                      .dwattr $C$DW$T$104, DW_AT_decl_column(0x01)
    7628                      .dwendtag $C$DW$T$104
    7629              
    7630                      .dwendtag $C$DW$TU$104
    7631              
    7632              
    7633              $C$DW$TU$105    .dwtag  DW_TAG_type_unit
    7634                      .dwmtype  $C$DW$T$105
    7635              $C$DW$T$105     .dwtag  DW_TAG_typedef
    7636                      .dwattr $C$DW$T$105, DW_AT_name("SPI_Mode")
    7637                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    7638                      .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/dri
    7639                      .dwattr $C$DW$T$105, DW_AT_decl_line(0x73)
    7640                      .dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
    7641              
    7642                      .dwendtag $C$DW$TU$105
    7643              
    7644              
    7645              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    7646                      .dwmtype  $C$DW$T$25
    7647              
    7648              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7649                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    7650              $C$DW$570       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
    7652                      .dwattr $C$DW$570, DW_AT_name("response")
    7653                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7654                      .dwattr $C$DW$570, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7655                      .dwattr $C$DW$570, DW_AT_decl_line(0x35)
    7656                      .dwattr $C$DW$570, DW_AT_decl_column(0x17)
    7657              
    7658              $C$DW$571       .dwtag  DW_TAG_member
    7659                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$21)
    7660                      .dwattr $C$DW$571, DW_AT_name("crc")
    7661                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7662                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    7663                      .dwattr $C$DW$571, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7664                      .dwattr $C$DW$571, DW_AT_decl_line(0x36)
    7665                      .dwattr $C$DW$571, DW_AT_decl_column(0x17)
    7666              
    7667              $C$DW$572       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  153

    7669                      .dwattr $C$DW$572, DW_AT_name("channel0")
    7670                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7671                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    7672                      .dwattr $C$DW$572, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7673                      .dwattr $C$DW$572, DW_AT_decl_line(0x37)
    7674                      .dwattr $C$DW$572, DW_AT_decl_column(0x16)
    7675              
    7676              $C$DW$573       .dwtag  DW_TAG_member
    7677                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    7678                      .dwattr $C$DW$573, DW_AT_name("channel1")
    7679                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7680                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    7681                      .dwattr $C$DW$573, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7682                      .dwattr $C$DW$573, DW_AT_decl_line(0x38)
    7683                      .dwattr $C$DW$573, DW_AT_decl_column(0x16)
    7684              
    7685              $C$DW$574       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    7687                      .dwattr $C$DW$574, DW_AT_name("channel2")
    7688                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7689                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    7690                      .dwattr $C$DW$574, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7691                      .dwattr $C$DW$574, DW_AT_decl_line(0x39)
    7692                      .dwattr $C$DW$574, DW_AT_decl_column(0x16)
    7693              
    7694              $C$DW$575       .dwtag  DW_TAG_member
    7695                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$24)
    7696                      .dwattr $C$DW$575, DW_AT_name("channel3")
    7697                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7698                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    7699                      .dwattr $C$DW$575, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7700                      .dwattr $C$DW$575, DW_AT_decl_line(0x3a)
    7701                      .dwattr $C$DW$575, DW_AT_decl_column(0x16)
    7702              
    7703              $C$DW$576       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    7705                      .dwattr $C$DW$576, DW_AT_name("channel4")
    7706                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7707                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    7708                      .dwattr $C$DW$576, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7709                      .dwattr $C$DW$576, DW_AT_decl_line(0x3b)
    7710                      .dwattr $C$DW$576, DW_AT_decl_column(0x16)
    7711              
    7712              $C$DW$577       .dwtag  DW_TAG_member
    7713                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    7714                      .dwattr $C$DW$577, DW_AT_name("channel5")
    7715                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7716                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    7717                      .dwattr $C$DW$577, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7718                      .dwattr $C$DW$577, DW_AT_decl_line(0x3c)
    7719                      .dwattr $C$DW$577, DW_AT_decl_column(0x16)
    7720              
    7721              $C$DW$578       .dwtag  DW_TAG_member
    7722                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    7723                      .dwattr $C$DW$578, DW_AT_name("channel6")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  154

    7724                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7725                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    7726                      .dwattr $C$DW$578, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7727                      .dwattr $C$DW$578, DW_AT_decl_line(0x3d)
    7728                      .dwattr $C$DW$578, DW_AT_decl_column(0x16)
    7729              
    7730              $C$DW$579       .dwtag  DW_TAG_member
    7731                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
    7732                      .dwattr $C$DW$579, DW_AT_name("channel7")
    7733                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7734                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    7735                      .dwattr $C$DW$579, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7736                      .dwattr $C$DW$579, DW_AT_decl_line(0x3e)
    7737                      .dwattr $C$DW$579, DW_AT_decl_column(0x16)
    7738              
    7739                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7740                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x34)
    7741                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7742                      .dwendtag $C$DW$T$25
    7743              
    7744                      .dwendtag $C$DW$TU$25
    7745              
    7746              
    7747              $C$DW$TU$106    .dwtag  DW_TAG_type_unit
    7748                      .dwmtype  $C$DW$T$106
    7749              $C$DW$T$106     .dwtag  DW_TAG_typedef
    7750                      .dwattr $C$DW$T$106, DW_AT_name("adc_data")
    7751                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$25)
    7752                      .dwattr $C$DW$T$106, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F28
    7753                      .dwattr $C$DW$T$106, DW_AT_decl_line(0x3f)
    7754                      .dwattr $C$DW$T$106, DW_AT_decl_column(0x03)
    7755              
    7756                      .dwendtag $C$DW$TU$106
    7757              
    7758              
    7759              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    7760                      .dwmtype  $C$DW$T$2
    7761              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7762                      .dwattr $C$DW$T$2, DW_AT_name("void")
    7763              
    7764                      .dwendtag $C$DW$TU$2
    7765              
    7766              
    7767              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    7768                      .dwmtype  $C$DW$T$4
    7769              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7770                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7771                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7772                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7773              
    7774                      .dwendtag $C$DW$TU$4
    7775              
    7776              
    7777              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    7778                      .dwmtype  $C$DW$T$5
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  155

    7779              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7780                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7781                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7782                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7783              
    7784                      .dwendtag $C$DW$TU$5
    7785              
    7786              
    7787              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    7788                      .dwmtype  $C$DW$T$6
    7789              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7790                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7791                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7792                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7793              
    7794                      .dwendtag $C$DW$TU$6
    7795              
    7796              
    7797              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    7798                      .dwmtype  $C$DW$T$7
    7799              $C$DW$T$7       .dwtag  DW_TAG_base_type
