TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Mon Jan 11 05:48:46 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    4761                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    4762                      .dwendtag $C$DW$T$90
    4763              
    4764                      .dwendtag $C$DW$TU$90
    4765              
    4766              
    4767              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    4768                      .dwmtype  $C$DW$T$91
    4769              $C$DW$T$91      .dwtag  DW_TAG_typedef
    4770                      .dwattr $C$DW$T$91, DW_AT_name("SPI_TransferProtocol")
    4771                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4772                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    4773                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x66)
    4774                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE   94

    4775              
    4776                      .dwendtag $C$DW$TU$91
    4777              
    4778              
    4779              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    4780                      .dwmtype  $C$DW$T$92
    4781              
    4782              $C$DW$T$92      .dwtag  DW_TAG_enumeration_type
    4783                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
    4784              $C$DW$370       .dwtag  DW_TAG_enumerator
    4785                      .dwattr $C$DW$370, DW_AT_name("SPI_MODE_SLAVE")
    4786                      .dwattr $C$DW$370, DW_AT_const_value(0x02)
    4787                      .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    4788                      .dwattr $C$DW$370, DW_AT_decl_line(0x6f)
    4789                      .dwattr $C$DW$370, DW_AT_decl_column(0x05)
    4790              
    4791              $C$DW$371       .dwtag  DW_TAG_enumerator
    4792                      .dwattr $C$DW$371, DW_AT_name("SPI_MODE_MASTER")
    4793                      .dwattr $C$DW$371, DW_AT_const_value(0x06)
    4794                      .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    4795                      .dwattr $C$DW$371, DW_AT_decl_line(0x70)
    4796                      .dwattr $C$DW$371, DW_AT_decl_column(0x05)
    4797              
    4798              $C$DW$372       .dwtag  DW_TAG_enumerator
    4799                      .dwattr $C$DW$372, DW_AT_name("SPI_MODE_SLAVE_OD")
    4800                      .dwattr $C$DW$372, DW_AT_const_value(0x00)
    4801                      .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    4802                      .dwattr $C$DW$372, DW_AT_decl_line(0x71)
    4803                      .dwattr $C$DW$372, DW_AT_decl_column(0x05)
    4804              
    4805              $C$DW$373       .dwtag  DW_TAG_enumerator
    4806                      .dwattr $C$DW$373, DW_AT_name("SPI_MODE_MASTER_OD")
    4807                      .dwattr $C$DW$373, DW_AT_const_value(0x04)
    4808                      .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    4809                      .dwattr $C$DW$373, DW_AT_decl_line(0x72)
    4810                      .dwattr $C$DW$373, DW_AT_decl_column(0x05)
    4811              
    4812                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    4813                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x6e)
    4814                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    4815                      .dwendtag $C$DW$T$92
    4816              
    4817                      .dwendtag $C$DW$TU$92
    4818              
    4819              
    4820              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    4821                      .dwmtype  $C$DW$T$93
    4822              $C$DW$T$93      .dwtag  DW_TAG_typedef
    4823                      .dwattr $C$DW$T$93, DW_AT_name("SPI_Mode")
    4824                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4825                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    4826                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x73)
    4827                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    4828              
    4829                      .dwendtag $C$DW$TU$93
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE   95

    4830              
    4831              
    4832              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4833                      .dwmtype  $C$DW$T$25
    4834              
    4835              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4836                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    4837              $C$DW$374       .dwtag  DW_TAG_member
    4838                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    4839                      .dwattr $C$DW$374, DW_AT_name("response")
    4840                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4841                      .dwattr $C$DW$374, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4842                      .dwattr $C$DW$374, DW_AT_decl_line(0x34)
    4843                      .dwattr $C$DW$374, DW_AT_decl_column(0x17)
    4844              
    4845              $C$DW$375       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    4847                      .dwattr $C$DW$375, DW_AT_name("crc")
    4848                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4849                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4850                      .dwattr $C$DW$375, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4851                      .dwattr $C$DW$375, DW_AT_decl_line(0x35)
    4852                      .dwattr $C$DW$375, DW_AT_decl_column(0x17)
    4853              
    4854              $C$DW$376       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$24)
    4856                      .dwattr $C$DW$376, DW_AT_name("channel0")
    4857                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4858                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4859                      .dwattr $C$DW$376, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4860                      .dwattr $C$DW$376, DW_AT_decl_line(0x36)
    4861                      .dwattr $C$DW$376, DW_AT_decl_column(0x16)
    4862              
    4863              $C$DW$377       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$24)
    4865                      .dwattr $C$DW$377, DW_AT_name("channel1")
    4866                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4867                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4868                      .dwattr $C$DW$377, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4869                      .dwattr $C$DW$377, DW_AT_decl_line(0x37)
    4870                      .dwattr $C$DW$377, DW_AT_decl_column(0x16)
    4871              
    4872              $C$DW$378       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$24)
    4874                      .dwattr $C$DW$378, DW_AT_name("channel2")
    4875                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4876                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4877                      .dwattr $C$DW$378, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4878                      .dwattr $C$DW$378, DW_AT_decl_line(0x38)
    4879                      .dwattr $C$DW$378, DW_AT_decl_column(0x16)
    4880              
    4881              $C$DW$379       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$24)
    4883                      .dwattr $C$DW$379, DW_AT_name("channel3")
    4884                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE   96

    4885                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4886                      .dwattr $C$DW$379, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4887                      .dwattr $C$DW$379, DW_AT_decl_line(0x39)
    4888                      .dwattr $C$DW$379, DW_AT_decl_column(0x16)
    4889              
    4890              $C$DW$380       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
    4892                      .dwattr $C$DW$380, DW_AT_name("channel4")
    4893                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4894                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4895                      .dwattr $C$DW$380, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4896                      .dwattr $C$DW$380, DW_AT_decl_line(0x3a)
    4897                      .dwattr $C$DW$380, DW_AT_decl_column(0x16)
    4898              
    4899              $C$DW$381       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    4901                      .dwattr $C$DW$381, DW_AT_name("channel5")
    4902                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4903                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4904                      .dwattr $C$DW$381, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4905                      .dwattr $C$DW$381, DW_AT_decl_line(0x3b)
    4906                      .dwattr $C$DW$381, DW_AT_decl_column(0x16)
    4907              
    4908              $C$DW$382       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    4910                      .dwattr $C$DW$382, DW_AT_name("channel6")
    4911                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4912                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4913                      .dwattr $C$DW$382, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4914                      .dwattr $C$DW$382, DW_AT_decl_line(0x3c)
    4915                      .dwattr $C$DW$382, DW_AT_decl_column(0x16)
    4916              
    4917              $C$DW$383       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    4919                      .dwattr $C$DW$383, DW_AT_name("channel7")
    4920                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4921                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4922                      .dwattr $C$DW$383, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    4923                      .dwattr $C$DW$383, DW_AT_decl_line(0x3d)
    4924                      .dwattr $C$DW$383, DW_AT_decl_column(0x16)
    4925              
    4926                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    4927                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x33)
    4928                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    4929                      .dwendtag $C$DW$T$25
    4930              
    4931                      .dwendtag $C$DW$TU$25
    4932              
    4933              
    4934              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    4935                      .dwmtype  $C$DW$T$94
    4936              $C$DW$T$94      .dwtag  DW_TAG_typedef
    4937                      .dwattr $C$DW$T$94, DW_AT_name("adc_data")
    4938                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$25)
    4939                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
TMS320C2000 Assembler PC v20.2.4 Mon Jan 11 05:48:46 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE   97

    4940                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x3e)
    4941                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    4942              
    4943                      .dwendtag $C$DW$TU$94
    4944              
    4945              
    4946              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    4947                      .dwmtype  $C$DW$T$2
    4948              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4949                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4950              
    4951                      .dwendtag $C$DW$TU$2
    4952              
    4953              
    4954              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    4955                      .dwmtype  $C$DW$T$4
    4956              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4957                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4958                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4959                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4960              
    4961                      .dwendtag $C$DW$TU$4
    4962              
    4963              
    4964              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    4965                      .dwmtype  $C$DW$T$5
    4966              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4967                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4968                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4969                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4970              
    4971                      .dwendtag $C$DW$TU$5
    4972              
    4973              
    4974              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    4975                      .dwmtype  $C$DW$T$6
    4976              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4977                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4978                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4979                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4980              
    4981                      .dwendtag $C$DW$TU$6
    4982              
    4983              
    4984              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    4985                      .dwmtype  $C$DW$T$7
    4986              $C$DW$T$7       .dwtag  DW_TAG_base_type
