TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Tue Aug 13 19:46:07 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    7620                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    7621                      .dwendtag $C$DW$T$102
    7622              
    7623                      .dwendtag $C$DW$TU$102
    7624              
    7625              
    7626              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    7627                      .dwmtype  $C$DW$T$103
    7628              $C$DW$T$103     .dwtag  DW_TAG_typedef
    7629                      .dwattr $C$DW$T$103, DW_AT_name("SPI_TransferProtocol")
    7630                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    7631                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/dri
    7632                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x127)
    7633                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    7634              
    7635                      .dwendtag $C$DW$TU$103
    7636              
    7637              
    7638              $C$DW$TU$104    .dwtag  DW_TAG_type_unit
    7639                      .dwmtype  $C$DW$T$104
    7640              
    7641              $C$DW$T$104     .dwtag  DW_TAG_enumeration_type
    7642                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    7643              $C$DW$582       .dwtag  DW_TAG_enumerator
    7644                      .dwattr $C$DW$582, DW_AT_name("SPI_MODE_PERIPHERAL")
    7645                      .dwattr $C$DW$582, DW_AT_const_value(0x02)
    7646                      .dwattr $C$DW$582, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    7647                      .dwattr $C$DW$582, DW_AT_decl_line(0x130)
    7648                      .dwattr $C$DW$582, DW_AT_decl_column(0x05)
    7649              
    7650              $C$DW$583       .dwtag  DW_TAG_enumerator
    7651                      .dwattr $C$DW$583, DW_AT_name("SPI_MODE_CONTROLLER")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  153

    7652                      .dwattr $C$DW$583, DW_AT_const_value(0x06)
    7653                      .dwattr $C$DW$583, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    7654                      .dwattr $C$DW$583, DW_AT_decl_line(0x131)
    7655                      .dwattr $C$DW$583, DW_AT_decl_column(0x05)
    7656              
    7657              $C$DW$584       .dwtag  DW_TAG_enumerator
    7658                      .dwattr $C$DW$584, DW_AT_name("SPI_MODE_PERIPHERAL_OD")
    7659                      .dwattr $C$DW$584, DW_AT_const_value(0x00)
    7660                      .dwattr $C$DW$584, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    7661                      .dwattr $C$DW$584, DW_AT_decl_line(0x132)
    7662                      .dwattr $C$DW$584, DW_AT_decl_column(0x05)
    7663              
    7664              $C$DW$585       .dwtag  DW_TAG_enumerator
    7665                      .dwattr $C$DW$585, DW_AT_name("SPI_MODE_CONTROLLER_OD")
    7666                      .dwattr $C$DW$585, DW_AT_const_value(0x04)
    7667                      .dwattr $C$DW$585, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/drive
    7668                      .dwattr $C$DW$585, DW_AT_decl_line(0x133)
    7669                      .dwattr $C$DW$585, DW_AT_decl_column(0x05)
    7670              
    7671                      .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/dri
    7672                      .dwattr $C$DW$T$104, DW_AT_decl_line(0x12f)
    7673                      .dwattr $C$DW$T$104, DW_AT_decl_column(0x01)
    7674                      .dwendtag $C$DW$T$104
    7675              
    7676                      .dwendtag $C$DW$TU$104
    7677              
    7678              
    7679              $C$DW$TU$105    .dwtag  DW_TAG_type_unit
    7680                      .dwmtype  $C$DW$T$105
    7681              $C$DW$T$105     .dwtag  DW_TAG_typedef
    7682                      .dwattr $C$DW$T$105, DW_AT_name("SPI_Mode")
    7683                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    7684                      .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_5_03_00_00/c2000ware/dri
    7685                      .dwattr $C$DW$T$105, DW_AT_decl_line(0x134)
    7686                      .dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
    7687              
    7688                      .dwendtag $C$DW$TU$105
    7689              
    7690              
    7691              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    7692                      .dwmtype  $C$DW$T$25
    7693              
    7694              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7695                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    7696              $C$DW$586       .dwtag  DW_TAG_member
    7697                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$21)
    7698                      .dwattr $C$DW$586, DW_AT_name("response")
    7699                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    7700                      .dwattr $C$DW$586, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7701                      .dwattr $C$DW$586, DW_AT_decl_line(0x35)
    7702                      .dwattr $C$DW$586, DW_AT_decl_column(0x17)
    7703              
    7704              $C$DW$587       .dwtag  DW_TAG_member
    7705                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$21)
    7706                      .dwattr $C$DW$587, DW_AT_name("crc")
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  154

    7707                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7708                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    7709                      .dwattr $C$DW$587, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7710                      .dwattr $C$DW$587, DW_AT_decl_line(0x36)
    7711                      .dwattr $C$DW$587, DW_AT_decl_column(0x17)
    7712              
    7713              $C$DW$588       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$24)
    7715                      .dwattr $C$DW$588, DW_AT_name("channel0")
    7716                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7717                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    7718                      .dwattr $C$DW$588, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7719                      .dwattr $C$DW$588, DW_AT_decl_line(0x37)
    7720                      .dwattr $C$DW$588, DW_AT_decl_column(0x16)
    7721              
    7722              $C$DW$589       .dwtag  DW_TAG_member
    7723                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$24)
    7724                      .dwattr $C$DW$589, DW_AT_name("channel1")
    7725                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7726                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    7727                      .dwattr $C$DW$589, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7728                      .dwattr $C$DW$589, DW_AT_decl_line(0x38)
    7729                      .dwattr $C$DW$589, DW_AT_decl_column(0x16)
    7730              
    7731              $C$DW$590       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$24)
    7733                      .dwattr $C$DW$590, DW_AT_name("channel2")
    7734                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7735                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    7736                      .dwattr $C$DW$590, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7737                      .dwattr $C$DW$590, DW_AT_decl_line(0x39)
    7738                      .dwattr $C$DW$590, DW_AT_decl_column(0x16)
    7739              
    7740              $C$DW$591       .dwtag  DW_TAG_member
    7741                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$24)
    7742                      .dwattr $C$DW$591, DW_AT_name("channel3")
    7743                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7744                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    7745                      .dwattr $C$DW$591, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7746                      .dwattr $C$DW$591, DW_AT_decl_line(0x3a)
    7747                      .dwattr $C$DW$591, DW_AT_decl_column(0x16)
    7748              
    7749              $C$DW$592       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$24)
    7751                      .dwattr $C$DW$592, DW_AT_name("channel4")
    7752                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7753                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    7754                      .dwattr $C$DW$592, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7755                      .dwattr $C$DW$592, DW_AT_decl_line(0x3b)
    7756                      .dwattr $C$DW$592, DW_AT_decl_column(0x16)
    7757              
    7758              $C$DW$593       .dwtag  DW_TAG_member
    7759                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
    7760                      .dwattr $C$DW$593, DW_AT_name("channel5")
    7761                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  155

    7762                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    7763                      .dwattr $C$DW$593, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7764                      .dwattr $C$DW$593, DW_AT_decl_line(0x3c)
    7765                      .dwattr $C$DW$593, DW_AT_decl_column(0x16)
    7766              
    7767              $C$DW$594       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$24)
    7769                      .dwattr $C$DW$594, DW_AT_name("channel6")
    7770                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7771                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    7772                      .dwattr $C$DW$594, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7773                      .dwattr $C$DW$594, DW_AT_decl_line(0x3d)
    7774                      .dwattr $C$DW$594, DW_AT_decl_column(0x16)
    7775              
    7776              $C$DW$595       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$24)
    7778                      .dwattr $C$DW$595, DW_AT_name("channel7")
    7779                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7780                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    7781                      .dwattr $C$DW$595, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    7782                      .dwattr $C$DW$595, DW_AT_decl_line(0x3e)
    7783                      .dwattr $C$DW$595, DW_AT_decl_column(0x16)
    7784              
    7785                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    7786                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x34)
    7787                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7788                      .dwendtag $C$DW$T$25
    7789              
    7790                      .dwendtag $C$DW$TU$25
    7791              
    7792              
    7793              $C$DW$TU$106    .dwtag  DW_TAG_type_unit
    7794                      .dwmtype  $C$DW$T$106
    7795              $C$DW$T$106     .dwtag  DW_TAG_typedef
    7796                      .dwattr $C$DW$T$106, DW_AT_name("adc_data")
    7797                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$25)
    7798                      .dwattr $C$DW$T$106, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F28
    7799                      .dwattr $C$DW$T$106, DW_AT_decl_line(0x3f)
    7800                      .dwattr $C$DW$T$106, DW_AT_decl_column(0x03)
    7801              
    7802                      .dwendtag $C$DW$TU$106
    7803              
    7804              
    7805              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    7806                      .dwmtype  $C$DW$T$2
    7807              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7808                      .dwattr $C$DW$T$2, DW_AT_name("void")
    7809              
    7810                      .dwendtag $C$DW$TU$2
    7811              
    7812              
    7813              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    7814                      .dwmtype  $C$DW$T$4
    7815              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7816                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C2000 Assembler PC v22.6.1 Tue Aug 13 19:46:08 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_hal.asm                                                          PAGE  156

    7817                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7818                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7819              
    7820                      .dwendtag $C$DW$TU$4
    7821              
    7822              
    7823              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    7824                      .dwmtype  $C$DW$T$5
    7825              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7826                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7827                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7828                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7829              
    7830                      .dwendtag $C$DW$TU$5
    7831              
    7832              
    7833              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    7834                      .dwmtype  $C$DW$T$6
    7835              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7836                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7837                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7838                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7839              
    7840                      .dwendtag $C$DW$TU$6
    7841              
    7842              
    7843              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    7844                      .dwmtype  $C$DW$T$7
    7845              $C$DW$T$7       .dwtag  DW_TAG_base_type
