TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Tue Mar  2 07:24:44 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bts_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_clearInterruptStatus")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SPI_clearInterruptStatus")

    5647              $C$DW$326       .dwtag  DW_TAG_enumerator
    5648                      .dwattr $C$DW$326, DW_AT_name("EPWM_TZ_ACTION_LOW")
    5649                      .dwattr $C$DW$326, DW_AT_const_value(0x02)
    5650                      .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5651                      .dwattr $C$DW$326, DW_AT_decl_line(0x311)
    5652                      .dwattr $C$DW$326, DW_AT_decl_column(0x05)
    5653              
    5654              $C$DW$327       .dwtag  DW_TAG_enumerator
    5655                      .dwattr $C$DW$327, DW_AT_name("EPWM_TZ_ACTION_DISABLE")
    5656                      .dwattr $C$DW$327, DW_AT_const_value(0x03)
    5657                      .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5658                      .dwattr $C$DW$327, DW_AT_decl_line(0x312)
    5659                      .dwattr $C$DW$327, DW_AT_decl_column(0x05)
    5660              
    5661                      .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5662                      .dwattr $C$DW$T$61, DW_AT_decl_line(0x30e)
    5663                      .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    5664                      .dwendtag $C$DW$T$61
    5665              
    5666                      .dwendtag $C$DW$TU$61
    5667              
    5668              
    5669              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
    5670                      .dwmtype  $C$DW$T$62
    5671              $C$DW$T$62      .dwtag  DW_TAG_typedef
    5672                      .dwattr $C$DW$T$62, DW_AT_name("EPWM_TripZoneAction")
    5673                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    5674                      .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5675                      .dwattr $C$DW$T$62, DW_AT_decl_line(0x313)
    5676                      .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    5677              
    5678                      .dwendtag $C$DW$TU$62
    5679              
    5680              
    5681              $C$DW$TU$63     .dwtag  DW_TAG_type_unit
    5682                      .dwmtype  $C$DW$T$63
    5683              
    5684              $C$DW$T$63      .dwtag  DW_TAG_enumeration_type
    5685                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    5686              $C$DW$328       .dwtag  DW_TAG_enumerator
    5687                      .dwattr $C$DW$328, DW_AT_name("HRPWM_COUNTER_COMPARE_A")
    5688                      .dwattr $C$DW$328, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  114

    5689                      .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5690                      .dwattr $C$DW$328, DW_AT_decl_line(0xb3)
    5691                      .dwattr $C$DW$328, DW_AT_decl_column(0x05)
    5692              
    5693              $C$DW$329       .dwtag  DW_TAG_enumerator
    5694                      .dwattr $C$DW$329, DW_AT_name("HRPWM_COUNTER_COMPARE_B")
    5695                      .dwattr $C$DW$329, DW_AT_const_value(0x04)
    5696                      .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5697                      .dwattr $C$DW$329, DW_AT_decl_line(0xb4)
    5698                      .dwattr $C$DW$329, DW_AT_decl_column(0x05)
    5699              
    5700                      .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5701                      .dwattr $C$DW$T$63, DW_AT_decl_line(0xb2)
    5702                      .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    5703                      .dwendtag $C$DW$T$63
    5704              
    5705                      .dwendtag $C$DW$TU$63
    5706              
    5707              
    5708              $C$DW$TU$64     .dwtag  DW_TAG_type_unit
    5709                      .dwmtype  $C$DW$T$64
    5710              $C$DW$T$64      .dwtag  DW_TAG_typedef
    5711                      .dwattr $C$DW$T$64, DW_AT_name("HRPWM_CounterCompareModule")
    5712                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    5713                      .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5714                      .dwattr $C$DW$T$64, DW_AT_decl_line(0xb5)
    5715                      .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    5716              
    5717                      .dwendtag $C$DW$TU$64
    5718              
    5719              
    5720              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5721                      .dwmtype  $C$DW$T$25
    5722              
    5723              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5724                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x12)
    5725              $C$DW$330       .dwtag  DW_TAG_member
    5726                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    5727                      .dwattr $C$DW$330, DW_AT_name("response")
    5728                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5729                      .dwattr $C$DW$330, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5730                      .dwattr $C$DW$330, DW_AT_decl_line(0x35)
    5731                      .dwattr $C$DW$330, DW_AT_decl_column(0x17)
    5732              
    5733              $C$DW$331       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    5735                      .dwattr $C$DW$331, DW_AT_name("crc")
    5736                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5737                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5738                      .dwattr $C$DW$331, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5739                      .dwattr $C$DW$331, DW_AT_decl_line(0x36)
    5740                      .dwattr $C$DW$331, DW_AT_decl_column(0x17)
    5741              
    5742              $C$DW$332       .dwtag  DW_TAG_member
    5743                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  115

    5744                      .dwattr $C$DW$332, DW_AT_name("channel0")
    5745                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5746                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5747                      .dwattr $C$DW$332, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5748                      .dwattr $C$DW$332, DW_AT_decl_line(0x37)
    5749                      .dwattr $C$DW$332, DW_AT_decl_column(0x16)
    5750              
    5751              $C$DW$333       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$24)
    5753                      .dwattr $C$DW$333, DW_AT_name("channel1")
    5754                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5755                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5756                      .dwattr $C$DW$333, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5757                      .dwattr $C$DW$333, DW_AT_decl_line(0x38)
    5758                      .dwattr $C$DW$333, DW_AT_decl_column(0x16)
    5759              
    5760              $C$DW$334       .dwtag  DW_TAG_member
    5761                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$24)
    5762                      .dwattr $C$DW$334, DW_AT_name("channel2")
    5763                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5764                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5765                      .dwattr $C$DW$334, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5766                      .dwattr $C$DW$334, DW_AT_decl_line(0x39)
    5767                      .dwattr $C$DW$334, DW_AT_decl_column(0x16)
    5768              
    5769              $C$DW$335       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$24)
    5771                      .dwattr $C$DW$335, DW_AT_name("channel3")
    5772                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5773                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5774                      .dwattr $C$DW$335, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5775                      .dwattr $C$DW$335, DW_AT_decl_line(0x3a)
    5776                      .dwattr $C$DW$335, DW_AT_decl_column(0x16)
    5777              
    5778              $C$DW$336       .dwtag  DW_TAG_member
    5779                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$24)
    5780                      .dwattr $C$DW$336, DW_AT_name("channel4")
    5781                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5782                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5783                      .dwattr $C$DW$336, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5784                      .dwattr $C$DW$336, DW_AT_decl_line(0x3b)
    5785                      .dwattr $C$DW$336, DW_AT_decl_column(0x16)
    5786              
    5787              $C$DW$337       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$24)
    5789                      .dwattr $C$DW$337, DW_AT_name("channel5")
    5790                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5791                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5792                      .dwattr $C$DW$337, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5793                      .dwattr $C$DW$337, DW_AT_decl_line(0x3c)
    5794                      .dwattr $C$DW$337, DW_AT_decl_column(0x16)
    5795              
    5796              $C$DW$338       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
    5798                      .dwattr $C$DW$338, DW_AT_name("channel6")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  116

    5799                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5800                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5801                      .dwattr $C$DW$338, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5802                      .dwattr $C$DW$338, DW_AT_decl_line(0x3d)
    5803                      .dwattr $C$DW$338, DW_AT_decl_column(0x16)
    5804              
    5805              $C$DW$339       .dwtag  DW_TAG_member
    5806                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$24)
    5807                      .dwattr $C$DW$339, DW_AT_name("channel7")
    5808                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5809                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5810                      .dwattr $C$DW$339, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    5811                      .dwattr $C$DW$339, DW_AT_decl_line(0x3e)
    5812                      .dwattr $C$DW$339, DW_AT_decl_column(0x16)
    5813              
    5814                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    5815                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x34)
    5816                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5817                      .dwendtag $C$DW$T$25
    5818              
    5819                      .dwendtag $C$DW$TU$25
    5820              
    5821              
    5822              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    5823                      .dwmtype  $C$DW$T$65
    5824              $C$DW$T$65      .dwtag  DW_TAG_typedef
    5825                      .dwattr $C$DW$T$65, DW_AT_name("adc_data")
    5826                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$25)
    5827                      .dwattr $C$DW$T$65, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    5828                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f)
    5829                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    5830              
    5831                      .dwendtag $C$DW$TU$65
    5832              
    5833              
    5834              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5835                      .dwmtype  $C$DW$T$30
    5836              
    5837              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5838                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x20)
    5839              $C$DW$340       .dwtag  DW_TAG_member
    5840                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$27)
    5841                      .dwattr $C$DW$340, DW_AT_name("h_magVect")
    5842                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5843                      .dwattr $C$DW$340, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5844                      .dwattr $C$DW$340, DW_AT_decl_line(0x40)
    5845                      .dwattr $C$DW$340, DW_AT_decl_column(0x10)
    5846              
    5847              $C$DW$341       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$27)
    5849                      .dwattr $C$DW$341, DW_AT_name("h_phaseVect")
    5850                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5851                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5852                      .dwattr $C$DW$341, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5853                      .dwattr $C$DW$341, DW_AT_decl_line(0x41)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  117

    5854                      .dwattr $C$DW$341, DW_AT_decl_column(0x10)
    5855              
    5856              $C$DW$342       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$27)
    5858                      .dwattr $C$DW$342, DW_AT_name("gh_magVect")
    5859                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5860                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5861                      .dwattr $C$DW$342, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5862                      .dwattr $C$DW$342, DW_AT_decl_line(0x42)
    5863                      .dwattr $C$DW$342, DW_AT_decl_column(0x10)
    5864              
    5865              $C$DW$343       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$27)
    5867                      .dwattr $C$DW$343, DW_AT_name("gh_phaseVect")
    5868                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5869                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5870                      .dwattr $C$DW$343, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5871                      .dwattr $C$DW$343, DW_AT_decl_line(0x43)
    5872                      .dwattr $C$DW$343, DW_AT_decl_column(0x10)
    5873              
    5874              $C$DW$344       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$27)
    5876                      .dwattr $C$DW$344, DW_AT_name("cl_magVect")
    5877                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5878                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5879                      .dwattr $C$DW$344, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5880                      .dwattr $C$DW$344, DW_AT_decl_line(0x44)
    5881                      .dwattr $C$DW$344, DW_AT_decl_column(0x10)
    5882              
    5883              $C$DW$345       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$27)
    5885                      .dwattr $C$DW$345, DW_AT_name("cl_phaseVect")
    5886                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5887                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5888                      .dwattr $C$DW$345, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5889                      .dwattr $C$DW$345, DW_AT_decl_line(0x45)
    5890                      .dwattr $C$DW$345, DW_AT_decl_column(0x10)
    5891              
    5892              $C$DW$346       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$27)
    5894                      .dwattr $C$DW$346, DW_AT_name("freqVect")
    5895                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5896                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5897                      .dwattr $C$DW$346, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5898                      .dwattr $C$DW$346, DW_AT_decl_line(0x46)
    5899                      .dwattr $C$DW$346, DW_AT_decl_column(0x10)
    5900              
    5901              $C$DW$347       .dwtag  DW_TAG_member
    5902                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$26)
    5903                      .dwattr $C$DW$347, DW_AT_name("amplitude")
    5904                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5905                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5906                      .dwattr $C$DW$347, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5907                      .dwattr $C$DW$347, DW_AT_decl_line(0x47)
    5908                      .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  118

    5909              
    5910              $C$DW$348       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$26)
    5912                      .dwattr $C$DW$348, DW_AT_name("isrFreq")
    5913                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5914                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5915                      .dwattr $C$DW$348, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5916                      .dwattr $C$DW$348, DW_AT_decl_line(0x48)
    5917                      .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    5918              
    5919              $C$DW$349       .dwtag  DW_TAG_member
    5920                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$26)
    5921                      .dwattr $C$DW$349, DW_AT_name("freqStart")
    5922                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5923                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5924                      .dwattr $C$DW$349, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5925                      .dwattr $C$DW$349, DW_AT_decl_line(0x49)
    5926                      .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    5927              
    5928              $C$DW$350       .dwtag  DW_TAG_member
    5929                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$26)
    5930                      .dwattr $C$DW$350, DW_AT_name("freqStep")
    5931                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5932                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5933                      .dwattr $C$DW$350, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5934                      .dwattr $C$DW$350, DW_AT_decl_line(0x4a)
    5935                      .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    5936              
    5937              $C$DW$351       .dwtag  DW_TAG_member
    5938                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    5939                      .dwattr $C$DW$351, DW_AT_name("start")
    5940                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5941                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5942                      .dwattr $C$DW$351, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5943                      .dwattr $C$DW$351, DW_AT_decl_line(0x4b)
    5944                      .dwattr $C$DW$351, DW_AT_decl_column(0x0d)
    5945              
    5946              $C$DW$352       .dwtag  DW_TAG_member
    5947                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    5948                      .dwattr $C$DW$352, DW_AT_name("state")
    5949                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5950                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5951                      .dwattr $C$DW$352, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5952                      .dwattr $C$DW$352, DW_AT_decl_line(0x4c)
    5953                      .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    5954              
    5955              $C$DW$353       .dwtag  DW_TAG_member
    5956                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    5957                      .dwattr $C$DW$353, DW_AT_name("status")
    5958                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5959                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5960                      .dwattr $C$DW$353, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5961                      .dwattr $C$DW$353, DW_AT_decl_line(0x4d)
    5962                      .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    5963              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  119

    5964              $C$DW$354       .dwtag  DW_TAG_member
    5965                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    5966                      .dwattr $C$DW$354, DW_AT_name("vecLength")
    5967                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5968                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5969                      .dwattr $C$DW$354, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5970                      .dwattr $C$DW$354, DW_AT_decl_line(0x4e)
    5971                      .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    5972              
    5973              $C$DW$355       .dwtag  DW_TAG_member
    5974                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    5975                      .dwattr $C$DW$355, DW_AT_name("freqIndex")
    5976                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5977                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5978                      .dwattr $C$DW$355, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5979                      .dwattr $C$DW$355, DW_AT_decl_line(0x4f)
    5980                      .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    5981              
    5982              $C$DW$356       .dwtag  DW_TAG_member
    5983                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    5984                      .dwattr $C$DW$356, DW_AT_name("storeH")
    5985                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5986                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5987                      .dwattr $C$DW$356, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5988                      .dwattr $C$DW$356, DW_AT_decl_line(0x50)
    5989                      .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    5990              
    5991              $C$DW$357       .dwtag  DW_TAG_member
    5992                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    5993                      .dwattr $C$DW$357, DW_AT_name("storeGH")
    5994                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5995                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5996                      .dwattr $C$DW$357, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    5997                      .dwattr $C$DW$357, DW_AT_decl_line(0x51)
    5998                      .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    5999              
    6000              $C$DW$358       .dwtag  DW_TAG_member
    6001                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    6002                      .dwattr $C$DW$358, DW_AT_name("storeCL")
    6003                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6004                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6005                      .dwattr $C$DW$358, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6006                      .dwattr $C$DW$358, DW_AT_decl_line(0x52)
    6007                      .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    6008              
    6009              $C$DW$359       .dwtag  DW_TAG_member
    6010                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    6011                      .dwattr $C$DW$359, DW_AT_name("speed")
    6012                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6013                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6014                      .dwattr $C$DW$359, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6015                      .dwattr $C$DW$359, DW_AT_decl_line(0x53)
    6016                      .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    6017              
    6018                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  120

    6019                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
    6020                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x0f)
    6021                      .dwendtag $C$DW$T$30
    6022              
    6023                      .dwendtag $C$DW$TU$30
    6024              
    6025              
    6026              $C$DW$TU$67     .dwtag  DW_TAG_type_unit
    6027                      .dwmtype  $C$DW$T$67
    6028              $C$DW$T$67      .dwtag  DW_TAG_typedef
    6029                      .dwattr $C$DW$T$67, DW_AT_name("SFRA_F32")
    6030                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$30)
    6031                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6032                      .dwattr $C$DW$T$67, DW_AT_decl_line(0x54)
    6033                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    6034              
    6035                      .dwendtag $C$DW$TU$67
    6036              
    6037              
    6038              $C$DW$TU$68     .dwtag  DW_TAG_type_unit
    6039                      .dwmtype  $C$DW$T$68
    6040              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    6041                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    6042                      .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
    6043              
    6044                      .dwendtag $C$DW$TU$68
    6045              
    6046              
    6047              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    6048                      .dwmtype  $C$DW$T$32
    6049              
    6050              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6051                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x1e)
    6052              $C$DW$360       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$31)
    6054                      .dwattr $C$DW$360, DW_AT_name("iref_A")
    6055                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6056                      .dwattr $C$DW$360, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6057                      .dwattr $C$DW$360, DW_AT_decl_line(0x78)
    6058                      .dwattr $C$DW$360, DW_AT_decl_column(0x18)
    6059              
    6060              $C$DW$361       .dwtag  DW_TAG_member
    6061                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$31)
    6062                      .dwattr $C$DW$361, DW_AT_name("vref_charge_V")
    6063                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6064                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6065                      .dwattr $C$DW$361, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6066                      .dwattr $C$DW$361, DW_AT_decl_line(0x79)
    6067                      .dwattr $C$DW$361, DW_AT_decl_column(0x18)
    6068              
    6069              $C$DW$362       .dwtag  DW_TAG_member
    6070                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$31)
    6071                      .dwattr $C$DW$362, DW_AT_name("vref_discharge_V")
    6072                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6073                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  121

    6074                      .dwattr $C$DW$362, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6075                      .dwattr $C$DW$362, DW_AT_decl_line(0x7a)
    6076                      .dwattr $C$DW$362, DW_AT_decl_column(0x18)
    6077              
    6078              $C$DW$363       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
    6080                      .dwattr $C$DW$363, DW_AT_name("direction_logic")
    6081                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6082                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6083                      .dwattr $C$DW$363, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6084                      .dwattr $C$DW$363, DW_AT_decl_line(0x7b)
    6085                      .dwattr $C$DW$363, DW_AT_decl_column(0x17)
    6086              
    6087              $C$DW$364       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$21)
    6089                      .dwattr $C$DW$364, DW_AT_name("enable_logic")
    6090                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6091                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6092                      .dwattr $C$DW$364, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6093                      .dwattr $C$DW$364, DW_AT_decl_line(0x7c)
    6094                      .dwattr $C$DW$364, DW_AT_decl_column(0x17)
    6095              
    6096              $C$DW$365       .dwtag  DW_TAG_member
    6097                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
    6098                      .dwattr $C$DW$365, DW_AT_name("dutyRef_pu")
    6099                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6100                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6101                      .dwattr $C$DW$365, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6102                      .dwattr $C$DW$365, DW_AT_decl_line(0x7d)
    6103                      .dwattr $C$DW$365, DW_AT_decl_column(0x18)
    6104              
    6105              $C$DW$366       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$31)
    6107                      .dwattr $C$DW$366, DW_AT_name("ioutCal_pu")
    6108                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6109                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6110                      .dwattr $C$DW$366, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6111                      .dwattr $C$DW$366, DW_AT_decl_line(0x7e)
    6112                      .dwattr $C$DW$366, DW_AT_decl_column(0x18)
    6113              
    6114              $C$DW$367       .dwtag  DW_TAG_member
    6115                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$31)
    6116                      .dwattr $C$DW$367, DW_AT_name("voutCal_pu")
    6117                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6118                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6119                      .dwattr $C$DW$367, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6120                      .dwattr $C$DW$367, DW_AT_decl_line(0x7f)
    6121                      .dwattr $C$DW$367, DW_AT_decl_column(0x18)
    6122              
    6123              $C$DW$368       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$26)
    6125                      .dwattr $C$DW$368, DW_AT_name("IoutGain_pu")
    6126                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6127                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6128                      .dwattr $C$DW$368, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  122

    6129                      .dwattr $C$DW$368, DW_AT_decl_line(0x81)
    6130                      .dwattr $C$DW$368, DW_AT_decl_column(0x0f)
    6131              
    6132              $C$DW$369       .dwtag  DW_TAG_member
    6133                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$26)
    6134                      .dwattr $C$DW$369, DW_AT_name("IoutOffset_pu")
    6135                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6136                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6137                      .dwattr $C$DW$369, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6138                      .dwattr $C$DW$369, DW_AT_decl_line(0x82)
    6139                      .dwattr $C$DW$369, DW_AT_decl_column(0x0f)
    6140              
    6141              $C$DW$370       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$26)
    6143                      .dwattr $C$DW$370, DW_AT_name("IoutGain_A")
    6144                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6145                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6146                      .dwattr $C$DW$370, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6147                      .dwattr $C$DW$370, DW_AT_decl_line(0x83)
    6148                      .dwattr $C$DW$370, DW_AT_decl_column(0x0f)
    6149              
    6150              $C$DW$371       .dwtag  DW_TAG_member
    6151                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
    6152                      .dwattr $C$DW$371, DW_AT_name("IoutOffset_A")
    6153                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6154                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6155                      .dwattr $C$DW$371, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6156                      .dwattr $C$DW$371, DW_AT_decl_line(0x84)
    6157                      .dwattr $C$DW$371, DW_AT_decl_column(0x0f)
    6158              
    6159              $C$DW$372       .dwtag  DW_TAG_member
    6160                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    6161                      .dwattr $C$DW$372, DW_AT_name("VoutGain_pu")
    6162                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6163                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6164                      .dwattr $C$DW$372, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6165                      .dwattr $C$DW$372, DW_AT_decl_line(0x86)
    6166                      .dwattr $C$DW$372, DW_AT_decl_column(0x0f)
    6167              
    6168              $C$DW$373       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$26)
    6170                      .dwattr $C$DW$373, DW_AT_name("VoutOffset_pu")
    6171                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6172                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6173                      .dwattr $C$DW$373, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6174                      .dwattr $C$DW$373, DW_AT_decl_line(0x87)
    6175                      .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    6176              
    6177              $C$DW$374       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$26)
    6179                      .dwattr $C$DW$374, DW_AT_name("VoutGain_V")
    6180                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6181                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6182                      .dwattr $C$DW$374, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6183                      .dwattr $C$DW$374, DW_AT_decl_line(0x88)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  123

    6184                      .dwattr $C$DW$374, DW_AT_decl_column(0x0f)
    6185              
    6186              $C$DW$375       .dwtag  DW_TAG_member
    6187                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$26)
    6188                      .dwattr $C$DW$375, DW_AT_name("VoutOffset_V")
    6189                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6190                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6191                      .dwattr $C$DW$375, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6192                      .dwattr $C$DW$375, DW_AT_decl_line(0x89)
    6193                      .dwattr $C$DW$375, DW_AT_decl_column(0x0f)
    6194              
    6195                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6196                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x77)
    6197                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    6198                      .dwendtag $C$DW$T$32
    6199              
    6200                      .dwendtag $C$DW$TU$32
    6201              
    6202              
    6203              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    6204                      .dwmtype  $C$DW$T$70
    6205              $C$DW$T$70      .dwtag  DW_TAG_typedef
    6206                      .dwattr $C$DW$T$70, DW_AT_name("BTS_userInput")
    6207                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    6208                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6209                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x8b)
    6210                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    6211              
    6212                      .dwendtag $C$DW$TU$70
    6213              
    6214              
    6215              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    6216                      .dwmtype  $C$DW$T$71
    6217              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6218                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6219                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    6220              
    6221                      .dwendtag $C$DW$TU$71
    6222              
    6223              
    6224              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    6225                      .dwmtype  $C$DW$T$33
    6226              
    6227              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6228                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    6229              $C$DW$376       .dwtag  DW_TAG_member
    6230                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    6231                      .dwattr $C$DW$376, DW_AT_name("dutySet_pu")
    6232                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6233                      .dwattr $C$DW$376, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6234                      .dwattr $C$DW$376, DW_AT_decl_line(0x97)
    6235                      .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    6236              
    6237              $C$DW$377       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  124

    6239                      .dwattr $C$DW$377, DW_AT_name("dutySetRef_pu")
    6240                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6241                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6242                      .dwattr $C$DW$377, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6243                      .dwattr $C$DW$377, DW_AT_decl_line(0x98)
    6244                      .dwattr $C$DW$377, DW_AT_decl_column(0x0f)
    6245              
    6246              $C$DW$378       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$26)
    6248                      .dwattr $C$DW$378, DW_AT_name("ioutRef_pu")
    6249                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6250                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6251                      .dwattr $C$DW$378, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6252                      .dwattr $C$DW$378, DW_AT_decl_line(0x9a)
    6253                      .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
    6254              
    6255              $C$DW$379       .dwtag  DW_TAG_member
    6256                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    6257                      .dwattr $C$DW$379, DW_AT_name("ioutSet_pu")
    6258                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6259                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6260                      .dwattr $C$DW$379, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6261                      .dwattr $C$DW$379, DW_AT_decl_line(0x9b)
    6262                      .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    6263              
    6264              $C$DW$380       .dwtag  DW_TAG_member
    6265                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$26)
    6266                      .dwattr $C$DW$380, DW_AT_name("ioutSense_pu")
    6267                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6268                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6269                      .dwattr $C$DW$380, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6270                      .dwattr $C$DW$380, DW_AT_decl_line(0x9c)
    6271                      .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    6272              
    6273              $C$DW$381       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$26)
    6275                      .dwattr $C$DW$381, DW_AT_name("voutRef_pu")
    6276                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6277                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6278                      .dwattr $C$DW$381, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6279                      .dwattr $C$DW$381, DW_AT_decl_line(0x9e)
    6280                      .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    6281              
    6282              $C$DW$382       .dwtag  DW_TAG_member
    6283                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$26)
    6284                      .dwattr $C$DW$382, DW_AT_name("voutSet_pu")
    6285                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6286                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6287                      .dwattr $C$DW$382, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6288                      .dwattr $C$DW$382, DW_AT_decl_line(0x9f)
    6289                      .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    6290              
    6291              $C$DW$383       .dwtag  DW_TAG_member
    6292                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$26)
    6293                      .dwattr $C$DW$383, DW_AT_name("voutSense_pu")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  125

    6294                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6295                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6296                      .dwattr $C$DW$383, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6297                      .dwattr $C$DW$383, DW_AT_decl_line(0xa0)
    6298                      .dwattr $C$DW$383, DW_AT_decl_column(0x0f)
    6299              
    6300              $C$DW$384       .dwtag  DW_TAG_member
    6301                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
    6302                      .dwattr $C$DW$384, DW_AT_name("uk_cc_pu")
    6303                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6304                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6305                      .dwattr $C$DW$384, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6306                      .dwattr $C$DW$384, DW_AT_decl_line(0xa2)
    6307                      .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    6308              
    6309              $C$DW$385       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$26)
    6311                      .dwattr $C$DW$385, DW_AT_name("ek_cc_pu")
    6312                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6313                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6314                      .dwattr $C$DW$385, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6315                      .dwattr $C$DW$385, DW_AT_decl_line(0xa3)
    6316                      .dwattr $C$DW$385, DW_AT_decl_column(0x0f)
    6317              
    6318              $C$DW$386       .dwtag  DW_TAG_member
    6319                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$26)
    6320                      .dwattr $C$DW$386, DW_AT_name("uk_cv_pu")
    6321                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6322                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6323                      .dwattr $C$DW$386, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6324                      .dwattr $C$DW$386, DW_AT_decl_line(0xa4)
    6325                      .dwattr $C$DW$386, DW_AT_decl_column(0x0f)
    6326              
    6327              $C$DW$387       .dwtag  DW_TAG_member
    6328                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$26)
    6329                      .dwattr $C$DW$387, DW_AT_name("ek_cv_pu")
    6330                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6331                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6332                      .dwattr $C$DW$387, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6333                      .dwattr $C$DW$387, DW_AT_decl_line(0xa5)
    6334                      .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    6335              
    6336              $C$DW$388       .dwtag  DW_TAG_member
    6337                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$26)
    6338                      .dwattr $C$DW$388, DW_AT_name("direction_coeff")
    6339                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6340                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6341                      .dwattr $C$DW$388, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6342                      .dwattr $C$DW$388, DW_AT_decl_line(0xa6)
    6343                      .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    6344              
    6345              $C$DW$389       .dwtag  DW_TAG_member
    6346                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$26)
    6347                      .dwattr $C$DW$389, DW_AT_name("dutyH_pu")
    6348                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  126

    6349                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6350                      .dwattr $C$DW$389, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6351                      .dwattr $C$DW$389, DW_AT_decl_line(0xa8)
    6352                      .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    6353              
    6354              $C$DW$390       .dwtag  DW_TAG_member
    6355                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$26)
    6356                      .dwattr $C$DW$390, DW_AT_name("dutyL_pu")
    6357                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6358                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6359                      .dwattr $C$DW$390, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6360                      .dwattr $C$DW$390, DW_AT_decl_line(0xa9)
    6361                      .dwattr $C$DW$390, DW_AT_decl_column(0x0f)
    6362              
    6363              $C$DW$391       .dwtag  DW_TAG_member
    6364                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    6365                      .dwattr $C$DW$391, DW_AT_name("ctrlMode_logic")
    6366                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6367                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6368                      .dwattr $C$DW$391, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6369                      .dwattr $C$DW$391, DW_AT_decl_line(0xab)
    6370                      .dwattr $C$DW$391, DW_AT_decl_column(0x0e)
    6371              
    6372              $C$DW$392       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    6374                      .dwattr $C$DW$392, DW_AT_name("direction_logic")
    6375                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6376                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6377                      .dwattr $C$DW$392, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6378                      .dwattr $C$DW$392, DW_AT_decl_line(0xac)
    6379                      .dwattr $C$DW$392, DW_AT_decl_column(0x0e)
    6380              
    6381              $C$DW$393       .dwtag  DW_TAG_member
    6382                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    6383                      .dwattr $C$DW$393, DW_AT_name("ioutTrip_16b")
    6384                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6385                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6386                      .dwattr $C$DW$393, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6387                      .dwattr $C$DW$393, DW_AT_decl_line(0xae)
    6388                      .dwattr $C$DW$393, DW_AT_decl_column(0x0d)
    6389              
    6390              $C$DW$394       .dwtag  DW_TAG_member
    6391                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    6392                      .dwattr $C$DW$394, DW_AT_name("ioutTrip_n_16b")
    6393                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6394                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6395                      .dwattr $C$DW$394, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6396                      .dwattr $C$DW$394, DW_AT_decl_line(0xaf)
    6397                      .dwattr $C$DW$394, DW_AT_decl_column(0x0d)
    6398              
    6399              $C$DW$395       .dwtag  DW_TAG_member
    6400                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    6401                      .dwattr $C$DW$395, DW_AT_name("tripFlag")
    6402                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6403                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  127

    6404                      .dwattr $C$DW$395, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6405                      .dwattr $C$DW$395, DW_AT_decl_line(0xb0)
    6406                      .dwattr $C$DW$395, DW_AT_decl_column(0x0e)
    6407              
    6408                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6409                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x96)
    6410                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6411                      .dwendtag $C$DW$T$33
    6412              
    6413                      .dwendtag $C$DW$TU$33
    6414              
    6415              
    6416              $C$DW$TU$73     .dwtag  DW_TAG_type_unit
    6417                      .dwmtype  $C$DW$T$73
    6418              $C$DW$T$73      .dwtag  DW_TAG_typedef
    6419                      .dwattr $C$DW$T$73, DW_AT_name("BTS_ctrlLoopVariable")
    6420                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$33)
    6421                      .dwattr $C$DW$T$73, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6422                      .dwattr $C$DW$T$73, DW_AT_decl_line(0xb2)
    6423                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    6424              
    6425                      .dwendtag $C$DW$TU$73
    6426              
    6427              
    6428              $C$DW$TU$74     .dwtag  DW_TAG_type_unit
    6429                      .dwmtype  $C$DW$T$74
    6430              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    6431                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    6432                      .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    6433              
    6434                      .dwendtag $C$DW$TU$74
    6435              
    6436              
    6437              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    6438                      .dwmtype  $C$DW$T$35
    6439              
    6440              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6441                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x52)
    6442              $C$DW$396       .dwtag  DW_TAG_member
    6443                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$26)
    6444                      .dwattr $C$DW$396, DW_AT_name("Isense_A")
    6445                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6446                      .dwattr $C$DW$396, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6447                      .dwattr $C$DW$396, DW_AT_decl_line(0x5f)
    6448                      .dwattr $C$DW$396, DW_AT_decl_column(0x0f)
    6449              
    6450              $C$DW$397       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$26)
    6452                      .dwattr $C$DW$397, DW_AT_name("Vsense_V")
    6453                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6454                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6455                      .dwattr $C$DW$397, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6456                      .dwattr $C$DW$397, DW_AT_decl_line(0x60)
    6457                      .dwattr $C$DW$397, DW_AT_decl_column(0x0f)
    6458              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  128

    6459              $C$DW$398       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$34)
    6461                      .dwattr $C$DW$398, DW_AT_name("Isense_16b")
    6462                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6463                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6464                      .dwattr $C$DW$398, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6465                      .dwattr $C$DW$398, DW_AT_decl_line(0x61)
    6466                      .dwattr $C$DW$398, DW_AT_decl_column(0x0d)
    6467              
    6468              $C$DW$399       .dwtag  DW_TAG_member
    6469                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$34)
    6470                      .dwattr $C$DW$399, DW_AT_name("Vsense_16b")
    6471                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6472                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6473                      .dwattr $C$DW$399, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6474                      .dwattr $C$DW$399, DW_AT_decl_line(0x62)
    6475                      .dwattr $C$DW$399, DW_AT_decl_column(0x0d)
    6476              
    6477              $C$DW$400       .dwtag  DW_TAG_member
    6478                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    6479                      .dwattr $C$DW$400, DW_AT_name("Sum_I")
    6480                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6481                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6482                      .dwattr $C$DW$400, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6483                      .dwattr $C$DW$400, DW_AT_decl_line(0x63)
    6484                      .dwattr $C$DW$400, DW_AT_decl_column(0x0d)
    6485              
    6486              $C$DW$401       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    6488                      .dwattr $C$DW$401, DW_AT_name("Sum_V")
    6489                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6490                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6491                      .dwattr $C$DW$401, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6492                      .dwattr $C$DW$401, DW_AT_decl_line(0x64)
    6493                      .dwattr $C$DW$401, DW_AT_decl_column(0x0d)
    6494              
    6495              $C$DW$402       .dwtag  DW_TAG_member
    6496                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    6497                      .dwattr $C$DW$402, DW_AT_name("Index")
    6498                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6499                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6500                      .dwattr $C$DW$402, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6501                      .dwattr $C$DW$402, DW_AT_decl_line(0x65)
    6502                      .dwattr $C$DW$402, DW_AT_decl_column(0x0e)
    6503              
    6504              $C$DW$403       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$26)
    6506                      .dwattr $C$DW$403, DW_AT_name("IoutGain_A")
    6507                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6508                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6509                      .dwattr $C$DW$403, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6510                      .dwattr $C$DW$403, DW_AT_decl_line(0x66)
    6511                      .dwattr $C$DW$403, DW_AT_decl_column(0x0f)
    6512              
    6513              $C$DW$404       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  129

    6514                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$26)
    6515                      .dwattr $C$DW$404, DW_AT_name("IoutOffset_A")
    6516                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6517                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6518                      .dwattr $C$DW$404, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6519                      .dwattr $C$DW$404, DW_AT_decl_line(0x67)
    6520                      .dwattr $C$DW$404, DW_AT_decl_column(0x0f)
    6521              
    6522              $C$DW$405       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$26)
    6524                      .dwattr $C$DW$405, DW_AT_name("VoutGain_V")
    6525                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6526                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6527                      .dwattr $C$DW$405, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6528                      .dwattr $C$DW$405, DW_AT_decl_line(0x68)
    6529                      .dwattr $C$DW$405, DW_AT_decl_column(0x0f)
    6530              
    6531              $C$DW$406       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$26)
    6533                      .dwattr $C$DW$406, DW_AT_name("VoutOffset_V")
    6534                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6535                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6536                      .dwattr $C$DW$406, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F2837
    6537                      .dwattr $C$DW$406, DW_AT_decl_line(0x69)
    6538                      .dwattr $C$DW$406, DW_AT_decl_column(0x0f)
    6539              
    6540                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6541                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5e)
    6542                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    6543                      .dwendtag $C$DW$T$35
    6544              
    6545                      .dwendtag $C$DW$TU$35
    6546              
    6547              
    6548              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
    6549                      .dwmtype  $C$DW$T$76
    6550              $C$DW$T$76      .dwtag  DW_TAG_typedef
    6551                      .dwattr $C$DW$T$76, DW_AT_name("BTS_measValues")
    6552                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$35)
    6553                      .dwattr $C$DW$T$76, DW_AT_decl_file("C:/sandbox/github/Lion-IRVT/Hardware/source/tida-010086/bts_F283
    6554                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x6b)
    6555                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x02)
    6556              
    6557                      .dwendtag $C$DW$TU$76
    6558              
    6559              
    6560              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    6561                      .dwmtype  $C$DW$T$77
    6562              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    6563                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6564                      .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    6565              
    6566                      .dwendtag $C$DW$TU$77
    6567              
    6568              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  130

    6569              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    6570                      .dwmtype  $C$DW$T$37
    6571              
    6572              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6573                      .dwattr $C$DW$T$37, DW_AT_name("_Complex_double")
    6574                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    6575              $C$DW$407       .dwtag  DW_TAG_member
    6576                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$36)
    6577                      .dwattr $C$DW$407, DW_AT_name("_Vals")
    6578                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6579                      .dwattr $C$DW$407, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6580                      .dwattr $C$DW$407, DW_AT_decl_line(0xf4)
    6581                      .dwattr $C$DW$407, DW_AT_decl_column(0x14)
    6582              
    6583                      .dwendtag $C$DW$T$37
    6584              
    6585                      .dwendtag $C$DW$TU$37
    6586              
    6587              
    6588              $C$DW$TU$79     .dwtag  DW_TAG_type_unit
    6589                      .dwmtype  $C$DW$T$79
    6590              $C$DW$T$79      .dwtag  DW_TAG_typedef
    6591                      .dwattr $C$DW$T$79, DW_AT_name("_Complex_double")
    6592                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$37)
    6593                      .dwattr $C$DW$T$79, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6594                      .dwattr $C$DW$T$79, DW_AT_decl_line(0xf4)
    6595                      .dwattr $C$DW$T$79, DW_AT_decl_column(0x14)
    6596              
    6597                      .dwendtag $C$DW$TU$79
    6598              
    6599              
    6600              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    6601                      .dwmtype  $C$DW$T$39
    6602              
    6603              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6604                      .dwattr $C$DW$T$39, DW_AT_name("_Complex_float")
    6605                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    6606              $C$DW$408       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$38)
    6608                      .dwattr $C$DW$408, DW_AT_name("_Vals")
    6609                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6610                      .dwattr $C$DW$408, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6611                      .dwattr $C$DW$408, DW_AT_decl_line(0xf4)
    6612                      .dwattr $C$DW$408, DW_AT_decl_column(0x14)
    6613              
    6614                      .dwendtag $C$DW$T$39
    6615              
    6616                      .dwendtag $C$DW$TU$39
    6617              
    6618              
    6619              $C$DW$TU$80     .dwtag  DW_TAG_type_unit
    6620                      .dwmtype  $C$DW$T$80
    6621              $C$DW$T$80      .dwtag  DW_TAG_typedef
    6622                      .dwattr $C$DW$T$80, DW_AT_name("_Complex_float")
    6623                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  131

    6624                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6625                      .dwattr $C$DW$T$80, DW_AT_decl_line(0xf4)
    6626                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x14)
    6627              
    6628                      .dwendtag $C$DW$TU$80
    6629              
    6630              
    6631              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6632                      .dwmtype  $C$DW$T$41
    6633              
    6634              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6635                      .dwattr $C$DW$T$41, DW_AT_name("_Complex_long_double")
    6636                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6637              $C$DW$409       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$40)
    6639                      .dwattr $C$DW$409, DW_AT_name("_Vals")
    6640                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6641                      .dwattr $C$DW$409, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837
    6642                      .dwattr $C$DW$409, DW_AT_decl_line(0xf4)
    6643                      .dwattr $C$DW$409, DW_AT_decl_column(0x14)
    6644              
    6645                      .dwendtag $C$DW$T$41
    6646              
    6647                      .dwendtag $C$DW$TU$41
    6648              
    6649              
    6650              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    6651                      .dwmtype  $C$DW$T$82
    6652              $C$DW$T$82      .dwtag  DW_TAG_typedef
    6653                      .dwattr $C$DW$T$82, DW_AT_name("_Complex_long_double")
    6654                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$41)
    6655                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F283
    6656                      .dwattr $C$DW$T$82, DW_AT_decl_line(0xf4)
    6657                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x14)
    6658              
    6659                      .dwendtag $C$DW$TU$82
    6660              
    6661              
    6662              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    6663                      .dwmtype  $C$DW$T$2
    6664              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6665                      .dwattr $C$DW$T$2, DW_AT_name("void")
    6666              
    6667                      .dwendtag $C$DW$TU$2
    6668              
    6669              
    6670              $C$DW$TU$83     .dwtag  DW_TAG_type_unit
    6671                      .dwmtype  $C$DW$T$83
    6672              
    6673              $C$DW$T$83      .dwtag  DW_TAG_subroutine_type
    6674                      .dwendtag $C$DW$T$83
    6675              
    6676                      .dwendtag $C$DW$TU$83
    6677              
    6678              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  132

    6679              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    6680                      .dwmtype  $C$DW$T$84
    6681              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    6682                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    6683                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    6684              
    6685                      .dwendtag $C$DW$TU$84
    6686              
    6687              
    6688              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    6689                      .dwmtype  $C$DW$T$4
    6690              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6691                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6692                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6693                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6694              
    6695                      .dwendtag $C$DW$TU$4
    6696              
    6697              
    6698              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    6699                      .dwmtype  $C$DW$T$5
    6700              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6701                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6702                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6703                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6704              
    6705                      .dwendtag $C$DW$TU$5
    6706              
    6707              
    6708              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    6709                      .dwmtype  $C$DW$T$6
    6710              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6711                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6712                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6713                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6714              
    6715                      .dwendtag $C$DW$TU$6
    6716              
    6717              
    6718              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    6719                      .dwmtype  $C$DW$T$7
    6720              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6721                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6722                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6723                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    6724              
    6725                      .dwendtag $C$DW$TU$7
    6726              
    6727              
    6728              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    6729                      .dwmtype  $C$DW$T$8
    6730              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6731                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6732                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6733                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  133

    6734              
    6735                      .dwendtag $C$DW$TU$8
    6736              
    6737              
    6738              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    6739                      .dwmtype  $C$DW$T$9
    6740              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6741                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6742                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6743                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6744              
    6745                      .dwendtag $C$DW$TU$9
    6746              
    6747              
    6748              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    6749                      .dwmtype  $C$DW$T$10
    6750              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6751                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6752                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6753                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    6754              
    6755                      .dwendtag $C$DW$TU$10
    6756              
    6757              
    6758              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    6759                      .dwmtype  $C$DW$T$28
    6760              $C$DW$T$28      .dwtag  DW_TAG_typedef
    6761                      .dwattr $C$DW$T$28, DW_AT_name("__int16_t")
    6762                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$10)
    6763                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6764                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x40)
    6765                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x1d)
    6766              
    6767                      .dwendtag $C$DW$TU$28
    6768              
    6769              
    6770              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6771                      .dwmtype  $C$DW$T$29
    6772              $C$DW$T$29      .dwtag  DW_TAG_typedef
    6773                      .dwattr $C$DW$T$29, DW_AT_name("int16_t")
    6774                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6775                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6776                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x2b)
    6777                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x14)
    6778              
    6779                      .dwendtag $C$DW$TU$29
    6780              
    6781              
    6782              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    6783                      .dwmtype  $C$DW$T$34
    6784              
    6785              $C$DW$T$34      .dwtag  DW_TAG_array_type
    6786                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    6787                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
    6788              $C$DW$410       .dwtag  DW_TAG_subrange_type
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  134

    6789                      .dwattr $C$DW$410, DW_AT_upper_bound(0x1f)
    6790              
    6791                      .dwendtag $C$DW$T$34
    6792              
    6793                      .dwendtag $C$DW$TU$34
    6794              
    6795              
    6796              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
    6797                      .dwmtype  $C$DW$T$11
    6798              $C$DW$T$11      .dwtag  DW_TAG_base_type
    6799                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6800                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6801                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6802              
    6803                      .dwendtag $C$DW$TU$11
    6804              
    6805              
    6806              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    6807                      .dwmtype  $C$DW$T$19
    6808              $C$DW$T$19      .dwtag  DW_TAG_typedef
    6809                      .dwattr $C$DW$T$19, DW_AT_name("__uint16_t")
    6810                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    6811                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6812                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x41)
    6813                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    6814              
    6815                      .dwendtag $C$DW$TU$19
    6816              
    6817              
    6818              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    6819                      .dwmtype  $C$DW$T$20
    6820              $C$DW$T$20      .dwtag  DW_TAG_typedef
    6821                      .dwattr $C$DW$T$20, DW_AT_name("uint16_t")
    6822                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    6823                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6824                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
    6825                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x15)
    6826              
    6827                      .dwendtag $C$DW$TU$20
    6828              
    6829              
    6830              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    6831                      .dwmtype  $C$DW$T$126
    6832              
    6833              $C$DW$T$126     .dwtag  DW_TAG_array_type
    6834                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$20)
    6835                      .dwattr $C$DW$T$126, DW_AT_byte_size(0x04)
    6836              $C$DW$411       .dwtag  DW_TAG_subrange_type
    6837                      .dwattr $C$DW$411, DW_AT_upper_bound(0x03)
    6838              
    6839                      .dwendtag $C$DW$T$126
    6840              
    6841                      .dwendtag $C$DW$TU$126
    6842              
    6843              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  135

    6844              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    6845                      .dwmtype  $C$DW$T$21
    6846              $C$DW$412       .dwtag  DW_TAG_TI_far_type
    6847                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    6848              
    6849              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    6850                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$412)
    6851              
    6852                      .dwendtag $C$DW$TU$21
    6853              
    6854              
    6855              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    6856                      .dwmtype  $C$DW$T$12
    6857              $C$DW$T$12      .dwtag  DW_TAG_base_type
    6858                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6859                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6860                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6861              
    6862                      .dwendtag $C$DW$TU$12
    6863              
    6864              
    6865              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    6866                      .dwmtype  $C$DW$T$22
    6867              $C$DW$T$22      .dwtag  DW_TAG_typedef
    6868                      .dwattr $C$DW$T$22, DW_AT_name("__int32_t")
    6869                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$12)
    6870                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6871                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x42)
    6872                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x1d)
    6873              
    6874                      .dwendtag $C$DW$TU$22
    6875              
    6876              
    6877              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    6878                      .dwmtype  $C$DW$T$23
    6879              $C$DW$T$23      .dwtag  DW_TAG_typedef
    6880                      .dwattr $C$DW$T$23, DW_AT_name("int32_t")
    6881                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    6882                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6883                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x30)
    6884                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x14)
    6885              
    6886                      .dwendtag $C$DW$TU$23
    6887              
    6888              
    6889              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    6890                      .dwmtype  $C$DW$T$24
    6891              $C$DW$413       .dwtag  DW_TAG_TI_far_type
    6892                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    6893              
    6894              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    6895                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$413)
    6896              
    6897                      .dwendtag $C$DW$TU$24
    6898              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  136

    6899              
    6900              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    6901                      .dwmtype  $C$DW$T$13
    6902              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6903                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6904                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6905                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6906              
    6907                      .dwendtag $C$DW$TU$13
    6908              
    6909              
    6910              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    6911                      .dwmtype  $C$DW$T$42
    6912              $C$DW$T$42      .dwtag  DW_TAG_typedef
    6913                      .dwattr $C$DW$T$42, DW_AT_name("__uint32_t")
    6914                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$13)
    6915                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6916                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x43)
    6917                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x1c)
    6918              
    6919                      .dwendtag $C$DW$TU$42
    6920              
    6921              
    6922              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    6923                      .dwmtype  $C$DW$T$43
    6924              $C$DW$T$43      .dwtag  DW_TAG_typedef
    6925                      .dwattr $C$DW$T$43, DW_AT_name("uint32_t")
    6926                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    6927                      .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccs1011/ccs/tools/compiler/ti-cgt-c2000_20.2.4.LTS/include
    6928                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x46)
    6929                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x15)
    6930              
    6931                      .dwendtag $C$DW$TU$43
    6932              
    6933              
    6934              $C$DW$TU$14     .dwtag  DW_TAG_type_unit
    6935                      .dwmtype  $C$DW$T$14
    6936              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6937                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6938                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6939                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6940              
    6941                      .dwendtag $C$DW$TU$14
    6942              
    6943              
    6944              $C$DW$TU$15     .dwtag  DW_TAG_type_unit
    6945                      .dwmtype  $C$DW$T$15
    6946              $C$DW$T$15      .dwtag  DW_TAG_base_type
    6947                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6948                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6949                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    6950              
    6951                      .dwendtag $C$DW$TU$15
    6952              
    6953              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  137

    6954              $C$DW$TU$16     .dwtag  DW_TAG_type_unit
    6955                      .dwmtype  $C$DW$T$16
    6956              $C$DW$T$16      .dwtag  DW_TAG_base_type
    6957                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6958                      .dwattr $C$DW$T$16, DW_AT_name("float")
    6959                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    6960              
    6961                      .dwendtag $C$DW$TU$16
    6962              
    6963              
    6964              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    6965                      .dwmtype  $C$DW$T$38
    6966              
    6967              $C$DW$T$38      .dwtag  DW_TAG_array_type
    6968                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$16)
    6969                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    6970              $C$DW$414       .dwtag  DW_TAG_subrange_type
    6971                      .dwattr $C$DW$414, DW_AT_upper_bound(0x01)
    6972              
    6973                      .dwendtag $C$DW$T$38
    6974              
    6975                      .dwendtag $C$DW$TU$38
    6976              
    6977              
    6978              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6979                      .dwmtype  $C$DW$T$102
    6980              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    6981                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$16)
    6982                      .dwattr $C$DW$T$102, DW_AT_address_class(0x20)
    6983              
    6984                      .dwendtag $C$DW$TU$102
    6985              
    6986              
    6987              $C$DW$TU$136    .dwtag  DW_TAG_type_unit
    6988                      .dwmtype  $C$DW$T$136
    6989              $C$DW$415       .dwtag  DW_TAG_TI_far_type
    6990                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$16)
    6991              
    6992              $C$DW$T$136     .dwtag  DW_TAG_const_type
    6993                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$415)
    6994              
    6995                      .dwendtag $C$DW$TU$136
    6996              
    6997              
    6998              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    6999                      .dwmtype  $C$DW$T$26
    7000              $C$DW$T$26      .dwtag  DW_TAG_typedef
    7001                      .dwattr $C$DW$T$26, DW_AT_name("float32_t")
    7002                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$16)
    7003                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\c2000\C2000Ware_DigitalPower_SDK_3_01_00_00\c2000ware\driv
    7004                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x5e)
    7005                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x17)
    7006              
    7007                      .dwendtag $C$DW$TU$26
    7008              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
bts_main.asm                                                         PAGE  138

    7009              
    7010              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    7011                      .dwmtype  $C$DW$T$27
    7012              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    7013                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    7014                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    7015              
    7016                      .dwendtag $C$DW$TU$27
    7017              
    7018              
    7019              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    7020                      .dwmtype  $C$DW$T$31
    7021              $C$DW$416       .dwtag  DW_TAG_TI_far_type
    7022                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$26)
    7023              
    7024              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    7025                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$416)
    7026              
    7027                      .dwendtag $C$DW$TU$31
    7028              
    7029              
    7030              $C$DW$TU$17     .dwtag  DW_TAG_type_unit
    7031                      .dwmtype  $C$DW$T$17
    7032              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7033                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7034                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7035                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    7036              
    7037                      .dwendtag $C$DW$TU$17
    7038              
    7039              
    7040              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    7041                      .dwmtype  $C$DW$T$36
    7042              
    7043              $C$DW$T$36      .dwtag  DW_TAG_array_type
    7044                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$17)
    7045                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    7046              $C$DW$417       .dwtag  DW_TAG_subrange_type
    7047                      .dwattr $C$DW$417, DW_AT_upper_bound(0x01)
    7048              
    7049                      .dwendtag $C$DW$T$36
    7050              
    7051                      .dwendtag $C$DW$TU$36
    7052              
    7053              
    7054              $C$DW$TU$139    .dwtag  DW_TAG_type_unit
    7055                      .dwmtype  $C$DW$T$139
    7056              $C$DW$T$139     .dwtag  DW_TAG_pointer_type
    7057                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$17)
    7058                      .dwattr $C$DW$T$139, DW_AT_address_class(0x20)
    7059              
    7060                      .dwendtag $C$DW$TU$139
    7061              
    7062              
    7063              $C$DW$TU$140    .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:24:44 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
