TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.4.LTS *
       3              ;* Date/Time created: Tue Mar  2 07:22:06 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../libraries/sfra/sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.4.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\sandbox\github\Lion-IRVT\Hardware\source\tida-010086\bts_F2837xD
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5528                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x7d)
    5529                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5530                      .dwendtag $C$DW$T$24
    5531              
    5532                      .dwendtag $C$DW$TU$24
    5533              
    5534              
    5535              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5536                      .dwmtype  $C$DW$T$25
    5537              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5538                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5539                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5540                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5541                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x80)
    5542                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5543              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  108

    5544                      .dwendtag $C$DW$TU$25
    5545              
    5546              
    5547              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5548                      .dwmtype  $C$DW$T$26
    5549              
    5550              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5551                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5552              $C$DW$302       .dwtag  DW_TAG_enumerator
    5553                      .dwattr $C$DW$302, DW_AT_name("GPIO_QUAL_SYNC")
    5554                      .dwattr $C$DW$302, DW_AT_const_value(0x00)
    5555                      .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5556                      .dwattr $C$DW$302, DW_AT_decl_line(0x97)
    5557                      .dwattr $C$DW$302, DW_AT_decl_column(0x05)
    5558              
    5559              $C$DW$303       .dwtag  DW_TAG_enumerator
    5560                      .dwattr $C$DW$303, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5561                      .dwattr $C$DW$303, DW_AT_const_value(0x01)
    5562                      .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5563                      .dwattr $C$DW$303, DW_AT_decl_line(0x98)
    5564                      .dwattr $C$DW$303, DW_AT_decl_column(0x05)
    5565              
    5566              $C$DW$304       .dwtag  DW_TAG_enumerator
    5567                      .dwattr $C$DW$304, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5568                      .dwattr $C$DW$304, DW_AT_const_value(0x02)
    5569                      .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5570                      .dwattr $C$DW$304, DW_AT_decl_line(0x99)
    5571                      .dwattr $C$DW$304, DW_AT_decl_column(0x05)
    5572              
    5573              $C$DW$305       .dwtag  DW_TAG_enumerator
    5574                      .dwattr $C$DW$305, DW_AT_name("GPIO_QUAL_ASYNC")
    5575                      .dwattr $C$DW$305, DW_AT_const_value(0x03)
    5576                      .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/drive
    5577                      .dwattr $C$DW$305, DW_AT_decl_line(0x9a)
    5578                      .dwattr $C$DW$305, DW_AT_decl_column(0x05)
    5579              
    5580                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5581                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x96)
    5582                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5583                      .dwendtag $C$DW$T$26
    5584              
    5585                      .dwendtag $C$DW$TU$26
    5586              
    5587              
    5588              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5589                      .dwmtype  $C$DW$T$27
    5590              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5591                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5592                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5593                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/c2000/C2000Ware_DigitalPower_SDK_3_01_00_00/c2000ware/driv
    5594                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x9b)
    5595                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5596              
    5597                      .dwendtag $C$DW$TU$27
    5598              
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  109

    5599              
    5600              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5601                      .dwmtype  $C$DW$T$23
    5602              
    5603              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5604                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    5605              $C$DW$306       .dwtag  DW_TAG_member
    5606                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    5607                      .dwattr $C$DW$306, DW_AT_name("h_magVect")
    5608                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5609                      .dwattr $C$DW$306, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5610                      .dwattr $C$DW$306, DW_AT_decl_line(0x40)
    5611                      .dwattr $C$DW$306, DW_AT_decl_column(0x10)
    5612              
    5613              $C$DW$307       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    5615                      .dwattr $C$DW$307, DW_AT_name("h_phaseVect")
    5616                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5617                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5618                      .dwattr $C$DW$307, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5619                      .dwattr $C$DW$307, DW_AT_decl_line(0x41)
    5620                      .dwattr $C$DW$307, DW_AT_decl_column(0x10)
    5621              
    5622              $C$DW$308       .dwtag  DW_TAG_member
    5623                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    5624                      .dwattr $C$DW$308, DW_AT_name("gh_magVect")
    5625                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5626                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5627                      .dwattr $C$DW$308, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5628                      .dwattr $C$DW$308, DW_AT_decl_line(0x42)
    5629                      .dwattr $C$DW$308, DW_AT_decl_column(0x10)
    5630              
    5631              $C$DW$309       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    5633                      .dwattr $C$DW$309, DW_AT_name("gh_phaseVect")
    5634                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5635                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5636                      .dwattr $C$DW$309, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5637                      .dwattr $C$DW$309, DW_AT_decl_line(0x43)
    5638                      .dwattr $C$DW$309, DW_AT_decl_column(0x10)
    5639              
    5640              $C$DW$310       .dwtag  DW_TAG_member
    5641                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    5642                      .dwattr $C$DW$310, DW_AT_name("cl_magVect")
    5643                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5644                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5645                      .dwattr $C$DW$310, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5646                      .dwattr $C$DW$310, DW_AT_decl_line(0x44)
    5647                      .dwattr $C$DW$310, DW_AT_decl_column(0x10)
    5648              
    5649              $C$DW$311       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    5651                      .dwattr $C$DW$311, DW_AT_name("cl_phaseVect")
    5652                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5653                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  110

    5654                      .dwattr $C$DW$311, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5655                      .dwattr $C$DW$311, DW_AT_decl_line(0x45)
    5656                      .dwattr $C$DW$311, DW_AT_decl_column(0x10)
    5657              
    5658              $C$DW$312       .dwtag  DW_TAG_member
    5659                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    5660                      .dwattr $C$DW$312, DW_AT_name("freqVect")
    5661                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5662                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5663                      .dwattr $C$DW$312, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5664                      .dwattr $C$DW$312, DW_AT_decl_line(0x46)
    5665                      .dwattr $C$DW$312, DW_AT_decl_column(0x10)
    5666              
    5667              $C$DW$313       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    5669                      .dwattr $C$DW$313, DW_AT_name("amplitude")
    5670                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5671                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5672                      .dwattr $C$DW$313, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5673                      .dwattr $C$DW$313, DW_AT_decl_line(0x47)
    5674                      .dwattr $C$DW$313, DW_AT_decl_column(0x0f)
    5675              
    5676              $C$DW$314       .dwtag  DW_TAG_member
    5677                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    5678                      .dwattr $C$DW$314, DW_AT_name("isrFreq")
    5679                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5680                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5681                      .dwattr $C$DW$314, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5682                      .dwattr $C$DW$314, DW_AT_decl_line(0x48)
    5683                      .dwattr $C$DW$314, DW_AT_decl_column(0x0f)
    5684              
    5685              $C$DW$315       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    5687                      .dwattr $C$DW$315, DW_AT_name("freqStart")
    5688                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5689                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5690                      .dwattr $C$DW$315, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5691                      .dwattr $C$DW$315, DW_AT_decl_line(0x49)
    5692                      .dwattr $C$DW$315, DW_AT_decl_column(0x0f)
    5693              
    5694              $C$DW$316       .dwtag  DW_TAG_member
    5695                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    5696                      .dwattr $C$DW$316, DW_AT_name("freqStep")
    5697                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5698                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5699                      .dwattr $C$DW$316, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5700                      .dwattr $C$DW$316, DW_AT_decl_line(0x4a)
    5701                      .dwattr $C$DW$316, DW_AT_decl_column(0x0f)
    5702              
    5703              $C$DW$317       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$22)
    5705                      .dwattr $C$DW$317, DW_AT_name("start")
    5706                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5707                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5708                      .dwattr $C$DW$317, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  111

    5709                      .dwattr $C$DW$317, DW_AT_decl_line(0x4b)
    5710                      .dwattr $C$DW$317, DW_AT_decl_column(0x0d)
    5711              
    5712              $C$DW$318       .dwtag  DW_TAG_member
    5713                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$22)
    5714                      .dwattr $C$DW$318, DW_AT_name("state")
    5715                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5716                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5717                      .dwattr $C$DW$318, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5718                      .dwattr $C$DW$318, DW_AT_decl_line(0x4c)
    5719                      .dwattr $C$DW$318, DW_AT_decl_column(0x0d)
    5720              
    5721              $C$DW$319       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    5723                      .dwattr $C$DW$319, DW_AT_name("status")
    5724                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5725                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5726                      .dwattr $C$DW$319, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5727                      .dwattr $C$DW$319, DW_AT_decl_line(0x4d)
    5728                      .dwattr $C$DW$319, DW_AT_decl_column(0x0d)
    5729              
    5730              $C$DW$320       .dwtag  DW_TAG_member
    5731                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$22)
    5732                      .dwattr $C$DW$320, DW_AT_name("vecLength")
    5733                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5734                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5735                      .dwattr $C$DW$320, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5736                      .dwattr $C$DW$320, DW_AT_decl_line(0x4e)
    5737                      .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    5738              
    5739              $C$DW$321       .dwtag  DW_TAG_member
    5740                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    5741                      .dwattr $C$DW$321, DW_AT_name("freqIndex")
    5742                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5743                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5744                      .dwattr $C$DW$321, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5745                      .dwattr $C$DW$321, DW_AT_decl_line(0x4f)
    5746                      .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    5747              
    5748              $C$DW$322       .dwtag  DW_TAG_member
    5749                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    5750                      .dwattr $C$DW$322, DW_AT_name("storeH")
    5751                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5752                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5753                      .dwattr $C$DW$322, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5754                      .dwattr $C$DW$322, DW_AT_decl_line(0x50)
    5755                      .dwattr $C$DW$322, DW_AT_decl_column(0x0d)
    5756              
    5757              $C$DW$323       .dwtag  DW_TAG_member
    5758                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$22)
    5759                      .dwattr $C$DW$323, DW_AT_name("storeGH")
    5760                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5761                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5762                      .dwattr $C$DW$323, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5763                      .dwattr $C$DW$323, DW_AT_decl_line(0x51)
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  112

    5764                      .dwattr $C$DW$323, DW_AT_decl_column(0x0d)
    5765              
    5766              $C$DW$324       .dwtag  DW_TAG_member
    5767                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    5768                      .dwattr $C$DW$324, DW_AT_name("storeCL")
    5769                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5770                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5771                      .dwattr $C$DW$324, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5772                      .dwattr $C$DW$324, DW_AT_decl_line(0x52)
    5773                      .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    5774              
    5775              $C$DW$325       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$22)
    5777                      .dwattr $C$DW$325, DW_AT_name("speed")
    5778                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5779                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5780                      .dwattr $C$DW$325, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5781                      .dwattr $C$DW$325, DW_AT_decl_line(0x53)
    5782                      .dwattr $C$DW$325, DW_AT_decl_column(0x0d)
    5783              
    5784                      .dwattr $C$DW$T$23, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5785                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    5786                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    5787                      .dwendtag $C$DW$T$23
    5788              
    5789                      .dwendtag $C$DW$TU$23
    5790              
    5791              
    5792              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5793                      .dwmtype  $C$DW$T$28
    5794              $C$DW$T$28      .dwtag  DW_TAG_typedef
    5795                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    5796                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    5797                      .dwattr $C$DW$T$28, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5798                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    5799                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    5800              
    5801                      .dwendtag $C$DW$TU$28
    5802              
    5803              
    5804              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5805                      .dwmtype  $C$DW$T$29
    5806              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    5807                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5808                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    5809              
    5810                      .dwendtag $C$DW$TU$29
    5811              
    5812              
    5813              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5814                      .dwmtype  $C$DW$T$30
    5815              $C$DW$326       .dwtag  DW_TAG_TI_far_type
    5816                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    5817              
    5818              $C$DW$T$30      .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v20.2.4 Tue Mar  2 07:22:06 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  113

    5819                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$326)
    5820              
    5821                      .dwendtag $C$DW$TU$30
    5822              
    5823              
    5824              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    5825                      .dwmtype  $C$DW$T$2
    5826              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5827                      .dwattr $C$DW$T$2, DW_AT_name("void")
    5828              
    5829                      .dwendtag $C$DW$TU$2
    5830              
    5831              
    5832              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    5833                      .dwmtype  $C$DW$T$51
    5834              
    5835              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    5836                      .dwendtag $C$DW$T$51
    5837              
    5838                      .dwendtag $C$DW$TU$51
    5839              
    5840              
    5841              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    5842                      .dwmtype  $C$DW$T$52
    5843              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    5844                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5845                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    5846              
    5847                      .dwendtag $C$DW$TU$52
    5848              
    5849              
    5850              $C$DW$TU$53     .dwtag  DW_TAG_type_unit
    5851                      .dwmtype  $C$DW$T$53
